{"start": 0, "end": 2, "speaker": "Igor Skrynkovskyy", "text": "Я просто ему запись скину.", "confidence": 0.94}
{"start": 3, "end": 4, "speaker": "Dan Khasis", "text": "Окей, сейчас, секунду.", "confidence": 0.99}
{"start": 4, "end": 6, "speaker": "Igor Skrynkovskyy", "text": "Я ссылку продублировал тоже.", "confidence": 0.77}
{"start": 25, "end": 37.0, "speaker": "Dan Khasis", "text": "Начинаю с типа вещи.", "confidence": 0.95}
{"start": 37.0, "end": 49.0, "speaker": "Dan Khasis", "text": "Например, у нас сейчас ошибочно зафиксированы атрибуты на уровне машины.", "confidence": 0.95}
{"start": 49.0, "end": 61.0, "speaker": "Dan Khasis", "text": "Хотя это не только машина может быть, это может быть любая вещь.", "confidence": 0.95}
{"start": 61.0, "end": 73.0, "speaker": "Dan Khasis", "text": "Но, например, генератор или экскаватор и так далее.", "confidence": 0.95}
{"start": 73.0, "end": 85.0, "speaker": "Dan Khasis", "text": "Если мы сюда посмотрим, мы увидим, что здесь есть разные типы атрибутов, которые можно наращивать на один индивидуальный asset.", "confidence": 0.95}
{"start": 85.0, "end": 97.0, "speaker": "Dan Khasis", "text": "В принципе, вехал это есть тип asset.", "confidence": 0.95}
{"start": 97.0, "end": 109.0, "speaker": "Dan Khasis", "text": "По-хорошему было бы вехал промапать на asset, но сейчас это слишком поздно делать.", "confidence": 0.95}
{"start": 109.0, "end": 121.0, "speaker": "Dan Khasis", "text": "Если посмотреть на график, у нас есть asset.", "confidence": 0.95}
{"start": 121.0, "end": 133.0, "speaker": "Dan Khasis", "text": "Asset сохраняется в списке asset master, как бы мастер список ассетов, где действительно уникальная какая-то вещь, какая-то физическая вещь.", "confidence": 0.95}
{"start": 133.0, "end": 145.0, "speaker": "Dan Khasis", "text": "И потом эта физическая вещь имеет атрибуты.", "confidence": 0.95}
{"start": 145.0, "end": 157.0, "speaker": "Dan Khasis", "text": "И эти атрибуты являются в паттерне Entity Attribute Value, где идет, что такой-то asset имеет такой-то атрибут, который имеет такой-то value.", "confidence": 0.95}
{"start": 157.0, "end": 169.0, "speaker": "Dan Khasis", "text": "И вот этот атрибут type из этой таблицы Attribute Types, это вместо того, чтобы как мы в Vehicles таблице по колонкам сохраняем фиксированные эти колонки для хардкодженных атрибутов, это сохраняет это рядами, чтобы можно было иметь или 0, или неограниченное количество атрибутов на одного asset.", "confidence": 0.95}
{"start": 169.0, "end": 181.0, "speaker": "Dan Khasis", "text": "Чтобы если надо наращивать типы атрибутов, не надо модифицировать колонки.", "confidence": 0.95}
{"start": 181.0, "end": 193.0, "speaker": "Dan Khasis", "text": "И постоянно модифицировать кодовую базу для эластик индексинга, потому что эластик индекс по атрибутам сразу будет видеть все динамически новые атрибуты.", "confidence": 0.95}
{"start": 193.0, "end": 205.0, "speaker": "Dan Khasis", "text": "Так это описывает, что на какой-то вещи есть какой-то атрибут, но чтобы это добиться, нужно иметь таблицу, которая пересекает ассет мастер список, где у нас есть список Attribute Types, его надо линкнуть к конкретному ассету, то есть один ассет будет иметь множество, один к многим, ассет атрибут линковку, ассет атрибут, и в эту таблицу входит asset id и asset type id, не совсем верно, ассет атрибут type id.", "confidence": 0.95}
{"start": 205.0, "end": 217.0, "speaker": "Dan Khasis", "text": "И теперь выглядит, если посмотреть на экземплярную вещь, что у тебя есть генератор с каким-то сериальным номером, или у тебя есть, например, трейлер, который имеет какой-то регистрационный номер в таком-то штате, потом, в принципе, это можно больше и больше нормализировать, но в первой версии нам не надо, например, марка, например, версия, поколение и так далее.", "confidence": 0.95}
{"start": 217.0, "end": 229.0, "speaker": "Dan Khasis", "text": "То есть все вот эти вещи теперь присваиваются, где по умолчанию мы не должны ничего вообще вписывать, мы просто можем сказать, что вот есть мусорный бак, waste management, есть мусорный бак, garbage can, и в garbage can может быть идентификатор, а может нету.", "confidence": 0.95}
{"start": 229.0, "end": 241.0, "speaker": "Dan Khasis", "text": "Если есть, он будет здесь, serial number, например, и будет, например, дата покупки тоже может быть, если они хотят, все optional, и все.", "confidence": 0.95}
{"start": 241.0, "end": 253.0, "speaker": "Dan Khasis", "text": "В принципе, здесь не нужно иметь last service date и next service date.", "confidence": 0.95}
{"start": 253.0, "end": 265.0, "speaker": "Dan Khasis", "text": "Совсем верно.", "confidence": 0.95}
{"start": 265.0, "end": 277.0, "speaker": "Dan Khasis", "text": "Это неправильно здесь держать.", "confidence": 0.95}
{"start": 277.0, "end": 289.0, "speaker": "Dan Khasis", "text": "Operational attributes.", "confidence": 0.95}
{"start": 293, "end": 295, "speaker": "Dan Khasis", "text": "Это другой тип атрибута, правильно?", "confidence": 0.99}
{"start": 295, "end": 314.5, "speaker": "Dan Khasis", "text": "Да, это больше как статусы.", "confidence": 0.95}
{"start": 314.5, "end": 334.0, "speaker": "Dan Khasis", "text": "Мы можем забыть о них, но все другое правильно.", "confidence": 0.95}
{"start": 334.0, "end": 353.5, "speaker": "Dan Khasis", "text": "И теперь у нас получается, что мы теперь поняли, что есть asset master список, который и asset master, и атрибуты, и атрибуты приходят из таблицы типов атрибутов, и туда наращивается или ноль записей, или если sync, например, с GOTAB, SMS, у них есть asset, и если у них есть действительно serial number, тогда мы его туда поставим.", "confidence": 0.95}
{"start": 353.5, "end": 373.0, "speaker": "Dan Khasis", "text": "Мы, в принципе, можем поставить, например, как экземпляр, почему мы можем больше asset типов прибавлять, мы можем прибавить еще один тип и написать, что, например, мы хотим сделать 26 тип ассета, категория номер 2, максимальное количество оборотов в минуту.", "confidence": 0.95}
{"start": 374, "end": 375, "speaker": "Dan Khasis", "text": "И потом...", "confidence": 0.9}
{"start": 380, "end": 383, "speaker": "Igor Skrynkovskyy", "text": "А тогда это не должна быть operational metric?", "confidence": 0.99}
{"start": 384, "end": 415, "speaker": "Dan Khasis", "text": "Нет, потому что это больше как вес машины, это как констант, что генератор не надо... То есть мы хотим там 6000 оборотов в минуту лимит, а сколько конкретно оборотов, это уже мы сохраняем в другом месте. Это описывает атрибут для сохранения, может быть, допустимых погрешностей или диапазонов.\n\nПонимаешь разницу?", "confidence": 0.89}
{"start": 416, "end": 433, "speaker": "Igor Skrynkovskyy", "text": "Да. А не стоит тогда, например, для этого атрибута какую-то группу другую вывести, выбрать или там класс, чтобы это типа прям было, что это какие-то лимиты или limitation или что-то такое.", "confidence": 0.89}
{"start": 434, "end": 506, "speaker": "Dan Khasis", "text": "Да, это хорошее замечание, это можно сделать. Но тогда это открывает вторую тему, что есть третья таблица, атрибут тип категории. Это очень элементарная таблица.\n\nИ туда идет категория типов атрибуты, чтобы можно было на фронт-энде динамически отпутать точерние группы из бэкэнда, чтобы не надо колонки хардкоджить. То есть если у нас будет эта колонка, эта колонка, эта колонка, и мы можем сделать еще, например, новую категорию. Пятую, например, operating guidelines and specifications, берем вот этот сюда, прибавляем сюда, и потом делаем новую категорию.\n\nИ вот в этом случае мы делаем пятую категорию.", "confidence": 0.67}
{"start": 509, "end": 533, "speaker": "Igor Skrynkovskyy", "text": "Дэн, а смотри, а не лучше вот эти айдишки, которые здесь прописаны, делать их сразу какими-то UUID или чем-то другим? Потому что может быть такое, что кастомер какой-то придет и скажет, я хочу создавать свои какие-то вот эти категории и так далее. И чтобы мы могли их как бы тоже создавать в реальном времени.", "confidence": 0.99}
{"start": 535, "end": 584, "speaker": "Dan Khasis", "text": "Можем, но я не хочу сейчас это делать. Я хочу сделать самое примитивное, что мы классифицируем категории, и это достаточно фиксировано. И потом это уже будет как бы другая вещь.\n\nУ кастомера есть возможность категоризировать другие вещи, я покажу через секунду. Так, теперь мы вставили, например, operational, operating guidelines and specs. Там нам пятерку надо поставить.\n\nДа, она защитит нас. Сейчас, секунду. Если хочешь, гарантированно.", "confidence": 0.64}
{"start": 600, "end": 602, "speaker": "Dan Khasis", "text": "Здесь надо стирать первое.", "confidence": 0.72}
{"start": 616, "end": 727, "speaker": "Dan Khasis", "text": "Окей, так теперь у нас есть новый тип, и мы легко его прибавили. Потом следующая вещь – это тип самого asset. То есть первая категория, если мы посмотрим на asset, у него есть две характеристики, может даже три.\n\nПервая – это конкретные атрибуты, которые его описывают. Третья – это категория этого asset. Это как бы типификация, о чем речь идет.\n\nИ третья – это конкретные значения, как бы оперативные, operational values, мы еще не дошли до этого. В категоризации asset у него есть только один в один линковка. То есть мусорный бак, мусорное ведро, recycling, навоз, радиоактивная какая-то фигня, химия, масло, нефть.\n\nИ вот это все разные варианты. Но эти варианты тоже имеют категории. И мы хотим эти категории легко и чисто показывать на фронт-энде.\n\nПонимаешь? Теперь вот эти категоризации тоже есть, и они существуют в этой таблице, которая называется asset category tips. И где сохраняется это?\n\nЕсли посмотреть теперь на item master, у него есть тип. А у типа есть категория.", "confidence": 0.74}
{"start": 730, "end": 731, "speaker": "Dan Khasis", "text": "И вот эта категория пишется здесь.", "confidence": 0.35}
{"start": 742, "end": 742, "speaker": "Igor Skrynkovskyy", "text": "Да, понятно.", "confidence": 0.69}
{"start": 752, "end": 755, "speaker": "Igor Skrynkovskyy", "text": "Дэн, смотри, ты тут?", "confidence": 0.99}
{"start": 756, "end": 757, "speaker": "Dan Khasis", "text": "Я тут.", "confidence": 0.76}
{"start": 758, "end": 782, "speaker": "Igor Skrynkovskyy", "text": "Смотри, у нас там есть таблица route for me asset groups. Там есть поле, которое bin 16, asset group type id. Что это?\n\nЧто это за поле? За что она отвечает? Это asset types, вот эти, которые у нас есть снизу.\n\ndim asset types. Из этой таблицы.", "confidence": 0.99}
{"start": 787, "end": 789, "speaker": "Dan Khasis", "text": "Какое поле тебя возмущает?", "confidence": 0.99}
{"start": 790, "end": 792.5, "speaker": "Igor Skrynkovskyy", "text": "route for me asset group таблица.", "confidence": 0.95}
{"start": 792.5, "end": 795.0, "speaker": "Igor Skrynkovskyy", "text": "И в нем есть asset group type id.", "confidence": 0.95}
{"start": 798, "end": 857, "speaker": "Dan Khasis", "text": "Asset groups, это здесь описано, позволяет каждому пользователю классифицировать свои ассеты в группы, которые лично они хотят удовлетворять. Например, у тебя есть master asset список. У тебя есть asset, у ассета есть атрибуты, энное количество атрибутов.\n\nПотом у этого ассета одновременно есть тип. У него есть один тип. И потом этот ассет может быть в произвольно созданных групп.\n\nИ потом идет линковка между ассетом и группами. И в G это asset groups. Это как search groups.\n\nЭто как произвольно сгенерированное. Просто как бы семантик какого-то слова. Например, я не знаю, там.", "confidence": 0.99}
{"start": 858, "end": 860, "speaker": "Dan Khasis", "text": "Я понимаю, логическая группа.", "confidence": 0.99}
{"start": 860, "end": 921, "speaker": "Dan Khasis", "text": "Минская область. И ты взял и просто захуярил все ассеты. Один, два, три генератора атомной станции.\n\nТы их взял и загнал в Минскую область. И теперь у тебя есть группа Минской области. Ты хочешь взять и показать все вещи в этой группе.\n\nКак бы произвольная группировка. Вот и все, что это. А assets and groups, это линкует этот ID с этой группой.\n\nЗдесь только не хватает одной вещи. И это, наверное, я должен подумать, это линковка facilities. Потому что asset надо линковать к facility иногда.\n\nТак надо сделать, в принципе, копию таблицы assets and groups. И как я помню, мы сделали attribution таблицу, где facility это просто один тип из assets.", "confidence": 0.99}
{"start": 922, "end": 952, "speaker": "Igor Skrynkovskyy", "text": "Да. Дэн, смотри, возвращаясь к вот этой таблице. Вот это group type ID, вот это поле.\n\nОно это вот это с вот этой таблицей? Потому что я не понимаю, что такое вот это byte 16 должно быть. То есть какое значение должно быть здесь?", "confidence": 0.6}
{"start": 958, "end": 959, "speaker": "Dan Khasis", "text": "Сейчас, секунду.", "confidence": 0.98}
{"start": 968, "end": 972, "speaker": "Igor Skrynkovskyy", "text": "Потому что таблицы group types у нас нет в схеме.", "confidence": 0.99}
{"start": 982, "end": 984, "speaker": "Dan Khasis", "text": "Сейчас, секунду.", "confidence": 0.99}
{"start": 1029, "end": 1054, "speaker": "Dan Khasis", "text": "Я должен подумать. Но, наверное, была причина, почему я это сделал. Может быть, изначально я хотел сделать, если это логическая группа или физическая группа, может быть, я забыл удалить это.\n\nПотому что я в середине ночи это сделал. Я закомментирую пока, чтобы она не возмущала нас.", "confidence": 0.99}
{"start": 1055, "end": 1065, "speaker": "Igor Skrynkovskyy", "text": "А, Дэн, смотри, физическая, логическая группа, физическая группа. А почему это два значения? Они же не могут быть одновременно и физической, и логической.", "confidence": 0.99}
{"start": 1066, "end": 1077.44, "speaker": "Dan Khasis", "text": "Я думал на эту тему.", "confidence": 0.95}
{"start": 1077.44, "end": 1088.89, "speaker": "Dan Khasis", "text": "У меня нет хорошего ответа, но у меня кишками чувство, что она может быть то и то одновременно.", "confidence": 0.95}
{"start": 1088.89, "end": 1100.33, "speaker": "Dan Khasis", "text": "Сейчас, секунду.", "confidence": 0.95}
{"start": 1100.33, "end": 1111.78, "speaker": "Dan Khasis", "text": "Я не знаю.", "confidence": 0.95}
{"start": 1123.22, "end": 1134.67, "speaker": "Dan Khasis", "text": "То есть у них есть и логическая, и не логическая группа, и одновременно физическая группа.", "confidence": 0.95}
{"start": 1134.67, "end": 1146.11, "speaker": "Dan Khasis", "text": "Или другой экземпляр, что в госпитале есть оборудование, оборудование, вентиляторы, мониторы, помпы.", "confidence": 0.95}
{"start": 1146.11, "end": 1157.56, "speaker": "Dan Khasis", "text": "Они все физически в том же отделе, где, например, идут процедуры и операции хирургические.", "confidence": 0.95}
{"start": 1157.56, "end": 1169.0, "speaker": "Dan Khasis", "text": "И логически они все сгруппированы как бы на том же вертикальном… Как это называется?", "confidence": 0.95}
{"start": 1170, "end": 1171, "speaker": "Igor Skrynkovskyy", "text": "Этаже.", "confidence": 0.96}
{"start": 1171, "end": 1177, "speaker": "Dan Khasis", "text": "Или не этаже, а вот на этих колесиках, где там три или четыре вещи одновременно.", "confidence": 0.91}
{"start": 1182, "end": 1187.5, "speaker": "Igor Skrynkovskyy", "text": "Ну, это понятно.", "confidence": 0.95}
{"start": 1187.5, "end": 1193.0, "speaker": "Igor Skrynkovskyy", "text": "То есть это может быть и, например… Там, например, компания одна обслуживает вот этот набор каких-то вещей.", "confidence": 0.95}
{"start": 1193, "end": 1248, "speaker": "Dan Khasis", "text": "Да, так почему это важно? Потому что вот этот конкретный клиент, который частично будет этим пользоваться, у них есть, например, машина в машине, потом есть прицеп. В прицепе есть камера номер два, камера номер один, камера номер три, камера номер четыре.\n\nПотом есть датчик для платить за трассу. Это, скажем, ассет номер пять. Потом есть smart замок security сигнализация.\n\nЭто ассет номер шесть. И теперь это все в кучу собирается и делается ассет-группа по имени… Мне кажется, у Тсоя была песня какая-то, что-то по имени что-то.", "confidence": 0.9}
{"start": 1250, "end": 1251, "speaker": "Igor Skrynkovskyy", "text": "Про солнце.", "confidence": 0.99}
{"start": 1252, "end": 1253.0, "speaker": "Dan Khasis", "text": "Да, что-то по имени солнце.", "confidence": 0.95}
{"start": 1253.0, "end": 1254.0, "speaker": "Igor Skrynkovskyy", "text": "Да.", "confidence": 0.95}
{"start": 1261, "end": 1264.25, "speaker": "Dan Khasis", "text": "Да.", "confidence": 0.95}
{"start": 1264.25, "end": 1267.5, "speaker": "Igor Skrynkovskyy", "text": "Звезда по имени солнце.", "confidence": 0.95}
{"start": 1267.5, "end": 1270.75, "speaker": "Dan Khasis", "text": "О, звезда, звезда, да.", "confidence": 0.95}
{"start": 1270.75, "end": 1274.0, "speaker": "Dan Khasis", "text": "И потом… Он наркоманом был?", "confidence": 0.95}
{"start": 1275, "end": 1277, "speaker": "Igor Skrynkovskyy", "text": "Не без этого.", "confidence": 0.99}
{"start": 1283, "end": 1292.45, "speaker": "Dan Khasis", "text": "Окей, и вот это все идет в ассет-группу, например, семь, пять, четыре, три.", "confidence": 0.95}
{"start": 1292.45, "end": 1301.91, "speaker": "Dan Khasis", "text": "И теперь в наших таблицах будет, например, записано, что вот такие-то ассеты на такой-то момент времени имели такие-то entity, такой-то attribute, такой-то value.", "confidence": 0.95}
{"start": 1301.91, "end": 1311.36, "speaker": "Dan Khasis", "text": "И на тот момент они были пролинкованы к этой ассет-группе.", "confidence": 0.95}
{"start": 1311.36, "end": 1320.82, "speaker": "Dan Khasis", "text": "И тогда, когда мы будем строить тарифы, мы будем говорить, окей, кто был в той ассет-группе, какой у нее был состав, какие у нее были значения.", "confidence": 0.95}
{"start": 1320.82, "end": 1330.27, "speaker": "Dan Khasis", "text": "То есть в этом смысле здесь дефект, что здесь отсутствуют вот эти параметры на ассет-группу.", "confidence": 0.95}
{"start": 1330.27, "end": 1339.73, "speaker": "Dan Khasis", "text": "Что здесь, в принципе, должны быть вот это.", "confidence": 0.95}
{"start": 1339.73, "end": 1349.18, "speaker": "Dan Khasis", "text": "Я хотел делать упрощенный вариант, но не получится.", "confidence": 0.95}
{"start": 1349.18, "end": 1358.64, "speaker": "Dan Khasis", "text": "Что даты должны пересекаться тоже.", "confidence": 0.95}
{"start": 1358.64, "end": 1368.09, "speaker": "Dan Khasis", "text": "Потому что когда Артем будет делать репортинг, ему нужно будет сделать, чтобы находить, что было в той группе на тот момент, и считывать их данные с другой внешней системой.", "confidence": 0.95}
{"start": 1368.09, "end": 1377.55, "speaker": "Dan Khasis", "text": "На тот момент времени, понимаешь?", "confidence": 0.95}
{"start": 1377.55, "end": 1387.0, "speaker": "Dan Khasis", "text": "Иначе не получится.", "confidence": 0.95}
{"start": 1390, "end": 1390, "speaker": "Dan Khasis", "text": "Сейчас, секунду.", "confidence": 0.65}
{"start": 1390, "end": 1394.0, "speaker": "Igor Skrynkovskyy", "text": "Да, я понимаю, но что-то оно как...", "confidence": 0.95}
{"start": 1394.0, "end": 1398.0, "speaker": "Igor Skrynkovskyy", "text": "Возможно, оно много функций дает, но оно как-то выглядит очень сложно.", "confidence": 0.95}
{"start": 1399, "end": 1439, "speaker": "Dan Khasis", "text": "Нет, потому что по умолчанию в первой версии мы просто говорим, что есть ассет-группа, которая имеет... Что в этой группе есть эти датчики, и эти датчики были пролинкованы с этой группой с этого момента до этого момента. И по умолчанию это там день рождения Иисуса Христа до конца мира.\n\nИ потом, если они берут и хотят новую линковку сделать, они делают новую линковку, мы гасим старый таймлайн, начинаем новый таймлайн. И в том новом таймлайне уже есть новая линковка в той же ассет-группе. Просто начинается снова таймлайн.", "confidence": 0.99}
{"start": 1444, "end": 1449, "speaker": "Igor Skrynkovskyy", "text": "Окей, а вот еще вопрос насчет вот этого IsCurrent. То есть, как это предполагается?", "confidence": 0.99}
{"start": 1450, "end": 1455.64, "speaker": "Dan Khasis", "text": "IsCurrent – это булгский флаг, когда у тебя есть энное количество временных таймлайнов, которые существовали.", "confidence": 0.95}
{"start": 1455.64, "end": 1461.29, "speaker": "Dan Khasis", "text": "Что IsCurrent – это флаг, который идет...", "confidence": 0.95}
{"start": 1461.29, "end": 1466.93, "speaker": "Dan Khasis", "text": "в принципе, должен идти в первичный ключ.", "confidence": 0.95}
{"start": 1466.93, "end": 1472.57, "speaker": "Dan Khasis", "text": "И что он делает?", "confidence": 0.95}
{"start": 1472.57, "end": 1478.21, "speaker": "Dan Khasis", "text": "Он делает...", "confidence": 0.95}
{"start": 1478.21, "end": 1483.86, "speaker": "Dan Khasis", "text": "Это флаг, чтобы не иметь...", "confidence": 0.95}
{"start": 1483.86, "end": 1489.5, "speaker": "Dan Khasis", "text": "Чтобы не иметь...", "confidence": 0.95}
{"start": 1489.5, "end": 1495.14, "speaker": "Dan Khasis", "text": "Чтобы ты мог иметь тот же relationship с теми же объектами или с немножко модифицированными объектами, но на другие сроки.", "confidence": 0.95}
{"start": 1495.14, "end": 1500.79, "speaker": "Dan Khasis", "text": "И вот эта линковка ассет-группы, она...", "confidence": 0.95}
{"start": 1500.79, "end": 1506.43, "speaker": "Dan Khasis", "text": "IsCurrent – это флаг, где ты самый свежий ряд.", "confidence": 0.95}
{"start": 1506.43, "end": 1512.07, "speaker": "Dan Khasis", "text": "Подчеркиваю, что IsCurrent...", "confidence": 0.95}
{"start": 1512.07, "end": 1517.71, "speaker": "Dan Khasis", "text": "Ну, одновременно сохраняются исторические ряда для выводить их на фронт-энд в снэпшоте, что если ты открыл, например, ассет-группу, ты увидишь историю всех содержаний той группы по этим временным окнам.", "confidence": 0.95}
{"start": 1517.71, "end": 1523.36, "speaker": "Dan Khasis", "text": "Я покажу, как scope это реализовал.", "confidence": 0.95}
{"start": 1523.36, "end": 1529.0, "speaker": "Dan Khasis", "text": "У них это очень сразу понятно и очевидно.", "confidence": 0.95}
{"start": 1530, "end": 1571, "speaker": "Igor Skrynkovskyy", "text": "Дэн, а ты думаешь, что стоит вот этот IsCurrent вводить в ключ? Потому что если так, то у нас получится только 2 вероятности вот этого значения. То есть я почему-то думал, что это как SCDC, вот этот формат для хранения всех предыдущих версий.\n\nА IsCurrent просто говорит о том, что это активная версия. И все остальные мы будем хранить. А если мы сделаем индекс по нему, то у нас будет только 2, которые мы будем хранить.\n\nНу, типа активное и неактивное значение.", "confidence": 0.99}
{"start": 1578, "end": 1591, "speaker": "Dan Khasis", "text": "Я понимаю, что ты говоришь. Да, я подумал немножко. Просто IsCurrent должно защищать нас, чтобы никогда не было больше, чем 1 IsCurrent.", "confidence": 0.7}
{"start": 1599, "end": 1604, "speaker": "Igor Skrynkovskyy", "text": "А почему ты не хочешь сделать другую таблицу для переноса?", "confidence": 0.99}
{"start": 1604, "end": 1606.67, "speaker": "Dan Khasis", "text": "Это слишком много будет возникнуть.", "confidence": 0.95}
{"start": 1606.67, "end": 1609.33, "speaker": "Dan Khasis", "text": "Слишком много.", "confidence": 0.95}
{"start": 1609.33, "end": 1612.0, "speaker": "Dan Khasis", "text": "Это в 2 раза увеличит или в 3 трудоемкость и базы.", "confidence": 0.95}
{"start": 1613, "end": 1622, "speaker": "Igor Skrynkovskyy", "text": "А не будет проблема с, например, индексами внутри, индексами поиска внутри вот этой таблицы, если она будет расти?", "confidence": 0.99}
{"start": 1623, "end": 1627, "speaker": "Dan Khasis", "text": "Нет, не будет.", "confidence": 0.99}
{"start": 1629, "end": 1630, "speaker": "Dan Khasis", "text": "Окей, ну хорошо.", "confidence": 0.99}
{"start": 1630, "end": 1643, "speaker": "Dan Khasis", "text": "Я тебе скажу, почему не будет. Потому что это NullFilteredIndex. Мы имеем право писать null.\n\nИ это nullable поле. То есть мы не обязаны его заполнять.", "confidence": 0.99}
{"start": 1645, "end": 1654, "speaker": "Igor Skrynkovskyy", "text": "То есть мы просто будем хранить где-то в галку о том, что значение активировано, а все остальное нам нужно будет сбрасывать.", "confidence": 0.99}
{"start": 1655, "end": 1661.0, "speaker": "Dan Khasis", "text": "Этот параметр хитрый NullFiltered, он уникальный ключ не будет ранить, когда там null.", "confidence": 0.95}
{"start": 1661.0, "end": 1667.0, "speaker": "Dan Khasis", "text": "То есть когда ты архивируешь, она становится не false, а null.", "confidence": 0.95}
{"start": 1667.0, "end": 1673.0, "speaker": "Dan Khasis", "text": "И тогда она не входит в unique enforcement.", "confidence": 0.95}
{"start": 1674, "end": 1688, "speaker": "Dan Khasis", "text": "Да, я понимаю, как NullFiltered работает. Я просто о том, что нам нужно будет постоянно включать и выключать предыдущее состояние или все предыдущие состояния, которые не текущие. То есть принудительно.", "confidence": 0.36}
{"start": 1688, "end": 1693.0, "speaker": "Dan Khasis", "text": "Ну, когда они будут что-то модифицировать и менять, тогда да.", "confidence": 0.95}
{"start": 1693.0, "end": 1698.0, "speaker": "Dan Khasis", "text": "Но не просто так, мы же не будем это делать просто так.", "confidence": 0.95}
{"start": 1698, "end": 1722, "speaker": "Igor Skrynkovskyy", "text": "Дэн, о модификации мы говорим о всех полях. То есть если даже у нас изменился EffectiveStartDate, StartDate, EndDate.id, это понятно. А что у нас еще может поменяться в этом случае?\n\nУ нас больше ничего не меняется. То есть каждый раз, когда меняются вот эти поля, мы меняем из current, создаем новый рекорд и записываем из current.", "confidence": 0.99}
{"start": 1723, "end": 1744, "speaker": "Dan Khasis", "text": "Да, потому что если удаляется asset из группы, тогда меняется. Я не хочу переусложнять, в принципе, надо делать еще один wrapper на все asset и в той группе, и на тот момент. И тогда надо их сбрасывать все одновременно.", "confidence": 0.93}
{"start": 1751, "end": 1754, "speaker": "Igor Skrynkovskyy", "text": "Да-да-да, именно.", "confidence": 0.39}
{"start": 1758, "end": 1765.5, "speaker": "Dan Khasis", "text": "Ну хорошо, я с этим понял.", "confidence": 0.95}
{"start": 1765.5, "end": 1773.0, "speaker": "Dan Khasis", "text": "Легко это сделать.", "confidence": 0.95}
{"start": 1773.0, "end": 1780.5, "speaker": "Dan Khasis", "text": "Если мы хотим сделать еще один этап, что есть группа, в группе есть как бы идентификатор линковок на тот момент, и потом если любая из этих вещей меняется, тогда вся группа становится негодной и надо делать новую.", "confidence": 0.95}
{"start": 1780.5, "end": 1788.0, "speaker": "Dan Khasis", "text": "И в новой опять снова начинается это все.", "confidence": 0.95}
{"start": 1788.0, "end": 1795.5, "speaker": "Dan Khasis", "text": "И вот эти все атрибуты привязаны на уровне группы, а не на уровне индивидуальных этих ассетов.", "confidence": 0.95}
{"start": 1795.5, "end": 1803.0, "speaker": "Dan Khasis", "text": "Я пытаюсь делать баланс между суперсложной базой и суперсложной middleware.", "confidence": 0.95}
{"start": 1807, "end": 1817, "speaker": "Igor Skrynkovskyy", "text": "Смотри, а мы вот этот asset group relationship id, мы его же нигде не будем использовать, правильно? Это просто внутреннее id для работы.", "confidence": 0.99}
{"start": 1817, "end": 1851, "speaker": "Dan Khasis", "text": "В принципе, для выводения в снэпшоте надо будет иногда проваливаться на какую-то группу по истории, если смотреть на исторические таймлайны. И тогда, в принципе, если мы будем выставлять счет, тогда тот выставленный счет может быть линковаться на таймлайн, который существовал на тот момент всех ассетов и их линковки группы. И, может быть, надо будет сделать референс на этот первичный ключ, но это больше технически, чем для юзера.", "confidence": 0.99}
{"start": 1857, "end": 1859.0, "speaker": "Igor Skrynkovskyy", "text": "Окей.", "confidence": 0.95}
{"start": 1861.0, "end": 1863.0, "speaker": "Igor Skrynkovskyy", "text": "Сергей, привет.", "confidence": 0.95}
{"start": 1863.0, "end": 1865.0, "speaker": "Dan Khasis", "text": "А, я видел.", "confidence": 0.95}
{"start": 1866, "end": 1866, "speaker": "Serhii Kasainov", "text": "Привет.", "confidence": 0.69}
{"start": 1876, "end": 1893, "speaker": "Igor Skrynkovskyy", "text": "Сергей, Дэн показывает базу для ассетов, которую он создал. И с точки зрения UI он попросил пригласить, чтобы ты тоже понимал, каким образом нужно будет строить представление этого всего на UI.", "confidence": 0.99}
{"start": 1896, "end": 1903, "speaker": "Serhii Kasainov", "text": "Я внимательно слушаю. Вспоминаю свои молодые годы, когда первый интернет-магазин проектировал.", "confidence": 0.99}
{"start": 1915, "end": 1919, "speaker": "Igor Skrynkovskyy", "text": "Так ты, может, создаешь просто несколько раз тот же самый индекс?", "confidence": 0.93}
{"start": 1930, "end": 1932, "speaker": "Dan Khasis", "text": "А, может быть, они...", "confidence": 0.47}
{"start": 1932, "end": 1938, "speaker": "Igor Skrynkovskyy", "text": "А, название таблицы, а не индекс, раут.", "confidence": 0.99}
{"start": 1940, "end": 1951, "speaker": "Dan Khasis", "text": "Она, может быть, не дропнула таблицу. Сейчас, секунду. Она не дропнула таблицу, и вот почему она еще старше была.", "confidence": 0.71}
{"start": 1951, "end": 1955, "speaker": "Igor Skrynkovskyy", "text": "Потому что индекс надо дропать перед...", "confidence": 0.95}
{"start": 1955, "end": 1957.6, "speaker": "Dan Khasis", "text": "Я сделал, я знаю, посмотри.", "confidence": 0.95}
{"start": 1957.6, "end": 1960.2, "speaker": "Dan Khasis", "text": "Посмотри.", "confidence": 0.95}
{"start": 1960.2, "end": 1962.8, "speaker": "Dan Khasis", "text": "Она просто еще не закончила.", "confidence": 0.95}
{"start": 1962.8, "end": 1965.4, "speaker": "Dan Khasis", "text": "Execution тот-то сейчас будет.", "confidence": 0.95}
{"start": 1965.4, "end": 1968.0, "speaker": "Dan Khasis", "text": "Сейчас будет.", "confidence": 0.95}
{"start": 1983, "end": 1993, "speaker": "Serhii Kasainov", "text": "Знаете, что было бы очень полезно, если это у вас все лежит вот в таких миграциях? Дать это все ЛЛМке, чтобы она нарисовала схему визуальной связи между сущностями.", "confidence": 0.99}
{"start": 1993, "end": 1994, "speaker": "Serhii Kasainov", "text": "Такой наглый есть.", "confidence": 0.85}
{"start": 1996, "end": 1997, "speaker": "Dan Khasis", "text": "Да, видишь, смотри.", "confidence": 0.99}
{"start": 2003, "end": 2011, "speaker": "Serhii Kasainov", "text": "Но это то, что ты сейчас делаешь. А вот я бы прям по всем сущностям, что есть в нашей системе. Вот пришел кто-нибудь...", "confidence": 0.99}
{"start": 2011, "end": 2014, "speaker": "Igor Skrynkovskyy", "text": "У тебя будет там 10 тысяч таблиц.", "confidence": 1.0}
{"start": 2016, "end": 2024, "speaker": "Igor Skrynkovskyy", "text": "Сергей, мы уже это обсуждали. Вопрос того, а зачем кому-то знать всю структуру всего? Как зависит?", "confidence": 0.99}
{"start": 2025, "end": 2034, "speaker": "Serhii Kasainov", "text": "Ну, не так всю структуру всего. Технические таблицы нет. Но именно основные сущности.\n\nЧтобы новичок придет какой-нибудь, мы ему просто даем эту схему.", "confidence": 0.99}
{"start": 2034, "end": 2037.5, "speaker": "Dan Khasis", "text": "Мы делаем это, но не так, как ты говоришь.", "confidence": 0.95}
{"start": 2037.5, "end": 2041.0, "speaker": "Dan Khasis", "text": "Сейчас, секунду.", "confidence": 0.95}
{"start": 2041.0, "end": 2044.5, "speaker": "Dan Khasis", "text": "Алекс Яско должен был скопировать, как сделала...", "confidence": 0.95}
{"start": 2048.0, "end": 2051.5, "speaker": "Dan Khasis", "text": "Salesforce, где у нас был список...", "confidence": 0.95}
{"start": 2051.5, "end": 2055.0, "speaker": "Dan Khasis", "text": "У нас был список...", "confidence": 0.95}
{"start": 2060, "end": 2069, "speaker": "Dan Khasis", "text": "Как его звать? Сейчас, секунду.", "confidence": 0.24}
{"start": 2080, "end": 2087, "speaker": "Dan Khasis", "text": "Опять крашился этот дебильный... Первый раз, очень странно. Как это звать?", "confidence": 0.99}
{"start": 2088, "end": 2092, "speaker": "Dan Khasis", "text": "Опять крашился DataGrip. Сейчас.", "confidence": 0.99}
{"start": 2095, "end": 2098.67, "speaker": "Igor Skrynkovskyy", "text": "Я очень не люблю эти интеллигентные продукты.", "confidence": 0.95}
{"start": 2098.67, "end": 2102.33, "speaker": "Igor Skrynkovskyy", "text": "Кроме двух, наверное.", "confidence": 0.95}
{"start": 2102.33, "end": 2106.0, "speaker": "Igor Skrynkovskyy", "text": "А все остальное, это очень переусложненное...", "confidence": 0.95}
{"start": 2106, "end": 2109.8, "speaker": "Dan Khasis", "text": "Я думаю, что там дефект есть с этим.", "confidence": 0.95}
{"start": 2109.8, "end": 2113.6, "speaker": "Dan Khasis", "text": "С SpannerDriver.", "confidence": 0.95}
{"start": 2113.6, "end": 2117.4, "speaker": "Dan Khasis", "text": "Потому что она бомбит SpannerDriver.", "confidence": 0.95}
{"start": 2117.4, "end": 2121.2, "speaker": "Dan Khasis", "text": "Каждые 30 секунд рефрешит схему.", "confidence": 0.95}
{"start": 2121.2, "end": 2125.0, "speaker": "Dan Khasis", "text": "Окей.", "confidence": 0.95}
{"start": 2125.0, "end": 2128.8, "speaker": "Dan Khasis", "text": "Assets and Groups.", "confidence": 0.95}
{"start": 2128.8, "end": 2132.6, "speaker": "Dan Khasis", "text": "Короче, она их пересоздала.", "confidence": 0.95}
{"start": 2132.6, "end": 2136.4, "speaker": "Dan Khasis", "text": "И теперь у нас есть новые колонки, новые ключи.", "confidence": 0.95}
{"start": 2136.4, "end": 2140.2, "speaker": "Dan Khasis", "text": "Здесь, кстати, опять проблема.", "confidence": 0.95}
{"start": 2140.2, "end": 2144.0, "speaker": "Dan Khasis", "text": "Я должен буду включить...", "confidence": 0.95}
{"start": 2144.0, "end": 2147.8, "speaker": "Dan Khasis", "text": "Сейчас, секунду.", "confidence": 0.95}
{"start": 2147.8, "end": 2151.6, "speaker": "Dan Khasis", "text": "Надо включить на Asset Master.", "confidence": 0.95}
{"start": 2151.6, "end": 2155.4, "speaker": "Dan Khasis", "text": "В некоторых таблицах.", "confidence": 0.95}
{"start": 2155.4, "end": 2159.2, "speaker": "Dan Khasis", "text": "Просто поспешил.", "confidence": 0.95}
{"start": 2159.2, "end": 2163.0, "speaker": "Dan Khasis", "text": "Например, сюда.", "confidence": 0.95}
{"start": 2167, "end": 2169, "speaker": "Dan Khasis", "text": "Здесь есть уже, кстати.", "confidence": 0.99}
{"start": 2177, "end": 2180.67, "speaker": "Dan Khasis", "text": "Окей, короче.", "confidence": 0.95}
{"start": 2180.67, "end": 2184.33, "speaker": "Dan Khasis", "text": "Мы покрыли, что у нас есть Assets, у нас есть Attributes.", "confidence": 0.95}
{"start": 2184.33, "end": 2188.0, "speaker": "Dan Khasis", "text": "Атрибуты имеют группы.", "confidence": 0.95}
{"start": 2188.0, "end": 2191.67, "speaker": "Dan Khasis", "text": "Сами Assets имеют типы.", "confidence": 0.95}
{"start": 2191.67, "end": 2195.33, "speaker": "Dan Khasis", "text": "Типы имеют группы.", "confidence": 0.95}
{"start": 2195.33, "end": 2199.0, "speaker": "Dan Khasis", "text": "Потом есть следующий пункт.", "confidence": 0.95}
{"start": 2199.0, "end": 2202.67, "speaker": "Dan Khasis", "text": "Последний, Игорь.", "confidence": 0.95}
{"start": 2202.67, "end": 2206.33, "speaker": "Dan Khasis", "text": "Самый последний.", "confidence": 0.95}
{"start": 2206.33, "end": 2210.0, "speaker": "Dan Khasis", "text": "Что у Assets могут быть alias.", "confidence": 0.95}
{"start": 2210.0, "end": 2213.67, "speaker": "Dan Khasis", "text": "Потому что одной мусорной бакой может быть, например, чип и barcode.", "confidence": 0.95}
{"start": 2213.67, "end": 2217.33, "speaker": "Dan Khasis", "text": "Например.", "confidence": 0.95}
{"start": 2217.33, "end": 2221.0, "speaker": "Dan Khasis", "text": "Сюда у нас вписываются типы вариантов, которые пролинкованы к этому Asset.", "confidence": 0.95}
{"start": 2222, "end": 2224, "speaker": "Igor Skrynkovskyy", "text": "Это так же, как в ERP.", "confidence": 0.67}
{"start": 2225, "end": 2238, "speaker": "Dan Khasis", "text": "Да, у нас есть тип. Вот этот тип. Надо, кстати, сделать инициализацию.\n\nСейчас, секунду. Я найду мой справочник.", "confidence": 0.63}
{"start": 2241, "end": 2246, "speaker": "Igor Skrynkovskyy", "text": "Но этот справочник, наверное, нужно бы и дать пользователю заполнять.", "confidence": 0.78}
{"start": 2247, "end": 2248.29, "speaker": "Dan Khasis", "text": "Нет, я не хочу.", "confidence": 0.95}
{"start": 2248.29, "end": 2249.57, "speaker": "Dan Khasis", "text": "Пусть они...", "confidence": 0.95}
{"start": 2249.57, "end": 2250.86, "speaker": "Dan Khasis", "text": "Не хочешь?", "confidence": 0.95}
{"start": 2250.86, "end": 2252.14, "speaker": "Dan Khasis", "text": "Давай мы им сделаем.", "confidence": 0.95}
{"start": 2252.14, "end": 2253.43, "speaker": "Dan Khasis", "text": "Мы покроем все варианты.", "confidence": 0.95}
{"start": 2253.43, "end": 2254.71, "speaker": "Dan Khasis", "text": "У меня это было.", "confidence": 0.95}
{"start": 2254.71, "end": 2256.0, "speaker": "Dan Khasis", "text": "Одну секунду.", "confidence": 0.95}
{"start": 2259, "end": 2263, "speaker": "Igor Skrynkovskyy", "text": "Я к тому, что просто это несложно, чтобы добавить просто Root Member ID в схему.", "confidence": 0.99}
{"start": 2263, "end": 2264, "speaker": "Dan Khasis", "text": "Да, да.", "confidence": 0.99}
{"start": 2267, "end": 2268, "speaker": "Igor Skrynkovskyy", "text": "На будущее.", "confidence": 0.99}
{"start": 2293, "end": 2298, "speaker": "Igor Skrynkovskyy", "text": "Дэн, еще вопрос. Давай. Окей.", "confidence": 0.91}
{"start": 2325, "end": 2328, "speaker": "Dan Khasis", "text": "Сейчас оно ранает.", "confidence": 0.99}
{"start": 2365, "end": 2370.75, "speaker": "Igor Skrynkovskyy", "text": "Дэн, смотри, пока оно ранает.", "confidence": 0.95}
{"start": 2370.75, "end": 2376.5, "speaker": "Igor Skrynkovskyy", "text": "Вопрос такой.", "confidence": 0.95}
{"start": 2376.5, "end": 2382.25, "speaker": "Igor Skrynkovskyy", "text": "Смотри, а где происходит атрибуция GeoCode от этого геопозиционирования?", "confidence": 0.95}
{"start": 2382.25, "end": 2388.0, "speaker": "Igor Skrynkovskyy", "text": "Или атрибутирование, где находится его склад, а где находится последний его Location в этой схеме?", "confidence": 0.95}
{"start": 2388, "end": 2392.0, "speaker": "Dan Khasis", "text": "Да, мы с тобой об этом сегодня утром говорили.", "confidence": 0.95}
{"start": 2392.0, "end": 2396.0, "speaker": "Dan Khasis", "text": "Надо решить, действительно мы хотим Spanner сохранять или нет.", "confidence": 0.95}
{"start": 2396.0, "end": 2400.0, "speaker": "Dan Khasis", "text": "Кстати, перед тем, как я забуду, еще один пункт.", "confidence": 0.95}
{"start": 2400.0, "end": 2404.0, "speaker": "Dan Khasis", "text": "Посмотри на...", "confidence": 0.95}
{"start": 2404.0, "end": 2408.0, "speaker": "Dan Khasis", "text": "Здесь есть у атрибута, я еще заложил типификацию, чтобы мы, когда расшифровывали, мы кастинг могли делать.", "confidence": 0.95}
{"start": 2408.0, "end": 2412.0, "speaker": "Dan Khasis", "text": "Атрибут тип Data.", "confidence": 0.95}
{"start": 2412.0, "end": 2416.0, "speaker": "Dan Khasis", "text": "Окей?", "confidence": 0.95}
{"start": 2416.0, "end": 2420.0, "speaker": "Dan Khasis", "text": "Понимаешь?", "confidence": 0.95}
{"start": 2420.0, "end": 2424.0, "speaker": "Dan Khasis", "text": "Да.", "confidence": 0.95}
{"start": 2424.0, "end": 2428.0, "speaker": "Dan Khasis", "text": "И потом другая вещь.", "confidence": 0.95}
{"start": 2428.0, "end": 2432.0, "speaker": "Dan Khasis", "text": "Я тоже забыл, важно.", "confidence": 0.95}
{"start": 2438, "end": 2461, "speaker": "Dan Khasis", "text": "Что это там было? Одну секунду. Опять взорвалось JetBrains.", "confidence": 0.22}
{"start": 2467, "end": 2471, "speaker": "Igor Skrynkovskyy", "text": "Потом Google выставит счета за эти изменения.", "confidence": 0.99}
{"start": 2488, "end": 2505, "speaker": "Dan Khasis", "text": "Окей, она сейчас генерирует варианты. Сейчас, секунду, я открою. Снова DataGrid.\n\nСтранно, я сидел неделями, там ни разу не крешнулось. А сейчас я включил, и она крешит бесконечно.", "confidence": 0.99}
{"start": 2506, "end": 2509, "speaker": "Igor Skrynkovskyy", "text": "Может, она как-то на Zoom еще реагирует?", "confidence": 0.99}
{"start": 2509, "end": 2518.0, "speaker": "Dan Khasis", "text": "Я думаю, потому что я открыл две колонки.", "confidence": 0.95}
{"start": 2527.0, "end": 2536.0, "speaker": "Dan Khasis", "text": "Она генерирует сейчас интересный список.", "confidence": 0.95}
{"start": 2536.0, "end": 2545.0, "speaker": "Dan Khasis", "text": "Помнишь этот AssetGroups?", "confidence": 0.95}
{"start": 2545.0, "end": 2554.0, "speaker": "Dan Khasis", "text": "Мы хотели сделать еще одну вещь, но я не помню, что там было.", "confidence": 0.95}
{"start": 2575, "end": 2575, "speaker": "Dan Khasis", "text": "Секунду.", "confidence": 0.65}
{"start": 2578, "end": 2589, "speaker": "Dan Khasis", "text": "Окей, смотри, она сгенерировала. Идентификатор на уровне рута. Win, правильно, LicensePlate, правильно.", "confidence": 0.7}
{"start": 2598, "end": 2611, "speaker": "Igor Skrynkovskyy", "text": "А не будет проблема то, что мы будем LicensePlate, там SlashTag использовать для атрибуции и для алиасов? Или это допустимо в этой точке зрения?", "confidence": 0.98}
{"start": 2623, "end": 2643, "speaker": "Dan Khasis", "text": "LicensePlate это... А что если ты хочешь вставить все исторические LicensePlates? В принципе, ты можешь.\n\nЯ понимаю, что ты говоришь, но это больше, я думаю, для гибкости. Но я согласен с тобой.", "confidence": 0.71}
{"start": 2645, "end": 2649, "speaker": "Igor Skrynkovskyy", "text": "Нет, с историческими данными это, кстати, вопрос хороший.", "confidence": 0.99}
{"start": 2651, "end": 2657, "speaker": "Igor Skrynkovskyy", "text": "Это же алиасы, то есть к нему, у меня на машине могут быть 3 LicensePlates.", "confidence": 0.22}
{"start": 2658, "end": 2658, "speaker": "Igor Skrynkovskyy", "text": "Угу, угу.", "confidence": 0.65}
{"start": 2666, "end": 2668, "speaker": "Igor Skrynkovskyy", "text": "Нет, без проблем, круто, давай оставим.", "confidence": 0.99}
{"start": 2672, "end": 2680, "speaker": "Igor Skrynkovskyy", "text": "Там, кстати, вот тут вопрос. Видишь, оно здесь запихнуло этот hex.", "confidence": 0.99}
{"start": 2680, "end": 2682.0, "speaker": "Dan Khasis", "text": "Да, но это неправильно.", "confidence": 0.95}
{"start": 2682.0, "end": 2684.0, "speaker": "Dan Khasis", "text": "Неправильно.", "confidence": 0.95}
{"start": 2686, "end": 2690, "speaker": "Dan Khasis", "text": "А почему? Потому что... Нет, нет, нет.\n\nСмотри, у нас RootMember...", "confidence": 0.99}
{"start": 2690, "end": 2694, "speaker": "Dan Khasis", "text": "Это может любой сделать, вот почему это...", "confidence": 0.99}
{"start": 2697, "end": 2733, "speaker": "Igor Skrynkovskyy", "text": "То есть мы должны это оставить в таком виде. То есть по байтам оно не будет забивать, но у нас будет RootMemberId, который будет создаваться. Ну это правильно.\n\nА, у меня еще один вопрос, Дэн, насчет этого. Смотри, у тебя везде в схемах написано RootMemberId, что он NotNull, а по умолчанию он 0. А какое преимущество использовать вот такой подход вместо 0?", "confidence": 0.92}
{"start": 2734, "end": 2761, "speaker": "Dan Khasis", "text": "Если он всегда... У меня он 0, а потому что я говорю, что нельзя никогда ничего вставлять, что будет null. Всегда нужно иметь цифру, а 0 я пишу, потому что это root, это все дефолт значения на уровне всей системы, когда он 0.\n\nТо есть если кто-то сам ничего не вставляет, это всегда 0, и защищено, это все наше. А когда они начнут вставлять, у них будет...", "confidence": 0.98}
{"start": 2762, "end": 2767.67, "speaker": "Igor Skrynkovskyy", "text": "Это понятно.", "confidence": 0.95}
{"start": 2767.67, "end": 2773.33, "speaker": "Igor Skrynkovskyy", "text": "Смотри, просто преимущество насчет того, чтобы использовать 0 и использовать 0.", "confidence": 0.95}
{"start": 2773.33, "end": 2779.0, "speaker": "Igor Skrynkovskyy", "text": "Ты просто хочешь всегда цифру использовать, номерик всегда использовать, и не использовать 0.", "confidence": 0.95}
{"start": 2779, "end": 2782, "speaker": "Dan Khasis", "text": "Да, нам всегда нужна цифра.", "confidence": 0.88}
{"start": 2785, "end": 2789, "speaker": "Igor Skrynkovskyy", "text": "А не проще использовать 0, например, в таком случае?", "confidence": 0.99}
{"start": 2790, "end": 2838, "speaker": "Dan Khasis", "text": "Я не знаю, это сложный вопрос, как это влияет на проверки качества, я не знаю. Я смотрю больше всегда на strongly typecast. То есть если я ожидаю integer, я ожидаю integer и в Swagger, и в SQL, и в Middleware, и в JavaScript, и в Frontend.\n\nА если null, и кто-то что-то не сделал, тогда это уже не integer. Я не говорю, что я прав, я просто говорю, как дело вкуса, с моей точки зрения. Окей, так что, вставляем, посмотрим, что будет.", "confidence": 0.8}
{"start": 2839, "end": 2853, "speaker": "Igor Skrynkovskyy", "text": "Ну, давай. Ну, оно выглядит хорошо. Что будет?\n\nПросто данные должны добавиться. Что-то ему не нравится.", "confidence": 0.66}
{"start": 2859, "end": 2937, "speaker": "Dan Khasis", "text": "Таблица нет. Таблица нет, да. Я не поставил схему, я схему забыл поставить.\n\nОна там есть теперь. Да, я вспомнил, что я хотел. Геодетические атрибуты, нам нужно вернуть таблицу, которая линкует.\n\nНам нужно сделать таблицу, которая линкует assets to entities. Потому что у тебя же есть, например, facility, business unit, line of business. Чтобы мы не hard-coded просто facility, а одним махом покрыли все варианты.\n\nПонимаешь, о чем я веду?", "confidence": 0.45}
{"start": 2939, "end": 2943.0, "speaker": "Igor Skrynkovskyy", "text": "Да, да.", "confidence": 0.95}
{"start": 2943.0, "end": 2947.0, "speaker": "Igor Skrynkovskyy", "text": "Ты хочешь просто ассеты иметь возможность соединять с любым типом объектом, который мы предоставляем.", "confidence": 0.95}
{"start": 2947.0, "end": 2951.0, "speaker": "Igor Skrynkovskyy", "text": "Дэн, а мы не должны...", "confidence": 0.95}
{"start": 2951.0, "end": 2955.0, "speaker": "Igor Skrynkovskyy", "text": "хотя нет.", "confidence": 0.95}
{"start": 2955.0, "end": 2959.0, "speaker": "Igor Skrynkovskyy", "text": "Слушай, а группы, мы не должны соединять группы ассетов или иметь возможность соединять группы ассетов?", "confidence": 0.95}
{"start": 2963.0, "end": 2967.0, "speaker": "Dan Khasis", "text": "Не, группу...", "confidence": 0.95}
{"start": 2967.0, "end": 2971.0, "speaker": "Igor Skrynkovskyy", "text": "Иерархическое, вот это другой вопрос.", "confidence": 0.95}
{"start": 2971.0, "end": 2975.0, "speaker": "Igor Skrynkovskyy", "text": "Вопрос вот здесь, например.", "confidence": 0.95}
{"start": 2976, "end": 2978, "speaker": "Dan Khasis", "text": "Группу на facility?", "confidence": 0.99}
{"start": 2980, "end": 2990, "speaker": "Igor Skrynkovskyy", "text": "Например, группу на facility, да. Или там группу на vehicle, или группу на, не знаю, customer location. Это ж, ну, возможно такое, правильно?", "confidence": 0.99}
{"start": 2990, "end": 2992.25, "speaker": "Dan Khasis", "text": "Да, совершенно верно.", "confidence": 0.95}
{"start": 2992.25, "end": 2994.5, "speaker": "Dan Khasis", "text": "Эта таблица должна линковать этот ассет к любой типу, включая группы.", "confidence": 0.95}
{"start": 2994.5, "end": 2996.75, "speaker": "Dan Khasis", "text": "Так что у нас не хватает?", "confidence": 0.95}
{"start": 2996.75, "end": 2999.0, "speaker": "Dan Khasis", "text": "У нас есть...", "confidence": 0.95}
{"start": 3000, "end": 3001.5, "speaker": "Igor Skrynkovskyy", "text": "Не ассеты.", "confidence": 0.95}
{"start": 3001.5, "end": 3003.0, "speaker": "Igor Skrynkovskyy", "text": "Ассеты у нас есть.", "confidence": 0.95}
{"start": 3005, "end": 3049, "speaker": "Dan Khasis", "text": "Entity у нас есть, тип ассета у нас есть. Так теперь она же может говорить, что такой-то ассет линкуется к facility. К типу является, например, facility.\n\nЭто же покроет все сценарии, нет?", "confidence": 0.32}
{"start": 3050, "end": 3051, "speaker": "Dan Khasis", "text": "А, группа, группа.", "confidence": 0.99}
{"start": 3052, "end": 3060, "speaker": "Dan Khasis", "text": "Ну, то есть мы же можем создать... Так группа E будет, entity type ID будет группа, а entity ID будет группа ID.", "confidence": 0.99}
{"start": 3069, "end": 3077, "speaker": "Igor Skrynkovskyy", "text": "А зачем нам тогда таблица, которая называется asset in groups в таком случае?", "confidence": 0.99}
{"start": 3081, "end": 3108, "speaker": "Dan Khasis", "text": "Потому что assets in groups описывает все вещи... Окей, вот потому что есть машина, там есть разные датчики, их 10 штук, они все привязаны к asset группе. А теперь эту asset группу уже надо прорисовать к facility.\n\nЭто отличается, чем линковать сенсоры к facility, и отличается... Все равно надо линковать facility на asset группу.", "confidence": 0.99}
{"start": 3111, "end": 3117.2, "speaker": "Igor Skrynkovskyy", "text": "Нет, так я...", "confidence": 0.95}
{"start": 3117.2, "end": 3123.4, "speaker": "Igor Skrynkovskyy", "text": "Смотри, я как раз это имел в виду, что вот эта asset группа, которую мы создали, вот этот in groups, assets in groups, то есть группа, она имеет там свой набор вот этих датчиков.", "confidence": 0.95}
{"start": 3123.4, "end": 3129.6, "speaker": "Igor Skrynkovskyy", "text": "А как нам вот этот набор, весь набор датчиков привязать к facility?", "confidence": 0.95}
{"start": 3129.6, "end": 3135.8, "speaker": "Igor Skrynkovskyy", "text": "Просто ассетом не подойдет.", "confidence": 0.95}
{"start": 3135.8, "end": 3142.0, "speaker": "Igor Skrynkovskyy", "text": "Мы же имеем, получается, у нас есть возможность с ассетом связать.", "confidence": 0.95}
{"start": 3142.0, "end": 3148.2, "speaker": "Igor Skrynkovskyy", "text": "Извини, с мастер ассетом, и у нас есть возможность с этим, с этой сущностью.", "confidence": 0.95}
{"start": 3148.2, "end": 3154.4, "speaker": "Igor Skrynkovskyy", "text": "Значит, нам нужно полиморфик делать в 2 вида, то есть и для ассетов.", "confidence": 0.95}
{"start": 3154.4, "end": 3160.6, "speaker": "Igor Skrynkovskyy", "text": "Ты хочешь так сделать?", "confidence": 0.95}
{"start": 3160.6, "end": 3166.8, "speaker": "Igor Skrynkovskyy", "text": "Да, да, да, я об этом имею в виду, да.", "confidence": 0.95}
{"start": 3166.8, "end": 3173.0, "speaker": "Igor Skrynkovskyy", "text": "В таком случае мы можем и ассеты соединять, и группы ассетов, и там вот эти assets in groups.", "confidence": 0.95}
{"start": 3173.0, "end": 3179.2, "speaker": "Igor Skrynkovskyy", "text": "Ну и я не знаю, потом когда, если у нас вдруг появятся какие-то логические еще там, не знаю, разделения, группы или что-то другое, то у нас будет еще один вариант.", "confidence": 0.95}
{"start": 3179.2, "end": 3185.4, "speaker": "Igor Skrynkovskyy", "text": "Ну и будет возможность типа добавить еще что-то.", "confidence": 0.95}
{"start": 3185.4, "end": 3191.6, "speaker": "Igor Skrynkovskyy", "text": "Больше, больше возможностей.", "confidence": 0.95}
{"start": 3191.6, "end": 3197.8, "speaker": "Igor Skrynkovskyy", "text": "Только здесь нам нужен еще typeid, там где linked object id, нам нужен еще linked typeid.", "confidence": 0.95}
{"start": 3197.8, "end": 3204.0, "speaker": "Igor Skrynkovskyy", "text": "А, да, да, да, да, да.", "confidence": 0.95}
{"start": 3205, "end": 3207, "speaker": "Dan Khasis", "text": "Тип, ой, это int, не?", "confidence": 0.9}
{"start": 3210, "end": 3227, "speaker": "Igor Skrynkovskyy", "text": "Ну можем там int сделать, да. Ну тут, в принципе, там где entity typeid, там тоже int может быть, потому что их тоже немного будет. Хотя, блин, этот int64 использовать для 10 значений, мы bit используем.", "confidence": 0.99}
{"start": 3227, "end": 3229, "speaker": "Dan Khasis", "text": "А такой у них нет у других?", "confidence": 0.85}
{"start": 3229, "end": 3234, "speaker": "Igor Skrynkovskyy", "text": "Ой, не bit, byte, мы byte используем один для таких случаев.", "confidence": 0.99}
{"start": 3238, "end": 3238, "speaker": "Igor Skrynkovskyy", "text": "Ну пусть будет.", "confidence": 0.65}
{"start": 3250, "end": 3251, "speaker": "Igor Skrynkovskyy", "text": "Сейчас, секунду.", "confidence": 0.72}
{"start": 3263, "end": 3268.33, "speaker": "Dan Khasis", "text": "Да, ну здесь constraint нам не подойдет.", "confidence": 0.95}
{"start": 3268.33, "end": 3273.67, "speaker": "Igor Skrynkovskyy", "text": "А что ты хочешь constraint?", "confidence": 0.95}
{"start": 3273.67, "end": 3279.0, "speaker": "Dan Khasis", "text": "Я забыл прибавить constraint на...", "confidence": 0.95}
{"start": 3284, "end": 3287, "speaker": "Igor Skrynkovskyy", "text": "Чтобы принадлежность к ассетам была, я понял.", "confidence": 0.71}
{"start": 3295, "end": 3300, "speaker": "Dan Khasis", "text": "Я бы работал 5 раз быстрее, если я не должен был дропать эти сраные индексы постоянно.", "confidence": 0.99}
{"start": 3302, "end": 3307, "speaker": "Igor Skrynkovskyy", "text": "Так, а зачем ты их создаешь? Сраные индексы постоянно.", "confidence": 0.99}
{"start": 3307, "end": 3319.5, "speaker": "Dan Khasis", "text": "А как иначе, foreign key подсказывает и BigQuery execution, и Spanner execution, и Data Protection, и LLM, и он подсказывает все relationships, как описывал Сергей.", "confidence": 0.95}
{"start": 3319.5, "end": 3332.0, "speaker": "Dan Khasis", "text": "Сейчас мне любопытно сдропнуть этот и перегенерировать, секунду.", "confidence": 0.95}
{"start": 3353, "end": 3364, "speaker": "Dan Khasis", "text": "Видишь, на уровне connection я поменяю на 180 секунд.", "confidence": 0.37}
{"start": 3379, "end": 3383.0, "speaker": "Dan Khasis", "text": "Сейчас подожду, пока он закончится.", "confidence": 0.95}
{"start": 3383.0, "end": 3387.0, "speaker": "Igor Skrynkovskyy", "text": "Ты прописывал сюда сервисный ключ, чтобы подключиться к Spanner, или просто через Google?", "confidence": 0.95}
{"start": 3387.0, "end": 3391.0, "speaker": "Igor Skrynkovskyy", "text": "Просто интересно.", "confidence": 0.95}
{"start": 3396, "end": 3427, "speaker": "Dan Khasis", "text": "Они даже неправильно описывали фикс, который они сделали.", "confidence": 0.09}
{"start": 3431, "end": 3433, "speaker": "Igor Skrynkovskyy", "text": "Это ты о ком? О Антоне?", "confidence": 0.99}
{"start": 3440, "end": 3515, "speaker": "Dan Khasis", "text": "Леван, который пришел на всю хуйню и сказал, что мы запустили фикс для старт-тайма, и потом выясняется, что они никакой фикс не запустили для старт-тайма, а запустили какой-то хэк для Dynamic Service Time. Игорь пока здесь раноется, и мне кажется, она опять взорвалась. Я хочу сказать быструю вещь насчет информации, которую сегодня утром насчет Transcode мы узнали.\n\nЯ тебе дам сценарий. Водитель обязан приехать в внутривременное окно, чтобы его пустили в склад или в здание. Например, уборщик, например, разгрузить 10 тысяч килограмм песка.\n\nЭта процедура может занять 2-3 часа. Но самое важное, это заехать, например, внутрь шлагбаума. А раз тебя уже впустили, ты уже авторизованный, ты там.\n\nА ты если приехал, когда уже нет секьюрити, шлагбаума нет, значит, никто не откроет шлагбаум, потому что нет оператора, понимаешь?", "confidence": 0.94}
{"start": 3516, "end": 3516, "speaker": "Igor Skrynkovskyy", "text": "Да.", "confidence": 0.7}
{"start": 3518, "end": 3534.67, "speaker": "Dan Khasis", "text": "Нам нужно срочно сказать Максименко, прибавить какой-то или научить нас пользовать constraint, который позволит нам приехать.", "confidence": 0.95}
{"start": 3534.67, "end": 3551.33, "speaker": "Dan Khasis", "text": "У нас сейчас ограничение и у всех наших конкурентов такая же проблема, что нам нужно иметь возможность service time длиннее, чем временное окно.", "confidence": 0.95}
{"start": 3551.33, "end": 3568.0, "speaker": "Dan Khasis", "text": "Потому что сейчас 3 часа разгрузить 50 тысяч килограмм чего-то, самое важное приехать за шлагбаумом, когда нет.", "confidence": 0.95}
{"start": 3573, "end": 3625, "speaker": "Igor Skrynkovskyy", "text": "Я понял, то есть мы просто по какой-то опции будем игнорировать. Нам главное заехать в тайм-виндов, но не проверять service time, который там провел или проведет пользователь. Окей, а что делать, нам же нужно как-то посчитать время работы там.\n\nИ как ее посчитать в таком случае? Потому что планированное время работы мы же тогда не будем знать, сколько его и так далее. То есть считать просто то service time, который там указан, то есть если там окно с часу до двух, а сервисное окно 5 часов, то мы просто считаем, что он там провел 5 часов.", "confidence": 0.99}
{"start": 3628, "end": 3655, "speaker": "Dan Khasis", "text": "Да, это значит, что Сергей должен модифицировать у себя логику и делать более мягкий end statement на close time window, он должен выключить, правильно?", "confidence": 0.58}
{"start": 3657, "end": 3661, "speaker": "Igor Skrynkovskyy", "text": "Проверку, да, проверку вхождения сервисного времени.", "confidence": 0.99}
{"start": 3661, "end": 3676, "speaker": "Dan Khasis", "text": "Проверка вхождения должно быть позже, проверка может быть позже, да.", "confidence": 0.53}
{"start": 3678, "end": 3689, "speaker": "Dan Khasis", "text": "Смотри, а почему мы не можем просто, например, сделать задачу без сервисного времени, а сервисное время добавлять потом, как бы после оптимизации?", "confidence": 0.41}
{"start": 3689, "end": 3708.0, "speaker": "Dan Khasis", "text": "Я думал на эту тему, но я боюсь, что там что-то взорвется из-за этого.", "confidence": 0.95}
{"start": 3708.0, "end": 3727.0, "speaker": "Dan Khasis", "text": "Я думаю, что это как-то нарушит, что если чувак приехал туда, например, между часа два он приехал туда в час тридцать, и потом после того, как он приехал в час тридцать, если мы сделаем сервис time 0 при процессинге, а следующая остановка должна тоже иметь time window, если мы не включим полноценные шесть часов сервис time, тогда следующая остановка, мы ее можем прорезевать.", "confidence": 0.95}
{"start": 3729, "end": 3747, "speaker": "Igor Skrynkovskyy", "text": "Я понял, хорошо. Только смотри, Сергей будет на звонки, он будет доступен, но он недоступен по работе, то есть он до субботы. То есть если это не горит, то я с ним сегодня переговорю, постараюсь.", "confidence": 0.99}
{"start": 3747, "end": 3753, "speaker": "Dan Khasis", "text": "Я думаю, что это горит, но нам нужно как минимум объяснить это, чтобы он думал насчет этого.", "confidence": 0.96}
{"start": 3754, "end": 3757.0, "speaker": "Igor Skrynkovskyy", "text": "Хорошо, я себе записал.", "confidence": 0.95}
{"start": 3757.0, "end": 3760.0, "speaker": "Igor Skrynkovskyy", "text": "Я не думаю, что это будет проблемой.", "confidence": 0.95}
{"start": 3760.0, "end": 3763.0, "speaker": "Igor Skrynkovskyy", "text": "То есть через субботу это можно выключить.", "confidence": 0.95}
{"start": 3765, "end": 3770, "speaker": "Dan Khasis", "text": "Это как бы смотреть только на start window open, а не start window close.", "confidence": 0.99}
{"start": 3774, "end": 3787, "speaker": "Igor Skrynkovskyy", "text": "Ну да, то есть сумма открытого окна или открытое окно вообще не должно превышать сервис time, а мы вот эту проверку просто убираем.", "confidence": 0.99}
{"start": 3787, "end": 3792, "speaker": "Dan Khasis", "text": "Да, Дэвид говорит, что это очень уникальная вещь будет, если мы это поддержим.", "confidence": 0.99}
{"start": 3797, "end": 3799, "speaker": "Igor Skrynkovskyy", "text": "Казалось бы, мелкая фигня.", "confidence": 0.99}
{"start": 3801, "end": 3806, "speaker": "Dan Khasis", "text": "Да, но у нас 15 лет, ее по-прежнему нет, хотя она мелкая.", "confidence": 0.99}
{"start": 3807, "end": 3814, "speaker": "Igor Skrynkovskyy", "text": "Опыт приходит с временем. Мы должны были 15 лет пройти, чтобы сейчас добавить.", "confidence": 0.99}
{"start": 3821, "end": 3828.0, "speaker": "Dan Khasis", "text": "Дебаггер MySQL в тысячу раз лучше.", "confidence": 0.95}
{"start": 3828.0, "end": 3835.0, "speaker": "Dan Khasis", "text": "Так и есть.", "confidence": 0.95}
{"start": 3835.0, "end": 3842.0, "speaker": "Dan Khasis", "text": "Сейчас, секунду.", "confidence": 0.95}
{"start": 3842.0, "end": 3849.0, "speaker": "Dan Khasis", "text": "Нам нужно вставить сюда root member id, потом мы вставляем linked object type id, потом вставляем entity type id.", "confidence": 0.95}
{"start": 3851, "end": 3855, "speaker": "Igor Skrynkovskyy", "text": "Нет, так нельзя, нам нужно идти и типа.", "confidence": 0.92}
{"start": 3856, "end": 3859, "speaker": "Dan Khasis", "text": "Я делаю типа. Я делаю типа.", "confidence": 0.99}
{"start": 3860, "end": 3864, "speaker": "Igor Skrynkovskyy", "text": "Нет, так тип и id, то есть они парами как бы идут.", "confidence": 0.99}
{"start": 3864, "end": 3872.0, "speaker": "Igor Skrynkovskyy", "text": "Я иду, она просто не успевает с моей скоростью.", "confidence": 0.95}
{"start": 3872.0, "end": 3880.0, "speaker": "Dan Khasis", "text": "Окей, сейчас есть, но она все равно жалуется, здесь запятая наверное где-то лишняя.", "confidence": 0.95}
{"start": 3885, "end": 3889, "speaker": "Igor Skrynkovskyy", "text": "Булл, после булла, нет. Нет-нет-нет, все правильно.", "confidence": 0.92}
{"start": 3908, "end": 3911, "speaker": "Dan Khasis", "text": "Сергей, у нас есть какие-то хорошие новости насчет чего-то?", "confidence": 0.99}
{"start": 3915, "end": 3922, "speaker": "Serhii Kasainov", "text": "Мы все активно работаем над Strategic Planner. Я там сегодня заделал все фильтры почти, которые Back умеет.", "confidence": 0.99}
{"start": 3925, "end": 3935, "speaker": "Igor Skrynkovskyy", "text": "Там название таблицы еще неправильное вот здесь. Оно должно быть. Да-да-да, вот это.\n\nДа, извините, Сергей.", "confidence": 0.96}
{"start": 3937, "end": 3943, "speaker": "Serhii Kasainov", "text": "Карту занесли локально. Еще там всякие мелкие поповеры и все делаем.", "confidence": 0.99}
{"start": 3946, "end": 3949.0, "speaker": "Dan Khasis", "text": "Можно на стейджинге посмотреть?", "confidence": 0.95}
{"start": 3949.0, "end": 3952.0, "speaker": "Serhii Kasainov", "text": "Фильтры точно уже есть на стейджинге.", "confidence": 0.95}
{"start": 3954, "end": 3971, "speaker": "Serhii Kasainov", "text": "Какие-то мелкие фиксы наверное тоже. Мы кстати хотим фильтровать по процентным колонкам, прям по всем. Нам не надо, но там так много фильтров в таблице сценариев.", "confidence": 0.66}
{"start": 3974, "end": 3976, "speaker": "Dan Khasis", "text": "Нам не надо все, нам нужно некоторые.", "confidence": 0.77}
{"start": 3980, "end": 3981, "speaker": "Serhii Kasainov", "text": "Да, что кажется.", "confidence": 0.99}
{"start": 3983, "end": 3984, "speaker": "Serhii Kasainov", "text": "Знали вы только теперь какие.", "confidence": 0.99}
{"start": 3985, "end": 3987, "speaker": "Dan Khasis", "text": "Я думал, что я написал вам какие.", "confidence": 0.8}
{"start": 3990, "end": 3997, "speaker": "Serhii Kasainov", "text": "Есть один скрин под одну конкретную табу, я завтра пересмотрю еще все документы, может еще найду.", "confidence": 0.99}
{"start": 4004, "end": 4017, "speaker": "Dan Khasis", "text": "Я должен буду пересоздать некоторые, Игорь, эти таблицы на мастера, чтобы была линковка. Но в принципе она остается только финальная.", "confidence": 0.99}
{"start": 4021, "end": 4026, "speaker": "Igor Skrynkovskyy", "text": "Меня не беспокоит, знаешь, Дэн, то, что у нас геокоординат нет.", "confidence": 0.99}
{"start": 4029, "end": 4033, "speaker": "Dan Khasis", "text": "Да, геокоординат у нас нет и надо подумать насчет этого.", "confidence": 0.99}
{"start": 4035, "end": 4043, "speaker": "Igor Skrynkovskyy", "text": "Смотри, я не понимаю твоего беспокойства насчет того, что мы будем что-то так писать, много записей.", "confidence": 0.99}
{"start": 4043, "end": 4048.3, "speaker": "Igor Skrynkovskyy", "text": "Потому что мы смешиваем операционную базу данных с… надо убрать слово карго, это неправильное слово.", "confidence": 0.95}
{"start": 4048.3, "end": 4053.6, "speaker": "Dan Khasis", "text": "Карго это только для кораблей, которые перевозят контейнеры.", "confidence": 0.95}
{"start": 4053.6, "end": 4058.9, "speaker": "Dan Khasis", "text": "Нам надо это больше как… у нас же и было для этого.", "confidence": 0.95}
{"start": 4058.9, "end": 4064.2, "speaker": "Dan Khasis", "text": "Бизнес атрибуты еще было.", "confidence": 0.95}
{"start": 4064.2, "end": 4069.5, "speaker": "Dan Khasis", "text": "Нет, но у нас в другом месте же есть или была категоризация этого.", "confidence": 0.95}
{"start": 4069.5, "end": 4074.8, "speaker": "Dan Khasis", "text": "Сейчас, секунду.", "confidence": 0.95}
{"start": 4074.8, "end": 4080.1, "speaker": "Dan Khasis", "text": "Здесь вообще нет категоризации, ужас.", "confidence": 0.95}
{"start": 4080.1, "end": 4085.4, "speaker": "Dan Khasis", "text": "Сейчас, секунду.", "confidence": 0.95}
{"start": 4085.4, "end": 4090.7, "speaker": "Dan Khasis", "text": "И это другая таблица, Игорь, я должен вам сделать.", "confidence": 0.95}
{"start": 4090.7, "end": 4096.0, "speaker": "Dan Khasis", "text": "Все колонки из всех мест в одну кучу собрать.", "confidence": 0.95}
{"start": 4101, "end": 4103, "speaker": "Serhii Kasainov", "text": "Тут она разбита на отдельные категории.", "confidence": 0.78}
{"start": 4119, "end": 4124.0, "speaker": "Dan Khasis", "text": "Дименшионал, вот что это слово.", "confidence": 0.95}
{"start": 4134.0, "end": 4139.0, "speaker": "Dan Khasis", "text": "Одним словом?", "confidence": 0.95}
{"start": 4139.0, "end": 4144.0, "speaker": "Serhii Kasainov", "text": "Нет, сейчас, секунду.", "confidence": 0.95}
{"start": 4144.0, "end": 4149.0, "speaker": "Dan Khasis", "text": "Дименшионал что?", "confidence": 0.95}
{"start": 4149.0, "end": 4154.0, "speaker": "Dan Khasis", "text": "Все вот эти вещи это дименшионал.", "confidence": 0.95}
{"start": 4154.0, "end": 4159.0, "speaker": "Dan Khasis", "text": "Дименшионал это как бы дименсии это, как емкости или описания физических… Почему это прежде не починено-то, я не понимаю.", "confidence": 0.95}
{"start": 4159.0, "end": 4164.0, "speaker": "Dan Khasis", "text": "Думаю, мы решили сделать под секцию план, динамик и так далее.", "confidence": 0.95}
{"start": 4164.0, "end": 4169.0, "speaker": "Dan Khasis", "text": "Очень странно.", "confidence": 0.95}
{"start": 4169, "end": 4178, "speaker": "Serhii Kasainov", "text": "Да, но у меня это зафиксировано на телефоне, но после прилетело от тебя еще столько задач, что оно просто где-то там лежит и ждет.", "confidence": 0.96}
{"start": 4178, "end": 4189.33, "speaker": "Dan Khasis", "text": "Я понимаю, но ты… Это не от меня пришло, это люди пропустили из-за отсутствия продакт менеджмента.", "confidence": 0.95}
{"start": 4189.33, "end": 4200.67, "speaker": "Dan Khasis", "text": "И я просто подчеркиваю, что я вижу, я не придумываю просто там, просто так.", "confidence": 0.95}
{"start": 4200.67, "end": 4212.0, "speaker": "Dan Khasis", "text": "Но дименшионал, у нас же было где-то, бизнес интеллигенция, это должно быть как бы где-то.", "confidence": 0.95}
{"start": 4212, "end": 4218, "speaker": "Dan Khasis", "text": "Что здесь происходит?", "confidence": 0.24}
{"start": 4219, "end": 4229, "speaker": "Dan Khasis", "text": "Мне кажется, что опять взорвался этот DataGrip. Memory leak, оно Memory leak и бомбит.", "confidence": 0.99}
{"start": 4232, "end": 4234, "speaker": "Igor Skrynkovskyy", "text": "Джава хочет больше бомбить.", "confidence": 0.91}
{"start": 4237, "end": 4240, "speaker": "Dan Khasis", "text": "Да, здесь все взорвалось опять сейчас.", "confidence": 0.99}
{"start": 4248, "end": 4307, "speaker": "Dan Khasis", "text": "Мне теперь мышка начала двигаться, хуй знает куда. Странно. Видишь, меня просто возмущает качество думания.\n\nВидишь, у тебя есть вес, потом у тебя есть стоимость, потом у тебя есть доход, потом у тебя есть куб, потом у тебя есть количество. Но почему, как бутерброд, финансовые вещи внутри, емкости, если в принципе правильно это вес, куб, количество товаров и потом уже cost и revenue. Зачем просто так засовывать?\n\nТы понял в скриншот, как это должно быть? Dimensional и financial.", "confidence": 0.69}
{"start": 4308, "end": 4312, "speaker": "Serhii Kasainov", "text": "Да, то есть мы их разделяем или все-таки так и оставляем?", "confidence": 0.87}
{"start": 4312, "end": 4371, "speaker": "Dan Khasis", "text": "Оставляй, просто слово неправильно. Cargo – неправильное слово. Я не знаю, кто придумал, я не хочу знать, кто придумал, но неправильное слово.\n\nОкей, так ты поменяешь порядок, чтобы cost и revenue был после куба и pieces, но я просто не понимаю одну вещь, что здесь не забудь будет assets и last known location assets. Здесь vehicles почему-то нету. Почему, я не знаю.\n\nКак могут здесь vehicles не быть?", "confidence": 0.43}
{"start": 4374, "end": 4378, "speaker": "Serhii Kasainov", "text": "Сейчас опять обнаружится фича. Сейчас я проверю.", "confidence": 0.93}
{"start": 4379, "end": 4393, "speaker": "Dan Khasis", "text": "Но хочу фича. Там у этого Слепакова была песня «Хочу хача». Я хочу фича.\n\nБыло-было.", "confidence": 0.65}
{"start": 4393, "end": 4396, "speaker": "Serhii Kasainov", "text": "Да, это фича. Вот у меня на экране есть.", "confidence": 0.99}
{"start": 4398, "end": 4401.0, "speaker": "Igor Skrynkovskyy", "text": "Так, видишь… Я его включу.", "confidence": 0.95}
{"start": 4401.0, "end": 4404.0, "speaker": "Igor Skrynkovskyy", "text": "Сергей, скинь мне фичу, я включу для дома.", "confidence": 0.95}
{"start": 4404.0, "end": 4407.0, "speaker": "Igor Skrynkovskyy", "text": "Сейчас будет.", "confidence": 0.95}
{"start": 4411, "end": 4419.75, "speaker": "Dan Khasis", "text": "Здесь таким же образом и появятся эти assets один в один.", "confidence": 0.95}
{"start": 4419.75, "end": 4428.5, "speaker": "Dan Khasis", "text": "И погода тоже.", "confidence": 0.95}
{"start": 4428.5, "end": 4437.25, "speaker": "Dan Khasis", "text": "Да, и вот здесь будет…\n\nИгорь, нам надо подумать, как мы будем линковать сюда assets, если нам нужно сделать еще одну таблицу, которая линкует.", "confidence": 0.95}
{"start": 4437.25, "end": 4446.0, "speaker": "Dan Khasis", "text": "Или эта таблица assets and entity…", "confidence": 0.95}
{"start": 4446, "end": 4458, "speaker": "Igor Skrynkovskyy", "text": "Ну да, конечно. Это связь просто маршруты. Но я боюсь, что эта таблица просто очень быстро вырастет до очень больших размеров.", "confidence": 0.99}
{"start": 4458, "end": 4461.0, "speaker": "Dan Khasis", "text": "Я не думаю.", "confidence": 0.95}
{"start": 4461.0, "end": 4464.0, "speaker": "Dan Khasis", "text": "Потому что я думаю, что единицы юзера будут ее пользовать.", "confidence": 0.95}
{"start": 4465, "end": 4468, "speaker": "Igor Skrynkovskyy", "text": "Ну да, с одной стороны.", "confidence": 0.99}
{"start": 4468, "end": 4498, "speaker": "Dan Khasis", "text": "Смотри на этот пункт, что… Еще пункт, что если мы будем делать раутинг на asset, у нас раутинг на asset будет… Нам надо не потерять на уровне destination полноценный asset identifier.\n\nТак же, как у нас мы не имеем права потерять customer identifier.", "confidence": 0.6}
{"start": 4502, "end": 4507, "speaker": "Igor Skrynkovskyy", "text": "Мы, может, теоретически можем тоже ту же самую таблицу использовать для…", "confidence": 0.92}
{"start": 4507, "end": 4513.5, "speaker": "Dan Khasis", "text": "Но не на уровне destination ID, тогда она вообще взорвется, точно.", "confidence": 0.95}
{"start": 4513.5, "end": 4520.0, "speaker": "Igor Skrynkovskyy", "text": "Но надо подумать.", "confidence": 0.95}
{"start": 4520.0, "end": 4526.5, "speaker": "Dan Khasis", "text": "Еще другую вещь надо подумать, Игорь.", "confidence": 0.95}
{"start": 4526.5, "end": 4533.0, "speaker": "Dan Khasis", "text": "На уровне раут надо, в принципе, иметь… Некоторые фирмы делают один раут только для одного кастомера.", "confidence": 0.95}
{"start": 4533.0, "end": 4539.5, "speaker": "Dan Khasis", "text": "Надо подумать, как пролинковать раут на customer ID.", "confidence": 0.95}
{"start": 4539.5, "end": 4546.0, "speaker": "Dan Khasis", "text": "Весь раут на customer ID.", "confidence": 0.95}
{"start": 4546.0, "end": 4552.5, "speaker": "Dan Khasis", "text": "Потому что если моя фирма делает работу только, например, на, я не знаю, Walmart или… Nike или Adidas, я только вожу для Nike и Adidas.", "confidence": 0.95}
{"start": 4552.5, "end": 4559.0, "speaker": "Dan Khasis", "text": "Тот маршрут только для Nike и Adidas.", "confidence": 0.95}
{"start": 4559.0, "end": 4565.5, "speaker": "Dan Khasis", "text": "Я хочу пойти в… Вот почему я сделал новую таблицу в ERP-системе, которая называется…\n\nКоторая линкует раут.", "confidence": 0.95}
{"start": 4565.5, "end": 4572.0, "speaker": "Dan Khasis", "text": "Здесь будет group by customer.", "confidence": 0.95}
{"start": 4572.0, "end": 4578.5, "speaker": "Dan Khasis", "text": "Потому что иногда весь раут dedicated к одному кастомеру или к одному кастомер-контракту.", "confidence": 0.95}
{"start": 4578.5, "end": 4585.0, "speaker": "Dan Khasis", "text": "Когда мы карту увидим здесь, Сергей?", "confidence": 0.95}
{"start": 4587, "end": 4591, "speaker": "Serhii Kasainov", "text": "Сейчас, получается, на Strategic Planner увидим раньше.", "confidence": 0.99}
{"start": 4596, "end": 4609, "speaker": "Dan Khasis", "text": "Было бы круто, если это взять как-то, сдвинуть налево. И потом, если кликать, я вам покажу, как мы сделали на скопе.", "confidence": 0.98}
{"start": 4611, "end": 4613.5, "speaker": "Serhii Kasainov", "text": "Я вообще хотел эту таблицу растянуть.", "confidence": 0.95}
{"start": 4613.5, "end": 4616.0, "speaker": "Serhii Kasainov", "text": "Там стало больше колонок, и она должна быть полноразмерной.", "confidence": 0.95}
{"start": 4616, "end": 4621.79, "speaker": "Dan Khasis", "text": "Делай, делай, делай, делай.", "confidence": 0.95}
{"start": 4621.79, "end": 4627.58, "speaker": "Dan Khasis", "text": "Так же, как Raute Destinations.", "confidence": 0.95}
{"start": 4627.58, "end": 4633.37, "speaker": "Dan Khasis", "text": "Я хочу показать вам, как мы сделали новую систему.", "confidence": 0.95}
{"start": 4633.37, "end": 4639.16, "speaker": "Dan Khasis", "text": "Это все на GO и на Road Runner и так далее.", "confidence": 0.95}
{"start": 4639.16, "end": 4644.95, "speaker": "Dan Khasis", "text": "Посмотри на скорость.", "confidence": 0.95}
{"start": 4644.95, "end": 4650.74, "speaker": "Dan Khasis", "text": "Она просто летает.", "confidence": 0.95}
{"start": 4656.53, "end": 4662.32, "speaker": "Dan Khasis", "text": "То есть GO и эластик.", "confidence": 0.95}
{"start": 4662.32, "end": 4668.11, "speaker": "Dan Khasis", "text": "И я пытаюсь их заставить перейти на сокеты тоже.", "confidence": 0.95}
{"start": 4668.11, "end": 4673.89, "speaker": "Dan Khasis", "text": "Но и компрессия высокая, бродли.", "confidence": 0.95}
{"start": 4673.89, "end": 4679.68, "speaker": "Dan Khasis", "text": "Вот это я хотел вам показать.", "confidence": 0.95}
{"start": 4679.68, "end": 4685.47, "speaker": "Dan Khasis", "text": "Если посмотреть на какого-то доктора, у него есть таймлайны.", "confidence": 0.95}
{"start": 4685.47, "end": 4691.26, "speaker": "Dan Khasis", "text": "Видишь таймлайны?", "confidence": 0.95}
{"start": 4691.26, "end": 4697.05, "speaker": "Dan Khasis", "text": "Можно таймлайн наращивать.", "confidence": 0.95}
{"start": 4697.05, "end": 4702.84, "speaker": "Dan Khasis", "text": "И потом, когда ты кликаешь на какую-то из этих вещей, меняется состав.", "confidence": 0.95}
{"start": 4702.84, "end": 4708.63, "speaker": "Dan Khasis", "text": "Вот, видишь, я могу кликать на любой ряд, и меняется динамически содержание этого.", "confidence": 0.95}
{"start": 4708.63, "end": 4714.42, "speaker": "Dan Khasis", "text": "Так вот, если бы у нас было такого типа интерфейса для некоторых вещей, это было бы суперудобно, потому что я бы тогда смог открыть, например, в этом месте, я бы кликнул на неделю, она бы волшебно просто открыла здесь.", "confidence": 0.95}
{"start": 4714.42, "end": 4720.21, "speaker": "Dan Khasis", "text": "И показала и карту, и все данные.", "confidence": 0.95}
{"start": 4720.21, "end": 4726.0, "speaker": "Dan Khasis", "text": "И я бы мог кликать моментально, клик-клик-клик-клик-клик-клик, и через каждую двигаться и летать просто.", "confidence": 0.95}
{"start": 4727, "end": 4731.75, "speaker": "Serhii Kasainov", "text": "Мы вот такое вот делаем вот здесь.", "confidence": 0.95}
{"start": 4731.75, "end": 4736.5, "speaker": "Serhii Kasainov", "text": "Нет, в локейшенах.", "confidence": 0.95}
{"start": 4736.5, "end": 4741.25, "speaker": "Serhii Kasainov", "text": "В раутах просто, там макета Provenut, который Вова рисовал, просто он карту сделал отдельной табой, и он мне конкретно объяснил почему.", "confidence": 0.95}
{"start": 4741.25, "end": 4746.0, "speaker": "Serhii Kasainov", "text": "Потому что там есть таймлайн, и ты вертишь эту карту по дням.", "confidence": 0.95}
{"start": 4746, "end": 4781, "speaker": "Dan Khasis", "text": "Это само собой. Это один view, но это совершенно другая вещь, когда я хочу посмотреть конкретную вещь, я кликаю на нее. Я не могу просто взять и выбрать, и сравнить две вещи после фильтрации.\n\nЯ обязан иметь возможность их side-by-side проверить. А карта, которую он рисовал, никогда не позволит делать первый маршрут, второй маршрут. Потому что клиенты хотят видеть, как выглядит маршрут первый день второй недели, первый день 23 недели, первый день 24 недели.\n\nОни не верят, они хотят видеть своими глазами side-by-side.", "confidence": 0.99}
{"start": 4784, "end": 4797, "speaker": "Serhii Kasainov", "text": "Хорошо, но это на одной карте с разными маршрутами. Или как это?", "confidence": 0.93}
{"start": 4798, "end": 4804.1, "speaker": "Serhii Kasainov", "text": "Ты видишь?", "confidence": 0.95}
{"start": 4804.1, "end": 4810.2, "speaker": "Dan Khasis", "text": "Я вижу, что если ты кликаешь на каждый маршрут, как в скопе, она моментально показывает тебе high-level overview, или ты можешь, как ты покупаешь, например, ты пошел, ты хочешь купить цифровую камеру, и теперь я кликаю add to compare, я кликаю compare и моментально она сравнивает их.", "confidence": 0.95}
{"start": 4810.2, "end": 4816.3, "speaker": "Dan Khasis", "text": "Вот о чем речь идет.", "confidence": 0.95}
{"start": 4816.3, "end": 4822.4, "speaker": "Dan Khasis", "text": "А у нас этого нет.", "confidence": 0.95}
{"start": 4822.4, "end": 4828.5, "speaker": "Dan Khasis", "text": "Я не могу сейчас включить.", "confidence": 0.95}
{"start": 4828.5, "end": 4834.6, "speaker": "Dan Khasis", "text": "Я могу здесь это сделать, но route comparison халява по-прежнему legacy, но тем не менее она работает.", "confidence": 0.95}
{"start": 4834.6, "end": 4840.7, "speaker": "Dan Khasis", "text": "Я могу bulk.", "confidence": 0.95}
{"start": 4840.7, "end": 4846.8, "speaker": "Dan Khasis", "text": "Здесь надо, в принципе, было compare лучше здесь делать.", "confidence": 0.95}
{"start": 4846.8, "end": 4852.9, "speaker": "Dan Khasis", "text": "Я не понимаю, где compare.", "confidence": 0.95}
{"start": 4852.9, "end": 4859.0, "speaker": "Dan Khasis", "text": "Странно очень.", "confidence": 0.95}
{"start": 4871, "end": 4872, "speaker": "Igor Skrynkovskyy", "text": "Убрали этот...", "confidence": 0.46}
{"start": 4874, "end": 4881, "speaker": "Serhii Kasainov", "text": "Что-то мы сегодня поломали. Там вот такой вот список должен быть на 25 элементов. Что-то у нас сегодня поломалось.", "confidence": 0.99}
{"start": 4883, "end": 4885, "speaker": "Dan Khasis", "text": "Да, здесь тоже все накрылось.", "confidence": 0.96}
{"start": 4889, "end": 4890, "speaker": "Serhii Kasainov", "text": "Я сейчас посмотрю.", "confidence": 0.99}
{"start": 4891, "end": 4897.95, "speaker": "Dan Khasis", "text": "Здесь группировка тоже должна быть по типу facility, но окей.", "confidence": 0.95}
{"start": 4897.95, "end": 4904.9, "speaker": "Dan Khasis", "text": "Я должен двигаться.", "confidence": 0.95}
{"start": 4904.9, "end": 4911.85, "speaker": "Serhii Kasainov", "text": "Здесь нет output, ничего другого.", "confidence": 0.95}
{"start": 4911.85, "end": 4918.8, "speaker": "Dan Khasis", "text": "Тоже, кстати, почему-то.", "confidence": 0.95}
{"start": 4918.8, "end": 4925.75, "speaker": "Dan Khasis", "text": "Открой, пожалуйста, консоль.", "confidence": 0.95}
{"start": 4925.75, "end": 4932.7, "speaker": "Dan Khasis", "text": "Такое ощущение, что какая-то может опишка одна умерла.", "confidence": 0.95}
{"start": 4932.7, "end": 4939.65, "speaker": "Dan Khasis", "text": "Сергей, посмотри на customers.", "confidence": 0.95}
{"start": 4939.65, "end": 4946.6, "speaker": "Dan Khasis", "text": "Вот я открыл на customers.", "confidence": 0.95}
{"start": 4946.6, "end": 4953.55, "speaker": "Dan Khasis", "text": "Здесь и надо отпутать количество locations, количество assets сюда появится.", "confidence": 0.95}
{"start": 4953.55, "end": 4960.5, "speaker": "Dan Khasis", "text": "Тоже количество assets.", "confidence": 0.95}
{"start": 4967.45, "end": 4974.4, "speaker": "Dan Khasis", "text": "Я кликну сюда на customer locations.", "confidence": 0.95}
{"start": 4974.4, "end": 4981.35, "speaker": "Dan Khasis", "text": "Я буду группировать не просто по customer, но еще, например, number of assets теперь появится сюда.", "confidence": 0.95}
{"start": 4981.35, "end": 4988.3, "speaker": "Dan Khasis", "text": "Потом я открою новую вещь, которая будет иметь assets, и она будет копия vehicles почти.", "confidence": 0.95}
{"start": 4988.3, "end": 4995.25, "speaker": "Dan Khasis", "text": "Я открою это telematics connections, там будет новая вкладка, теперь sync assets.", "confidence": 0.95}
{"start": 4995.25, "end": 5002.2, "speaker": "Dan Khasis", "text": "GPS inside PS должно быть большой регистр Samsara.", "confidence": 0.95}
{"start": 5002.2, "end": 5009.15, "speaker": "Dan Khasis", "text": "Видишь, sync customer data появится.", "confidence": 0.95}
{"start": 5009.15, "end": 5016.1, "speaker": "Dan Khasis", "text": "Должно появиться sync routes, и потом нужно, помолчание включено, и должно быть, я бы сделал, и должно быть sync assets.", "confidence": 0.95}
{"start": 5016.1, "end": 5023.05, "speaker": "Dan Khasis", "text": "Я бы сделал еще одну секцию, когда мы сделаем sync HOS, я сделаю модель тоже для этого.", "confidence": 0.95}
{"start": 5023.05, "end": 5030.0, "speaker": "Dan Khasis", "text": "HOS – это все, когда люди работали, ну, когда водитель за рулем сидел, он трекает это, потому что это будет влиять на на все.", "confidence": 0.95}
{"start": 5034, "end": 5040.5, "speaker": "Igor Skrynkovskyy", "text": "Я все понял, кроме сравнения сценариев, как это уместить в один экран.", "confidence": 0.95}
{"start": 5040.5, "end": 5047.0, "speaker": "Serhii Kasainov", "text": "Ты показал пример в интернет-магазине, они специально это делают отдельными страничками, и ты там до пяти колонок.", "confidence": 0.95}
{"start": 5047, "end": 5073, "speaker": "Dan Khasis", "text": "Да, ты совершенно верно, ты выбрал до пяти, совершенно верно, ты выбрал до пяти, и потом ты, да, совершенно верно, ты выбрал до пяти, и потом ты берешь и кликаешь view, и потом открывается fullscreen comparison, который имеет все метрики, pivot, так же, как старое имело всегда.", "confidence": 0.85}
{"start": 5078, "end": 5086, "speaker": "Dan Khasis", "text": "Вот так понятно, что с первого клика что-то откроется.", "confidence": 0.85}
{"start": 5087, "end": 5102, "speaker": "Dan Khasis", "text": "Окей, я это, я должен сделать небольшой перерыв, потом узнать, кто за ребенком ездит, потом с маркетингом звонок будет, и другие дела.", "confidence": 0.91}
{"start": 5106, "end": 5107, "speaker": "Igor Skrynkovskyy", "text": "Окей, спасибо за интервью.", "confidence": 0.99}
{"start": 5107, "end": 5112.0, "speaker": "Igor Skrynkovskyy", "text": "Игорь, еще что-то есть, вопросы какие-то?", "confidence": 0.95}
{"start": 5112.0, "end": 5117.0, "speaker": "Dan Khasis", "text": "Нет, смотри, вопросов нету больше, я должен, мне кажется, одну таблицу вам для инвойсинга и SQLite для инвойсинга.", "confidence": 0.95}
{"start": 5117.0, "end": 5122.0, "speaker": "Dan Khasis", "text": "Я думаю, что инвойсинг первой версии готова.", "confidence": 0.95}
{"start": 5123, "end": 5141, "speaker": "Igor Skrynkovskyy", "text": "Хорошо, но просто тогда скинь последний конечный DDL с вот этими значениями и так далее, чтобы мы его нигде не потеряли. Чтобы мы уже финально зафиналили и сказали, что мы готовы к работе.", "confidence": 0.95}
{"start": 5142, "end": 5150, "speaker": "Dan Khasis", "text": "Вы готовы к работе, просто там еще одна таблица может быть нужна для чего-то.", "confidence": 0.99}
{"start": 5156, "end": 5172, "speaker": "Igor Skrynkovskyy", "text": "Хорошо, но мы все равно начали работу. Если все получится, я тебе завтра расскажу. У нас очень интересные вещи связаны с AI.\n\nЕсли получится, я завтра расскажу.", "confidence": 0.99}
{"start": 5172, "end": 5173, "speaker": "Igor Skrynkovskyy", "text": "Спасибо, пока.", "confidence": 0.99}
