{"start": 31, "end": 32.67, "speaker": "Anton Zadyraka", "text": "Привет.", "confidence": 0.95}
{"start": 34.33, "end": 36.0, "speaker": "Mihail Krivulya", "text": "Всем привет.", "confidence": 0.95}
{"start": 48, "end": 49, "speaker": "Kateryna Shevchenko", "text": "Привет всем.", "confidence": 0.99}
{"start": 50, "end": 51, "speaker": "Kateryna Shevchenko", "text": "Алё, алё. Да, слышишь?", "confidence": 0.85}
{"start": 52, "end": 52, "speaker": "Alexandr Kovtunov", "text": "Привет.", "confidence": 0.69}
{"start": 54, "end": 65, "speaker": "Alexey Afanasiev", "text": "Буквально, я там просто в каких-то местах сам исправил на новый логотип без драйв, там, в письмах, на сиденье.", "confidence": 0.97}
{"start": 66, "end": 76, "speaker": "Alexey Afanasiev", "text": "Просто хотел с тобой смыщаться, что эти новые картинки, новые логотипы, там везде обновлены.", "confidence": 0.79}
{"start": 76, "end": 78, "speaker": "Alexey Afanasiev", "text": "Потому что они частично лежат в репозиториях.", "confidence": 0.99}
{"start": 79, "end": 85, "speaker": "Alexandr Kovtunov", "text": "В репозитории только один как раз лежит, который мы поправили. Я могу мне ссылку дать.", "confidence": 0.99}
{"start": 86, "end": 88, "speaker": "Alexey Afanasiev", "text": "А, ну всё, если поправили, то поправили. Окей.", "confidence": 0.99}
{"start": 89, "end": 96.5, "speaker": "Alexandr Kovtunov", "text": "То есть оно у нас используется на главной странице и после логина на главном меню.", "confidence": 0.95}
{"start": 96.5, "end": 104.0, "speaker": "Alexandr Kovtunov", "text": "Там нужно будет, наверное, я не знаю, если может кто-то скинет ещё там какие-то новые логи.", "confidence": 0.95}
{"start": 104, "end": 107.75, "speaker": "Alexandr Kovtunov", "text": "Потому что, по-моему, Вова там что-то набрасывал.", "confidence": 0.95}
{"start": 107.75, "end": 111.5, "speaker": "Alexey Afanasiev", "text": "Ну, у меня есть сейчас табличка, я себе сделаю, я прям по ней иду и всё проверяю.", "confidence": 0.95}
{"start": 111.5, "end": 115.25, "speaker": "Alexandr Kovtunov", "text": "Ну, это у Кости сказалось, да, там, по поводу того, что он всё цветами.", "confidence": 0.95}
{"start": 115.25, "end": 119.0, "speaker": "Alexandr Kovtunov", "text": "Вариант тёмный, вариант маяком.", "confidence": 0.95}
{"start": 120, "end": 121, "speaker": "Alexandr Kovtunov", "text": "Окей.", "confidence": 0.99}
{"start": 136, "end": 138, "speaker": "Alexey Afanasiev", "text": "А если тогда командует, он, да, присоединился.", "confidence": 0.99}
{"start": 139, "end": 156.05, "speaker": "Dan Khasis", "text": "Давай начнём с самого горячего вопроса.", "confidence": 0.95}
{"start": 156.05, "end": 173.09, "speaker": "Dan Khasis", "text": "Facility-based remissions.", "confidence": 0.95}
{"start": 173.09, "end": 190.14, "speaker": "Dan Khasis", "text": "У нас есть клиент.", "confidence": 0.95}
{"start": 190.14, "end": 207.18, "speaker": "Dan Khasis", "text": "Клиент сейчас заходит в Pilot, мы подписываем договор на Pilot.", "confidence": 0.95}
{"start": 207.18, "end": 224.23, "speaker": "Dan Khasis", "text": "Их адвокаты нам всю кровь выпили.", "confidence": 0.95}
{"start": 224.23, "end": 241.27, "speaker": "Dan Khasis", "text": "Там 39 страниц контракта.", "confidence": 0.95}
{"start": 241.27, "end": 258.32, "speaker": "Dan Khasis", "text": "И всё выглядит, как будто бы мы выиграем этого клиента, но у них и у другого клиента потенциального есть та же проблема, о которой мы говорили за последние несколько раз, которая решена уже в RoadNet, решена уже в Декарте, что у крупных фирм есть множество географий, множество гаражей, множество складов.", "confidence": 0.95}
{"start": 258.32, "end": 275.36, "speaker": "Dan Khasis", "text": "И ситуация, то, что у них есть, у нас есть ерхическое юзер-дерево, и в этом ерхическом юзер-дереве люди на том же уровне, во-первых, не имеют права видеть, к сожалению, какой-то настройкой других людей, работу их команд.", "confidence": 0.95}
{"start": 275.36, "end": 292.41, "speaker": "Dan Khasis", "text": "То есть если у тебя есть, может быть, есть спрятанный фичер, который нигде не записан, и Игорь может нам напомнить, когда он вернется.", "confidence": 0.95}
{"start": 292.41, "end": 309.45, "speaker": "Dan Khasis", "text": "Но ситуация в том, что представьте себе, что есть фирма, там есть 400 водителей, и из 400 водителей 20 складов, значит, 20 водителей на каждый гараж.", "confidence": 0.95}
{"start": 309.45, "end": 326.5, "speaker": "Dan Khasis", "text": "И теперь получается ситуация, где в одном гараже есть два менеджера, два супервайзера, но мы не позволяем, чтобы они были как соседи друг друга, мы обязываем их быть, иметь отношение к подчиненным.", "confidence": 0.95}
{"start": 326.5, "end": 343.55, "speaker": "Dan Khasis", "text": "То есть надо делать липового юзера, липовую ноду в дереве, чтобы сделать их соседними.", "confidence": 0.95}
{"start": 343.55, "end": 360.59, "speaker": "Dan Khasis", "text": "В отличие от пролинковать их обоих к facility и сказать, что вот эти два, двое, вот это менеджер, или это route planner, или это супервайзер и так далее.", "confidence": 0.95}
{"start": 360.59, "end": 377.64, "speaker": "Dan Khasis", "text": "И потом, независимо от того, как мы пролинкуем что и так далее, эти юзера с теми промешанным уровням в том facility будут видеть все о всем, даже если все водители, потому что водители же, как дерево, не могут быть одновременно промапаны на двух юзеров, поскольку в таблице members есть только одно поле, пролинковать родительскую сущность, дочернюю сущность.", "confidence": 0.95}
{"start": 377.64, "end": 394.68, "speaker": "Dan Khasis", "text": "Нам нужно расширить функционал в как минимум двух местах, но facility в первую очередь.", "confidence": 0.95}
{"start": 394.68, "end": 411.73, "speaker": "Dan Khasis", "text": "А вторая вещь для Bloom.Net, я не хочу даже говорить без Игоря, но чтобы мы не забыли, я скажу, это связано с видеть заказы, share заказы между разными рутовыми аккаунтами через какую-то таблицу, где так файл sharing в Google Drive работает.", "confidence": 0.95}
{"start": 411.73, "end": 428.77, "speaker": "Dan Khasis", "text": "У тебя есть, ты можешь, или как там Slack, multi-workspace.", "confidence": 0.95}
{"start": 428.77, "end": 445.82, "speaker": "Dan Khasis", "text": "Ты можешь внутри одного workspace share ресурсы с другим workspace, и для них это огромная проблема отсутствия этого функционала, потому что у них есть хозяева трех-четырех магазинов, и заказчики, они могут эти заказы выполнять из четырех магазинов, цветы собирать в кучу, букет, и они не могут это делать, потому что мы показываем только заказы в одном магазине, а они могут load balancing делать, и эти заказы заполнять из многих источников.", "confidence": 0.95}
{"start": 445.82, "end": 462.86, "speaker": "Dan Khasis", "text": "Но поскольку у нас нет возможности делать sharing, значит это финальное требование BloomNet, чтобы мы закончили нахуй это все.", "confidence": 0.95}
{"start": 462.86, "end": 479.91, "speaker": "Dan Khasis", "text": "У нас есть наши peer-программисты, вы понимаете, о чем речь идет, о том, что у нас есть пеер-программисты, Я буду у экрана на 8 минут.", "confidence": 0.95}
{"start": 479.91, "end": 496.95, "speaker": "Dan Khasis", "text": "Я понял.", "confidence": 0.95}
{"start": 496.95, "end": 514.0, "speaker": "Dan Khasis", "text": "Перед тем, как я забуду, другая критическая вещь, которую мы хотим сделать в понедельник.", "confidence": 0.95}
{"start": 514.0, "end": 531.05, "speaker": "Dan Khasis", "text": "Это несложно.", "confidence": 0.95}
{"start": 531.05, "end": 548.09, "speaker": "Dan Khasis", "text": "Если нет, тогда Алексей должен сказать нет.", "confidence": 0.95}
{"start": 548.09, "end": 565.14, "speaker": "Dan Khasis", "text": "Но я не думаю, что это такая сложная вещь.", "confidence": 0.95}
{"start": 565.14, "end": 582.18, "speaker": "Dan Khasis", "text": "Я хочу вам сказать.", "confidence": 0.95}
{"start": 582.18, "end": 599.23, "speaker": "Dan Khasis", "text": "Вчера я говорил с Аланом, встретились на два с половиной часа.", "confidence": 0.95}
{"start": 599.23, "end": 616.27, "speaker": "Dan Khasis", "text": "Мы прошли, почему мы совсем все конкуренты говняные побеждают нас.", "confidence": 0.95}
{"start": 616.27, "end": 633.32, "speaker": "Dan Khasis", "text": "И технологии у нас лучше, разработчики у нас лучше.", "confidence": 0.95}
{"start": 633.32, "end": 650.36, "speaker": "Dan Khasis", "text": "В бизнесе мы дольше, чем многие, не все, но многие.", "confidence": 0.95}
{"start": 650.36, "end": 667.41, "speaker": "Dan Khasis", "text": "И мы пришли к выводу, что количество сайнапов, которые у нас есть, недостаточно высокое.", "confidence": 0.95}
{"start": 667.41, "end": 684.45, "speaker": "Dan Khasis", "text": "То, что мы оригинально думали, задумывали, когда мы запустили фирму 15-17 лет назад, это то, что мы хотели сделать как бы демократическую, прозрачную self-service подписку как Figma или как Adobe или как GitHub и так далее.", "confidence": 0.95}
{"start": 684.45, "end": 701.5, "speaker": "Dan Khasis", "text": "Но получилась такая ситуация, что психология наша была как у программистов, а психология больших крупных бизнесов как у бизнесменов.", "confidence": 0.95}
{"start": 701.5, "end": 718.55, "speaker": "Dan Khasis", "text": "И что это значит?", "confidence": 0.95}
{"start": 718.55, "end": 735.59, "speaker": "Dan Khasis", "text": "Это значит, что режим self-service и режим самоподписки – это вещь, где только возможно в малюсеньких фирмах, где есть очень мало или почти ноль change management.", "confidence": 0.95}
{"start": 735.59, "end": 752.64, "speaker": "Dan Khasis", "text": "Там есть 5-10 людей, хозяин купил, они все встретились в кофейной комнате, он им сказал новости и на следующий день все пользуются, на этом дело закончилось.", "confidence": 0.95}
{"start": 752.64, "end": 769.68, "speaker": "Dan Khasis", "text": "И эти клиенты, мы максимум с них заработаем 400 долларов в месяц.", "confidence": 0.95}
{"start": 769.68, "end": 786.73, "speaker": "Dan Khasis", "text": "Нам надо клиенты, у которых можно зарабатывать 10 тысяч долларов в месяц.", "confidence": 0.95}
{"start": 786.73, "end": 803.77, "speaker": "Dan Khasis", "text": "Те клиенты имеют много складов, много рабочих, много менеджеров, директоров, формальную команду покупок, контрактов, юридических, разных головных болей, страховок.", "confidence": 0.95}
{"start": 803.77, "end": 820.82, "speaker": "Dan Khasis", "text": "Мы хотим, чтобы ни один из наших конкурентов, особенно те, которые более крупные, и особенно те, которые чем хуже, чем более секретно они держат свои тарифы.", "confidence": 0.95}
{"start": 820.82, "end": 837.86, "speaker": "Dan Khasis", "text": "Мы хотим сделать эксперимент, начиная, потому что уже хуже нету, то есть мы записываем 10 людей в месяц, 5 людей в месяц.", "confidence": 0.95}
{"start": 837.86, "end": 854.91, "speaker": "Dan Khasis", "text": "И идея такая, на прайсинг страницы мы вырубаем прайсинг, мы оставляем структуру, мы оставляем планы, мы оставляем, я дам вам конкретику позже сегодня, мы просто заводим какой-то глобально переменной, мы вырубаем все тарифы, мы выключаем шоппинг-карт, мы выключаем фритрайл, мы прячем фритрайл, и фритрайл кнопку мы просто меняем на контакт нас, и мы эксперимент равны от 2 до 4 недель.", "confidence": 0.95}
{"start": 854.91, "end": 871.95, "speaker": "Dan Khasis", "text": "Идея в том, что каждый это говняный клиент, если им действительно это надо, они купят, если им это не надо, они должны купить или ASAP routes, которые мы с Романом Косадоевым уже закончили, и там идет финальная настройка инфраструктурных оплат, и мы просто будем посылать их на ASAP routes за 100 долларов в месяц, пошли вы к черту, чернрейт 80%, люди смеются от нас.", "confidence": 0.95}
{"start": 871.95, "end": 889.0, "speaker": "Dan Khasis", "text": "Если посмотрите, white systems, нет цен, нет фритрайла, диспетч трек, 80 миллионов в год заработки, технология ruby on rails, индусы по-первому пишут, ruby on rails, 80 миллионов, 70 миллионов доходов, их самая крупная фирма, их вложила 120 миллионов, потом нет цен, нет прайсинга, нет нихуя, потом есть этот, как их звать, route smart, их только что FedEx купил, они отменили наш контракт, потому что они купили route smart, теперь нет цен, нет тарифов, потом мы посмотрим на этот roadnet, нет цен, нет прозрачности, мы смотрим на этот daycard, нет тарифов, нет цен, нихуя нет, так что это все много говорит, а каждая фирма, которая зарабатывает меньше, чем нас, может быть, unflit столько же или меньше, q360, 360 pro или q360, вот как это называется, все имеют цену.", "confidence": 0.95}
{"start": 890, "end": 899.5, "speaker": "Alexey Afanasiev", "text": "Дэн, фактически мы переходим на сценарий демо, то есть вот то, что кнопочка была, демо, правильно, то есть все эти контакты уходят в маркетинг, маркетинг уже там решает, кому демо продукты делать, кому не делать, и таким образом фильтрует клиентов.", "confidence": 0.95}
{"start": 899.5, "end": 909.0, "speaker": "Alexey Afanasiev", "text": "Они сейчас это", "confidence": 0.95}
{"start": 909, "end": 1245, "speaker": "Dan Khasis", "text": "делают тоже, но проблема в том, что есть двойная проблема, халявчики пиздят, это первая проблема, вторая проблема, что настройки, к сожалению, мы не согласовали удачно между API командой, базоданной командой, Артема и Виталий командой, и все эти фритрайлы создавали сотни тысяч или десятки миллионов записей, которые мы не стираем, потому что мискоммуникация, так мы платим за это дрянь, и потом другая вещь это то, что у нас они видят эту цену, у нас был бывший клиент, экземплярный клиент, они были с нами три года назад, она хочет рекурринг раутинг сделать, но она хочет один раз в год делать рекурринг раутинг, она пришла, вернулась к нам, говорит, у меня там 250 маршрутов, мне нужен доступ на систему на месяц, он говорит, окей, две с половиной тысячи долларов, она говорит, какого хуя две с половиной тысячи, у тебя на веб-сайте написано 450, он говорит, смотри, на веб-сайте написано 450 за 10-20 водителей, у тебя их, во-первых, 250, а во-вторых, мы знаем, что ты уйдешь, раз мы знаем, что ты уйдешь, ты просто портишь нашу статистику, вот и все, если мы уберем цены, они не будут знать, если они получают охуительную сделку или охуительную скидку, потом pricing model, что мы какие-то слова прибавим, мы что-то дадим, вопрос, Алексей, что внутри сайта мы ничего не меняем, как у них был сабскрипт, так у них есть, но с внешней мы прячем все к чертовой матери, и потом, если они хотят что-то дешевое, мы их просто пошлем на ASAP Routes, пусть они там крахоборщик занимаются там этим, если для тех, которые не знакомы с ASAP Routes, это задумка, что вместо того, чем терять крахоборских клиентов, мы хотим их перекинуть на более дешевое приложение, которое мы управляем и контролируем, и в этом приложении всех этих малюсеньких подписчиков тогда просто перекидывать, и одновременно выбрать конкурентов Rout.XL и MyRoute.Online, мы будем давать в 10 раз больше китчей и ограничений за одну четверть или одну пятую стоимость, мне кажется, даже мы с Ромой оказались на одну восьмой, потому что мы хотели сделать как бы poison pill, чтобы они просто прогорели нахуй, а потом уже мы сможем, хотим делать, но мы с Романом поняли, что есть как бы две или три школы психологии покупателей такого типа технологии, одна это школа, которые хотят действительно один раз это использовать, они будут платить по тарифной системе, а вторая группа, которые хотят платить по ежемесячной системе, тарифные кредиты, говоря, мы будем продавать там 5 или 10 раз больше денег, чем рекурринг, потому что рекурринг есть предсказуемость, а кредиты, мы будем говорить, у вас есть это, покупай кредиты 25 центов, 20 центов за адрес, а рекурринг будет стоить 100 центов за адрес, но мы не будем предлагать эти обои типа планов на том же сайте, так у нас будет соседний сайт с другим маркетингом, но с той же технологией, с другим шаблоном и просто с другими тарифами и потом у нас будет третий сайт только для API-юзеров, где мы будем просто API продавать, чтобы постараться уничтожить конкурентов, которые только API продают и это ближе сейчас к Раутифику и к Графхопперу и так далее, и потом четвертый сайт это будет, что сейчас Вова рисует, это enterprise сайт, enterprise сайт это как бы для супер крутых клиентов, которые имеют там, я не знаю, 5000 водителей или и так далее.", "confidence": 0.78}
{"start": 1255, "end": 1258, "speaker": "Alexey Afanasiev", "text": "Процесс регистрации у нас пропадает.", "confidence": 0.99}
{"start": 1262, "end": 1284.5, "speaker": "Dan Khasis", "text": "Он не пропадает, потому что мы должны, мы обязаны продолжать им давать, когда пропал разговор, мы будем обязаны все равно им прислать ссылку на регистрацию.", "confidence": 0.95}
{"start": 1284.5, "end": 1307.0, "speaker": "Dan Khasis", "text": "Мы не имеем права ее вырубать, особенно это может сломать мобильщиков или там партнеров, для партнеров подписку тоже сломает, так мы должны просто спрятать это все.", "confidence": 0.95}
{"start": 1308, "end": 1310, "speaker": "Alexey Afanasiev", "text": "Ну, я это имел ввиду.", "confidence": 0.9}
{"start": 1310, "end": 1313, "speaker": "Dan Khasis", "text": "Да, но надо конкретно, потому что.", "confidence": 0.93}
{"start": 1315, "end": 1317, "speaker": "Vova", "text": "А free trial мы тоже прячем?", "confidence": 0.99}
{"start": 1318, "end": 1322, "speaker": "Dan Khasis", "text": "Да, no more free trials в этом эксперименте.", "confidence": 0.69}
{"start": 1327, "end": 1331.67, "speaker": "Semeyon S", "text": "А какая судьба у marketplace в этом случае?", "confidence": 0.95}
{"start": 1331.67, "end": 1336.33, "speaker": "Semeyon S", "text": "Мы оставляем его без цен.", "confidence": 0.95}
{"start": 1336.33, "end": 1341.0, "speaker": "Semeyon S", "text": "То есть оттуда тоже цены, а цены оттуда убрать в рамках эксперимента надо или потом?", "confidence": 0.95}
{"start": 1343, "end": 1346, "speaker": "Dan Khasis", "text": "В рамках эксперимента просто hide label и все.", "confidence": 0.99}
{"start": 1347, "end": 1349, "speaker": "Alexey Afanasiev", "text": "На месяц эксперимент.", "confidence": 0.77}
{"start": 1350, "end": 1410, "speaker": "Dan Khasis", "text": "От двух до четырех недель. Мы увидим интересную вещь или динамика контактных субмиссионов поднимется или все взорвется. Но взорвется так взорвется.\n\nНо я действительно подумал вчера вечером, что вот ни одна фирма, которая больше чем мы зарабатывает, не опубликовывает свои деньги. Потому что те большие фирмы, они просто напрочь не покупают. Где есть прозрачная, это очень странно.\n\nНо есть еще другая вещь, что для small бизнеса мы звучим дешевым, как бы дорогими. И они дешевые.", "confidence": 0.8}
{"start": 1418, "end": 1423, "speaker": "Alexey Afanasiev", "text": "Так вот, Саша вопрос хочет задать. Саша, по подписке, наверное.", "confidence": 0.99}
{"start": 1424, "end": 1427.17, "speaker": "Alex Shulga", "text": "Нет, на самом деле по подписке все понятно.", "confidence": 0.95}
{"start": 1427.17, "end": 1430.33, "speaker": "Alex Shulga", "text": "Дэн объяснил, что подписка остается.", "confidence": 0.95}
{"start": 1430.33, "end": 1433.5, "speaker": "Alex Shulga", "text": "Просто будет аккаунт.", "confidence": 0.95}
{"start": 1433.5, "end": 1436.67, "speaker": "Alex Shulga", "text": "Подписка будет назначаться, я так понимаю, маркетинговой командой.", "confidence": 0.95}
{"start": 1436.67, "end": 1439.83, "speaker": "Alex Shulga", "text": "У меня вопрос по поводу страницы прайсинга.", "confidence": 0.95}
{"start": 1439.83, "end": 1443.0, "speaker": "Alex Shulga", "text": "Насколько я понимаю, мы не убираем страницу прайсинга.", "confidence": 0.95}
{"start": 1444, "end": 1449, "speaker": "Dan Khasis", "text": "Меня интернет здесь выбил на минуту. Начни сначала, пожалуйста.", "confidence": 0.99}
{"start": 1451, "end": 1476, "speaker": "Alex Shulga", "text": "Вопрос насчет страницы прайсинга. Насколько я понимаю, страница сама остается. Мы просто прячем цены, но мы должны дать все еще возможность сравнивать наши пакеты.\n\nСравнивать их возможности и какие-то там маркетинговые материалы остаются. Потому что у нас же есть вот эта табличка с списком возможностей внизу.", "confidence": 0.99}
{"start": 1476, "end": 1480.25, "speaker": "Dan Khasis", "text": "Да, мы ничего не убираем.", "confidence": 0.95}
{"start": 1480.25, "end": 1484.5, "speaker": "Dan Khasis", "text": "Мы просто прячем лейбл по деньгам.", "confidence": 0.95}
{"start": 1484.5, "end": 1488.75, "speaker": "Dan Khasis", "text": "А прайсинг гайд мы или вырубаем, или прячем цены.", "confidence": 0.95}
{"start": 1488.75, "end": 1493.0, "speaker": "Dan Khasis", "text": "Просто прайсинг PDF мы модифицируем и просто цены оттуда убираем.", "confidence": 0.95}
{"start": 1498, "end": 1503, "speaker": "Alex Shulga", "text": "Теперь второй вопрос, если позволите, по поводу того, как...", "confidence": 0.99}
{"start": 1503, "end": 1509.5, "speaker": "Dan Khasis", "text": "Мы, наверное, переименуем тогда прайсинг гайд на этот...", "confidence": 0.95}
{"start": 1509.5, "end": 1516.0, "speaker": "Dan Khasis", "text": "Продукт гайд какой-нибудь.", "confidence": 0.95}
{"start": 1516.0, "end": 1522.5, "speaker": "Dan Khasis", "text": "Да, продукт гайд или feature comparison, или platform overview, или что-то такое.", "confidence": 0.95}
{"start": 1522.5, "end": 1529.0, "speaker": "Dan Khasis", "text": "Другая идея, которая у нас была с Элном, это сделать это в Америке, в Канаде, в Австралии, в Англии, а в других странах просто оставить как есть.", "confidence": 0.95}
{"start": 1529.0, "end": 1535.5, "speaker": "Dan Khasis", "text": "Потому что мы все равно не будем ничего им продавать.", "confidence": 0.95}
{"start": 1535.5, "end": 1542.0, "speaker": "Dan Khasis", "text": "Если они хотят платить деньги, пусть платят деньги.", "confidence": 0.95}
{"start": 1542.0, "end": 1548.5, "speaker": "Alexey Afanasiev", "text": "Нет, там просто if-стейтменты идут, что если страна такая, то делать так.", "confidence": 0.95}
{"start": 1548.5, "end": 1555.0, "speaker": "Dan Khasis", "text": "Если страна и флаг такой, то делать так.", "confidence": 0.95}
{"start": 1561, "end": 1570.0, "speaker": "Alex Shulga", "text": "Если позволите, еще продолжение вопросов.", "confidence": 0.95}
{"start": 1570.0, "end": 1579.0, "speaker": "Alex Shulga", "text": "Самостоятельная регистрация, насколько я понимаю, вот Эдэн сказал, мы контактас сделаем с маркетинговой командой, и потом маркетинговая команда потом присылает ссылку на регистрацию этому клиенту.", "confidence": 0.95}
{"start": 1579.0, "end": 1588.0, "speaker": "Alex Shulga", "text": "Я просто хотел понять, у нас, насколько я понимаю, такого нет еще.", "confidence": 0.95}
{"start": 1589, "end": 1590, "speaker": "Dan Khasis", "text": "Что у нас нет?", "confidence": 0.93}
{"start": 1591, "end": 1599, "speaker": "Alex Shulga", "text": "У нас ситуация, когда маркетинговая команда может прислать индивидуальную ссылку на регистрацию.", "confidence": 0.88}
{"start": 1599, "end": 1602.25, "speaker": "Dan Khasis", "text": "Она не индивидуальная, она не индивидуальная.", "confidence": 0.95}
{"start": 1602.25, "end": 1605.5, "speaker": "Alex Shulga", "text": "Она один в один, как сейчас есть.", "confidence": 0.95}
{"start": 1605.5, "end": 1608.75, "speaker": "Dan Khasis", "text": "Просто публикли никто не будет видеть это.", "confidence": 0.95}
{"start": 1608.75, "end": 1612.0, "speaker": "Dan Khasis", "text": "И мы выключим его из роботов.", "confidence": 0.95}
{"start": 1613, "end": 1634, "speaker": "Alex Shulga", "text": "Окей. И последний вопрос. У нас сейчас есть ограничения на страны, для которых доступна самостоятельная регистрация.\n\nПравильно ли я понимаю, что это нас в принципе не волнует сейчас, потому что все регистрации, которые будут пропускаться маркетинговой командой, все равно будут из разрешенных стран, так?", "confidence": 0.99}
{"start": 1635, "end": 1635, "speaker": "Dan Khasis", "text": "Да.", "confidence": 0.69}
{"start": 1635, "end": 1636, "speaker": "Dan Khasis", "text": "Понял, спасибо.", "confidence": 0.85}
{"start": 1639, "end": 1650, "speaker": "Dan Khasis", "text": "А что если мы сделаем все страны под этим же? Вот если мы расширим тот список на все страны, включая Америку, тогда что будет?", "confidence": 0.99}
{"start": 1654, "end": 1659, "speaker": "Alexey Afanasiev", "text": "Да, у нас пропадет кнопка Try Now, по идее.", "confidence": 0.99}
{"start": 1660, "end": 1668, "speaker": "Dan Khasis", "text": "Да, но когда вы говорите, что мы не поддерживаем, что это значит? Это значит, что там error или ты знаешь, что они не видят эту кнопку?", "confidence": 0.99}
{"start": 1669, "end": 1672, "speaker": "Alexey Afanasiev", "text": "Не видят, не видят.", "confidence": 0.75}
{"start": 1672, "end": 1676, "speaker": "Dan Khasis", "text": "Как это отличается тогда от моей просьбы, если это звучит одинаково?", "confidence": 0.99}
{"start": 1677, "end": 1680, "speaker": "Alexey Afanasiev", "text": "Ну, цены-то будут, там кнопка пропадет.", "confidence": 0.99}
{"start": 1680, "end": 1687, "speaker": "Dan Khasis", "text": "Может быть, тот массив или объект надо более детально описать и сделать.", "confidence": 0.95}
{"start": 1688, "end": 1691, "speaker": "Alexey Afanasiev", "text": "Смешная задача, поэтому понятно.", "confidence": 0.85}
{"start": 1691, "end": 1695.33, "speaker": "Dan Khasis", "text": "Сделать просто еще один флаг, что Show Public Pricing.", "confidence": 0.95}
{"start": 1695.33, "end": 1699.67, "speaker": "Dan Khasis", "text": "Если все страны поставить True, а в этих странах поставить False.", "confidence": 0.95}
{"start": 1699.67, "end": 1704.0, "speaker": "Dan Khasis", "text": "Например, Америка, Канада и так далее.", "confidence": 0.95}
{"start": 1713, "end": 1724, "speaker": "Semeyon S", "text": "Насчет, если это обсудили, мне кажется, к фасилити с НАТО вернуться. Александр Ковтунов, ты можешь дать комментарий по поводу связей?", "confidence": 0.99}
{"start": 1726, "end": 1734, "speaker": "Alexandr Kovtunov", "text": "Насчет таблицы связи, да, она есть, где мы можем связывать различные сущности с этими сентити.", "confidence": 0.99}
{"start": 1735, "end": 1744, "speaker": "Alexandr Kovtunov", "text": "Что касается работы с пользователями, с мембраной с иерархией, с доступами, я не уверен.", "confidence": 0.99}
{"start": 1745, "end": 1759.5, "speaker": "Dan Khasis", "text": "Я думаю, что ты не понял до конца задачу, потому что у нас есть уже функционал на текущий момент, на сегодняшний день, который позволяет линковать Vehicle к фасилити и User к фасилити.", "confidence": 0.95}
{"start": 1759.5, "end": 1774.0, "speaker": "Dan Khasis", "text": "У нас же есть, мне казалось, что у нас есть линковка User к фасилити.", "confidence": 0.95}
{"start": 1775, "end": 1779, "speaker": "Alexandr Kovtunov", "text": "Не только User, то есть это может быть Order и Route.", "confidence": 0.99}
{"start": 1783, "end": 1785, "speaker": "Dan Khasis", "text": "Сейчас говоришь насчет Attribution?", "confidence": 0.99}
{"start": 1790, "end": 1803, "speaker": "Alexandr Kovtunov", "text": "Не уверен. Ну, Entity Types, если так, то еще API. То есть это таблица связи, грубо говоря, где там можно сказать, что вот к какой-то Entity.", "confidence": 0.95}
{"start": 1803, "end": 1815.75, "speaker": "Dan Khasis", "text": "Да, так это не Attribution, это правильно, это полноценная линковка.", "confidence": 0.95}
{"start": 1815.75, "end": 1828.5, "speaker": "Dan Khasis", "text": "И теперь надо в этой сессии расширить и в statement, в case, и этот in clause сделать еще один subquery, что или человек, дочерний юзер, или человек, такой роль имеет к этим фасилити, и вот этот ресурс является ресурсом того фасилити.", "confidence": 0.95}
{"start": 1828.5, "end": 1841.25, "speaker": "Dan Khasis", "text": "Мы просто меняем in clause на то дерево, чтобы она была не MemberIdIn, там какой-то список и RouteMemberIdRoman такой-то.", "confidence": 0.95}
{"start": 1841.25, "end": 1854.0, "speaker": "Dan Khasis", "text": "Мы пишем OR MemberIdIn и вытаскиваем список всех мембров в том фасилити.", "confidence": 0.95}
{"start": 1854.0, "end": 1866.75, "speaker": "Dan Khasis", "text": "И здесь UI сломан.", "confidence": 0.95}
{"start": 1866.75, "end": 1879.5, "speaker": "Dan Khasis", "text": "Отступ, левый отступ от ManageOptimizationProfiles, AssignFacilities, AddFields все нарушены, должны двигаться от 10 до 30 пикселей направо.", "confidence": 0.95}
{"start": 1879.5, "end": 1892.25, "speaker": "Dan Khasis", "text": "ManageOptimizationProfiles вертикальный отступ нарушен еще больше.", "confidence": 0.95}
{"start": 1892.25, "end": 1905.0, "speaker": "Dan Khasis", "text": "AssignFacilities полностью по-другому выглядит.", "confidence": 0.95}
{"start": 1908, "end": 1913.6, "speaker": "Semeyon S", "text": "По сравнению с чем у нас почти везде табличка?", "confidence": 0.95}
{"start": 1913.6, "end": 1919.2, "speaker": "Semeyon S", "text": "Дистанция разная.", "confidence": 0.95}
{"start": 1919.2, "end": 1924.8, "speaker": "Vova", "text": "А, да.", "confidence": 0.95}
{"start": 1924.8, "end": 1930.4, "speaker": "Semeyon S", "text": "Иконку предлагает поровнять по началу лейбла внутри.", "confidence": 0.95}
{"start": 1930.4, "end": 1936.0, "speaker": "Semeyon S", "text": "Окей, пофиксим.", "confidence": 0.95}
{"start": 1936.0, "end": 1941.6, "speaker": "Semeyon S", "text": "Дэн, я правильно понимаю, что вот эта линковка это высокоприоритетная сейчас задача, потому что у нас два клиента заходят, крупных.", "confidence": 0.95}
{"start": 1941.6, "end": 1947.2, "speaker": "Semeyon S", "text": "Линковка, насколько я понимаю, у нас есть.", "confidence": 0.95}
{"start": 1947.2, "end": 1952.8, "speaker": "Vova", "text": "У нас не хватает ограничения визибилити.", "confidence": 0.95}
{"start": 1952.8, "end": 1958.4, "speaker": "Vova", "text": "У вас же двое прав.", "confidence": 0.95}
{"start": 1958.4, "end": 1964.0, "speaker": "Semeyon S", "text": "Окей, но задача все равно высокоприоритетная, вот это главное.", "confidence": 0.95}
{"start": 1965, "end": 1966, "speaker": "Semeyon S", "text": "Я просто хочу, чтобы ребята услышали.", "confidence": 0.99}
{"start": 1966, "end": 1966, "speaker": "Semeyon S", "text": "Да, да.", "confidence": 0.65}
{"start": 1968, "end": 1971, "speaker": "Dan Khasis", "text": "На API, на сессии, на SessionManagement и на InformationManagement.", "confidence": 0.99}
{"start": 1972, "end": 1982, "speaker": "Alexandr Kovtunov", "text": "Я правильно понимаю, что мы должны опираться не на иерархию, а на связь с определенной фасилити?", "confidence": 0.97}
{"start": 1982, "end": 1995, "speaker": "Dan Khasis", "text": "Нет, мы не должны опираться на нее, мы должны прибавить ее, а то ты сломаешь все всем сразу.", "confidence": 0.53}
{"start": 1997, "end": 2061, "speaker": "Alex Shulga", "text": "Если можно, я хотел бы уточнить пару моментов. Значит, сейчас у нас, первое, аккаунты различаются потому, что есть фича FacilityView, и если эта FacilityView фича включена, то мы считаем, что у аккаунта скоп видимости ограничен Facility, то есть все пользователи видят все виклы, связанные с определенным Facility. Насколько я понимаю, мы хотим сейчас добавить ту же самую логику в TeamManagement, то есть если есть Facility на аккаунте, если включена фича FacilityView, то пользователь, например, администратор, он будет все равно иметь иерархию и под ним будут пользователи, например, драйвер, и этот администратор будет видеть драйвера из своей Facility, но при этом не будет видеть, соответственно, драйвера из другой Facility, так?", "confidence": 0.99}
{"start": 2062, "end": 2282.5, "speaker": "Dan Khasis", "text": "Не совсем, почти, но не совсем.", "confidence": 0.95}
{"start": 2282.5, "end": 2503.0, "speaker": "Dan Khasis", "text": "Нам не надо переусложнять это, я могу, будьте рады на секунду, я могу описать другими, я, мне кажется, даже описывал это раньше, нарочно в это, как бы, при увеличенном рассказе то, что если, если у тебя есть, ты там ведущий мафиозник Европы, у тебя есть разные области, в каждом области, в области у тебя есть разные эти капитаны, в итальянской мафии, например, и эти капитаны под ними имеют команду, под командой там есть разные свои эти рабочие, под рабочими есть разные, у разного уровня этих рабочих, те, которые продают, те, которые покупают, те, которые воруют, и потом они приносят им деньги, другие берут деньги от многих и дают одному главному, потом есть тот, который эти деньги чистит, третьему, у них есть система иерархическая, но если там есть ведущий мафиозник, например, в Праге, и там в Праге есть 5 районов, он будет видеть в его дешборде все районы Прага, и как они, какой эффект они имеют на доходы, какой перформанс, там столько-то спизденных машин, столько-то проданных контрабанды, столько-то чего-то другого пакостного, но потом есть чувак, который ответственный за географию, всю Прагу, и он должен видеть всех чуваков из всех районов, то есть там могут быть 5 капитанов, которые каждый ответственный за 5 районов, но этот чувак ответственный за всю географию Праги, так он будет видеть 5 на 5, то есть в 1 группе он будет видеть, в каждой группе будет видеть капитана и 5 подчиненных, капитана и 5 подчиненных, и потом есть другой чувак, который ответственный за всю Европу, там есть 10 стран, и в каждой стране, в зависимости от размера страны есть своя структура теперь получается вот ситуация то что иногда если они не хотят чтобы чувак из второго района в прага не видел что делает в первом районе прага потому что может быть он станет это завидовать что другой чувак зарабатывает больше или он найдет что там хорошее место где пиздить что-то на границе и у их двоих районов и начнется конкурентство кто-то кого-то там это грохнет так это так как капитан видит все так на капитана пролинковано 5 facilities или 5 сабьюзеров и то и то будет работать сейчас уже работает потому что него будет 5 этих сабьюзеров но что если чувак который главный прага понимает что один из этих пять капитанов один может попасть в тюрьму один может его кто-то шлепнет там и 3 пропадет 4 хочет ехать в отпуск так ему нужно иметь два или двух или трех резервных чуваков которые постоянно видят постоянно тренируются или на замену или на подстраховку так теперь вы представьте что возни 5 капитанов 5 капитанов каждой группе 5 чуваков но еще есть 2 или 3 резервных капитана но мы же не можем на них назначить поскольку наша 30 структура не позволяет множество родительских сущностей ты не можешь водителя из 5 группы ассайднуть на капитана 6 или водителя 4 группы дважды ассайн это капитана 7 но ты все равно хочешь сделать так чтобы 6 чтобы 6 и 7 капитан видел что происходит 4 и 5 группе или 1 и 3 группе потому что они резервные лица как депюти в тех регионах и даже если ты сделаешь кто-то скажет а давай его сделаем дочерним юзером 1 3 капитана это тоже не поможет почему потому что они не смогут все равно быть в двух местах одновременно в базе данной во вторая причина потому что если грохнуть первого капитана он теперь дочерняя сущность не существующего юзера и все дерево ломается так мы должны в нашей сессии сэшен менеджмент логики и логики модифицировать код чтобы у нас не было проверка только на существование дочерних или родительских отношений но еще прибавить орк инвешен что если этот человек пролинкован какому-то фасилите тогда тот человек автоматически получает видимость или доступ на ресурсы которые существуют другого типа ресурсы которые существуют в том фасилите значит что это значит если он водитель и он пролинкован к множеству фасилите он может быть будет видеть заказы но он не был или да он будет видеть свои маршруты но что фасилите но ничего другого если он рад пленнер или рад менеджер по умолчанию мы показываем у всех водителей значит он будет видеть всех водителей и так далее если бы он был у него есть флаг рейд он ли это к это экземпляр резервного человека где он видит все но ничего не можешь модифицировать у нас такой флаг тоже есть это на это никак не влияет просто уровень доступа должен совпадать с роль ролью если это analyst он будет иметь право анализировать например performance трех трех фасилитетов то есть мы должны пройтись через наше юзеров и и на этом дело закончится нам надо просто поменять этот инклоз я боюсь показаться", "confidence": 0.95}
{"start": 2503, "end": 2548, "speaker": "Alex Shulga", "text": "не очень понимающим человеком но я вот можно быть неправильно интерпретирую значит у нас есть вот иерархия пользователей да есть owner и его сабы и вот например у этого саба это facility 1 да и у нас есть facility 2 у которой тоже есть какая-то иерархия мы можем атрибутировать значит администратора из facility 1 добавить ему facility 2 и у него сков видимости расширится и он сможет увидеть еще сабов всех из другой facility даже которые напрямую не являются его сабами", "confidence": 0.99}
{"start": 2548, "end": 2581, "speaker": "Dan Khasis", "text": "правильно но в этом случае здесь друг ситуация немножко хитрая потому что ты выбрал как бы козырную карту администратор это это все всегда должен видеть все независимо от яхи и более правильный экземпляр вы это выбрать regional manager например но это открывает другой вопрос что у нас нету у нас нету роли почему-то на facility менеджер хотя было бы хорошо иметь facility", "confidence": 0.9}
{"start": 2581, "end": 2608, "speaker": "Alex Shulga", "text": "менеджер или regional или там что-то такого типа ну если можно я тогда просто продолжу понимание свое да значит у нас расширяется сков видимости и у этого regional менеджера у него нет непосредственных сабов из facility 2 вот они сабы из facility 2 каким образом значит он сможет их редактировать", "confidence": 0.85}
{"start": 2608, "end": 2623, "speaker": "Dan Khasis", "text": "да то есть вот этот опять это хитрый вопрос все зависит на настройки если его настройка пишет что его аккаунт не read only значит он не может их редактировать но если его настройка он не read only", "confidence": 0.95}
{"start": 2623, "end": 2665, "speaker": "Alex Shulga", "text": "да но у него нет непосредственных сабов из этой facility из facility 2 а как мы тогда поймем кого он может редактировать а кого не может значит ли это что regional менеджеры могут редактировать всех драйверов вне зависимости от того кто фактически является их сабами достаточно просто проверить что роль regional менеджера старше роли драйвера и у этого regional менеджера есть атрибуция facility 1 и facility 2 и тогда я бы сказал что да это звучит это звучит правильно понял спасибо", "confidence": 0.86}
{"start": 2668, "end": 2684, "speaker": "Dan Khasis", "text": "просто я вам рассказываю то чтобы у вас не был сюрпризов мы все равно без игры не сможем это не сможем сделать так я рекомендую что теперь вы поняли все и потом мы просто поднимется запрос", "confidence": 0.98}
{"start": 2684, "end": 2703, "speaker": "Kateryna Shevchenko", "text": "первым только он вернется понял спасибо большое за объяснение когда наверно можем перейти к демо по мобильным проектам или еще какие-то может быть здесь остались так мы на вебе ничего не", "confidence": 0.95}
{"start": 2703, "end": 2711, "speaker": "Dan Khasis", "text": "обсудили вообще кроме вот этих бугре горячих вещей хорошо или у вас есть какие-то бд это", "confidence": 0.85}
{"start": 2711, "end": 2881, "speaker": "Vova", "text": "семен я хотел еще спросить про facility selector пока мы не шли далеко а да что ты думаешь если мы его разместим вот здесь и это будет multiple choice который позволяет либо выбрать все либо какую-то часть либо один и это будет глобально распространяться на все страницы я побежде должен это открыть должен открыть экран алексей если мы data retention сначала покажем потом мобилочки что лично говоря немножко удивлен что у нас data retention в конце или в этом есть какой-то смысл меня перебили я так и хотел попросить алексей что мы сейчас дата retention но окей сейчас этот мелкий вопрос закроется показываю не не не подожди секунду закрывается экран грузится грузится ок на что мы смотрим я предлагаю разместить facility selector рядом с логотипом road for me прямо на самом верхнем уровне в глобал хейтере таким образом чтобы он распространялся на все страницы когда ты смотришь то есть неважно куда ты смотришь он будет на", "confidence": 0.19}
{"start": 2881, "end": 2892, "speaker": "Dan Khasis", "text": "самом самом верхнем уровне давай увидим как это будет выглядеть нарисую что-то да да конечно я", "confidence": 0.85}
{"start": 2892, "end": 2911, "speaker": "Vova", "text": "просто хотел с тобой закрыть сразу что уходит на верхний самый верхний уровень но и вова а почему ты не хочешь в онлайн с тайтлом сюда на этот уровень потому что он над тайтлом по уровню", "confidence": 0.92}
{"start": 2911, "end": 2969, "speaker": "Dan Khasis", "text": "по идее да я покажу экран прямо сейчас как делает вот эта фирма ведущая которая кстати акции поднялись на 100 процентов за почти за последние шесть месяцев вот если посмотреть здесь вот это facility 7 вот это список facilities ты можешь кликнуть дом и вот так и ты наводишь мышку хуяк видно моментально все эти всякая все финды из всех машин всех водителей 1 статус ты можешь видеть сразу все силите сразу или здесь ты можешь видеть сайт менеджер может быть нам надо поменять facility и сделать новый дашборд не фасилите из не фасилите настройки например", "confidence": 0.84}
{"start": 2976, "end": 2998, "speaker": "Semeyon S", "text": "настройки надо там отделять как в прошлый раз разговаривали да окей у нас по веб и у ай сегодня показывать немного но мы сейчас даты ретеншин хотим показать а потом дать эфир мобильной", "confidence": 0.68}
{"start": 3000, "end": 3266, "speaker": "Dan Khasis", "text": "команде окей вот я хочу просто показать здесь вот я думаю нам надо сделать копию этой страницы который будет называться сайт менеджер потому что теперь кстати насчет организации заметьте что у них есть организация и вот вот это одна из наших проблем что у нас сейчас редактор организации в админ панели это делаешь множество организации в принципе это организация группа и в ней может быть множество организации они все могут быть blue net принадлежат и потом у них множество рутовых аккаунтов уже это уже есть но что нас нету это видимости в фронт-энде на на твоей организации потому что в принципе если я супер администратор организации как вова сказал я должен в любую секунду как здесь выйти на любой на любой сайт на любой фасилите который выше меня соединены даже сайты вот у меня например вот я сделал в пн маленький что вот этот соединяется к этому и здесь есть она описывает это и потом centralize multi-сайт менеджмент клыки рекорда рейшен так я сделал организацию теперь сайт менеджер показывает мне все все вещи в том сайте сайт менеджер и вот теперь я вижу все мои фасилити здесь не настройки это viewer и мы видим какие у меня включены и давайте думать даже насчет subscription что вот в этой в этом организации у меня коммерческие машины а в этом нету лицензии на коммерческий в этом есть extended support premium support вишня как у них есть прямо встроена активит активит активит менедж субскрипцию хуяк и кликнул и поехала я плачу за этот прибор вот это субскрипцию какой субскрипцию то cyber secure и вот инвойсы есть и так далее получается что они люди видят весь функционал который я могу купить в отличие от нас мы не показываем весь функционал прямо пить потом есть critical events например сколько маршрутов отстают и я кликаю на это у меня лежал интернет дофига времени и она пишет мне что вот severity супер красные такая-то дата я могу сбросить градусник и вот теперь ушел severity фильтр их activity feed выглядит поселили более цивилизованной чем наш глобальной но тем не менее вот вот этот есть лог кто не мог кликнуть просматривать лог но если вернуться назад на сайт менеджер представьте у них есть два вида у них есть вид такой и это может показать например текущий прогресс работы рабочей силы опозданий заказов чего они выберут большинство бизнеса будет иметь скажем 5 таких максимум но какой-то но но какие-то крупные ребята как мягкий или будут иметь 70 и у них по умолчанию будет table view потому что кто будет показывать 70 таким режим никак и потом какие-то фича прыгнет на network прыгали на protection кликни на настройки и когда ты кликаешь это настройки facility например и открывается настройка facility и теперь ты видишь по категоризации какие настройки интеграции backup и storage кстати насчет backup of и storage мы можем сейчас мы не будем делать но в принципе ты можешь делать куда replication твоих логов ты хочешь посылать на динамо google storage когда ты хочешь это делать и так далее и вот оба или по уведомления", "confidence": 0.84}
{"start": 3266, "end": 3318, "speaker": "Semeyon S", "text": "кто это хочет получать и почему ты хочешь получать я момент один не уловил вот если у нас большая компания holding допустим 5 7 организаций там facility смогут пересекаться или мы просто их дублируем у себя внутри разных организаций не заморачиваемся что-то между дублируем ну просто раз это разные записи базе данных но физически это одно и то же место что разные организации это получается у нас это разные аккаунты верно это разные аккаунтов это в нашем смысле наши фирмы", "confidence": 0.9}
{"start": 3318, "end": 3359, "speaker": "Dan Khasis", "text": "организация является как бы группа крутовых аккаунтов а на 3 на ком будет стать админ панель там аккаунтов нарти будет да нет там не будет типа там нет и полноценного юзера для организации там есть сейчас там есть другая админ панель с другими другим спи регистром сессии сессиян менеджмента не наш главный а в общем у нас сейчас сейчас у нас верхней ирак и юзеров", "confidence": 0.42}
{"start": 3359, "end": 3380, "speaker": "Vova", "text": "это аккаунт owner и мы хотим добавить еще одного сверху уровень организаций на owner и этот организаций на owner он будет у себя иметь дополнительную страничку на которой он сможет увидеть все аккаунты одновременно и дальше в любое где с федексом у федекса было блять", "confidence": 0.95}
{"start": 3381, "end": 3393, "speaker": "Dan Khasis", "text": "50 или 60 аккаунтов на каждый склад потому что у нас отсутствовал функционал facility matching так они создавали один root аккаунт для каждого facility но теперь у нас будет", "confidence": 0.83}
{"start": 3393, "end": 3434, "speaker": "Vova", "text": "facilities и то есть у нас будет как бы иерархия теперь то что для то ради чего мы до сих пор создавали разные аккаунты теперь мы сможем менеджерить в рамках одного аккаунта просто превратить это в facility но компании побольше для них может понадобиться все равно facility и нескольких разных аккаунта и для них мы сделаем этот дополнительный уровень то есть будет два дашборда один дашборд для аккаунт owner которым он видит все facility с птичьего полета а второй для organization owner на котором он видит все аккаунт с птичьего полета", "confidence": 0.84}
{"start": 3434, "end": 3520, "speaker": "Dan Khasis", "text": "ну вот это вот это идеальный экземпляр видишь вот это все facilities ты кликаешь сайт менеджер но ты можешь создать организацию и потом здесь ты видишь я задел мне кажется я сделал организацию даже без если ее найти мне казалось ее сейчас кликнем на нее снова create organization и ты еще можешь выбрать identity source как люди могут логинуться в эту организацию я выберу no sso provider setup вещь теперь они тебе дадут как и мы сейчас даем кстати правильно у нас же есть урал форме там блумная дат раутс инк даткам или бруно дат раутс порт даткам и вот они это и они дают дают вот это возможность они вытащили ее из бакенда и просто дают чуваку возможность создать вот это только без всех этих вопросов только с тремя вопросами имя саб домен имел адрес организационного администратора и списка существующих юзеров нам не нужно сейчас организации это просто понятно это на будущее", "confidence": 0.8}
{"start": 3520, "end": 3525, "speaker": "Dan Khasis", "text": "сейчас главное сфасили тесть потому что сейчас получается ситуация что я дам ситуацию вам что", "confidence": 0.85}
{"start": 3525, "end": 3593, "speaker": "Dan Khasis", "text": "у тебя у вас есть если я возьму организацию blue net например и вот есть blue net организация вот я клик на нее четвертая организация я бы хотел видеть все маршруты все заказы все эти всех водителей все все мембер здесь например мембер здесь 25 тысяч я не понимаю как это возможно они все делиты дали чтобы мы ничего не стираем очень странно но вот у меня нет мембер есть ну теперь представьте что у вас есть множество аккаунтов вы не вы не можете в одном месте", "confidence": 0.58}
{"start": 3593, "end": 3619, "speaker": "Dan Khasis", "text": "ничего видеть окей то есть большая часть функционала уже есть вот что касается организатор просто сделать эти элементарные линковки линковки и там уже можно будет на фронтенд вытаскивать конечно вопрос немножко в сторону но почему api такой длинный потому что шат 256 это глоба это ключ", "confidence": 0.9}
{"start": 3619, "end": 3817, "speaker": "Dan Khasis", "text": "который позволяет этому организацию супер администратору делать что он хочет как он хочет когда он хочет со всеми любыми дочерними рут аккаунтами ошибка здесь что в том что он в плейнтексте путается как не ахуеть делать как как нюансы странно да как нюдест спасибо понял и кстати вежливость если есть чанал early access ты можешь модифицировать если мы возвращаемся назад к постоянных споров насчет почему вещи не видны людям в меню потому что если бы они у нас мы бы сделали полноценные настройки где у них было релиз виллабилити офишал и скейт early access вы бы настроили для интересованных лиц early access и у них бы начиналось появляться все вещи как ордер из новая или там кастовый location так далее как вы видели на предыдущей демонстрации с одну секунду это уходит и становится контакт нас нам надо посмотреть если хаб спад позволяет заливать файлы если да мы хотим чтобы включить чтобы они могли залить файл их текущих мусор маршрутов если нет тогда нет почему мы хотим это сделать посмотрите у них был какой-то здесь upload а вот видишь фикси routes и не могут залить они могли залить сюда файл мне кажется после покупки федексом они это выключили но окей так короче так мы этими сайны наставляется остается прайсинг меняется слово на что-то другое мы вам скажем еще внутри сайны нужно брать", "confidence": 0.51}
{"start": 3817, "end": 3917, "speaker": "Semeyon S", "text": "вкладку крит нью аккаунт да это надо будет по всему продукту пройтись и даже по саппорту наверняка еще где-то забыли про цены и так далее на саппорте цен точно нигде нету специальных никогда не ставили но мы перепроверим но там хорошо дата ретеншин сейчас секунду здесь мы", "confidence": 0.15}
{"start": 3917, "end": 3964, "speaker": "Dan Khasis", "text": "берем крейсер на кампер при мне опять мы эту страницу регистра и мы ее там там баг кстати а не странно очень пока мы убираем цены здесь потом это меняется на лов ты можешь правильно", "confidence": 0.22}
{"start": 3964, "end": 3980, "speaker": "Alexey Afanasiev", "text": "сегодня вот поднять эти блоки чтобы кнопочки у нас на одном уровне вот эти вот остались как-то придумать а мы не мы не хотим оставить одну только кнопку контакт а с которая будет наверху", "confidence": 0.85}
{"start": 3980, "end": 3988, "speaker": "Dan Khasis", "text": "зачем ее дублировать мы можем здесь поставить контакт ас это ты уже решай как если ты красиво", "confidence": 0.85}
{"start": 3988, "end": 3994, "speaker": "Dan Khasis", "text": "сделаешь потому что это просто будет если мы напишем здесь контакт ас здесь контакт ас это", "confidence": 0.85}
{"start": 3994, "end": 4113, "speaker": "Vova", "text": "будет 4 кнопки контакт ас я понимаю так ты окей так если ты нарисуешь вова у тебя и табы тут отвалятся тут есть над чем подумать на минутку кнопку воткнуть у меня все готово в общем текст плейбл заменять хорошо заголовком надо подумать мы бы дадим вам одну секунду и в любом", "confidence": 0.06}
{"start": 4113, "end": 4161, "speaker": "Dan Khasis", "text": "месте где написано цены мы будем писать ok хорошо тогда переходим на", "confidence": 0.16}
{"start": 4163, "end": 4231, "speaker": "Alexey Gusentsov", "text": "руник и дэйта да привет еще раз так значит что у нас теперь на страничку новая значит будет две вкладки current usage и usage history сейчас мы имплементировали current usage значит табличка внизу график собственно с тратами на конкретный день и тополы по поводу табли по поводу графика график еще будет вот такая тогла здесь шел кумулятив и он будет показывать там суммы с там с предыдущих дней условно нараст по нарастающий вот это тоже в следующий раз это дело к следующей версии точнее как-то так что еще табличкам а табличками не показывали ну как как ты хотел мы поменяли собственно ее внешний вид с этими с current cost и forecasted cost и billable вынесли totally добавили totally здесь и здесь за эти самые forecasted которые предикты", "confidence": 0.83}
{"start": 4231, "end": 4246, "speaker": "Dan Khasis", "text": "называются вот last update сюда перекочевал почему и как мы делаем вот это и вот это как мы", "confidence": 0.85}
{"start": 4246, "end": 4262, "speaker": "Dan Khasis", "text": "это делаем в чем это делает я ответ на этот вопрос дать не смогу я но эти данные приходят бэкэнда вот как бы кант высчитывает я затрудняюсь ответить это должно было быть сравнение с", "confidence": 0.85}
{"start": 4262, "end": 4270, "speaker": "Dan Khasis", "text": "прошлым периодом такой же да то есть вот это я не я спрашиваю кто это делает и почему", "confidence": 0.85}
{"start": 4270, "end": 4280, "speaker": "Dan Khasis", "text": "спрашиваю спрашиваю кто то генерирует эти цифры артем предполагаю что бы кант ну в смысле", "confidence": 0.9}
{"start": 4280, "end": 4304, "speaker": "Semeyon S", "text": "как александр ковтунов кто запишечку отвечает от ретеншона или телек сей подскажем он это кто дима напрямую минуя артема уверен", "confidence": 0.95}
{"start": 4309, "end": 4336, "speaker": "Dan Khasis", "text": "у вас не может быть этих аналитик потому что у вас мы стираем данные только из биквери я просто удивлен что это здесь есть я бы я бы не хотел даже показывать первую версию я не верю что это правильно я не удивлен что там есть это выглядит красиво но здесь не показан полный", "confidence": 0.95}
{"start": 4336, "end": 4360, "speaker": "Vova", "text": "билин цикл да у нас билин цикл 30 дней должен быть интервал 30 дней мы должны показывать целыми циклами то есть за текущий билин цикл ты должен 5 евро к концу цикла предположительно ты будешь должен 11 евро мы должны показать весь цикл а не часть я не всем понял это ко мне вопрос или", "confidence": 0.68}
{"start": 4360, "end": 4390, "speaker": "Alexey Gusentsov", "text": "ну просто так и есть но если правильно логику то я так и сделал нет нет здесь просто дата не конец цикла здесь же дата должна быть сегодняшняя сегодняшняя дата сегодняшняя дата у нас 10 июля соответственно после 10 июля мы не знаем что может быть поэтому мы можем показывать total cost с начала биллинга до текущей даты а начало билинга до конца билинга это предикт это форкаст вот она может быть это и правда может быть это и правильно да так же google делает юсаж", "confidence": 0.95}
{"start": 4390, "end": 4410, "speaker": "Dan Khasis", "text": "month и invoice month и invoice month это будет август а юсаж month это будет июль к нам дмитрий подключился", "confidence": 0.85}
{"start": 4410, "end": 4430, "speaker": "Semeyon S", "text": "папишечки он нам сможет ответить на вопрос плюс сейчас тут артема позвал тоже надеюсь присоединиться дмитрий ливадный можешь объяснить вот откуда у нас берутся вот эти тренды 50 процентов минус 21", "confidence": 0.99}
{"start": 4430, "end": 4482, "speaker": "Dmitry Lyubetsky", "text": "процент откуда они берутся как считается да привет так если вот то где сейчас курсор находится да то есть здесь мы смотрим на billing период вот и смотрим на старт billing периода например там если он стартовал с третьего числа и сегодня 15 число мы мы смотрим вот это вот рендж с 1 по 15 в этом месяце и сравниваем с данными которые были с 1 по 15 в прошлом месяце и собственно вот это разница здесь и отображается в деньгах и в процентах я так", "confidence": 0.82}
{"start": 4482, "end": 4487, "speaker": "Alexey Gusentsov", "text": "понимаю вопрос данный был наверное откуда берутся в плане там из быквари если я правильно понял", "confidence": 0.99}
{"start": 4487, "end": 4568, "speaker": "Dmitry Lyubetsky", "text": "вопрос а ну да если такой просто да собственно мы делаем запросы быквария и получаем billable units вот за определенный range и считаем ну как бы перемножаем на стоимость за билбол вот и получаем собственно сумму и сравниваем как вы умудряете сделать это если у вас не этих данных нигде нету мосикули но у нас есть данные в быкварии за каждый день у нас есть billable units которые были использованы то есть где у нас это есть в таблице paid storage daily log в быкварии в нее пишет артем как раз таки как он туда пишет это наверное к нему опрос но насколько я видел и собственно знаю интегрировал билбол юниты на каждый", "confidence": 0.63}
{"start": 4568, "end": 4592, "speaker": "Vova", "text": "день рассчитан мы храним только суммы сами сами сами данные мы не храним мы храним только", "confidence": 0.22}
{"start": 4592, "end": 4613, "speaker": "Dmitry Lyubetsky", "text": "историю биллинга сколько историю юзача ну да то есть вот именно юзач в формате билбол юнитов на каждый день а собственно уже в доллары мы пересчитываем при выводе так скажем", "confidence": 0.95}
{"start": 4616, "end": 4632, "speaker": "Dan Khasis", "text": "у вас есть род данные pipeline они идут бикью а тем их анализирует сохраняет куда-то они идут назад мосикул потом ваш репорт рана это сагрегация этого материала с дью и указывается", "confidence": 0.98}
{"start": 4632, "end": 4670, "speaker": "Dmitry Lyubetsky", "text": "в пи и опи показывается здесь на этой странице а здесь вот шаг с мосикулом по крайней мере вот в моем опи да что типа делать вывод вот на эту страничку он отсутствует то есть я хожу напрямую в биквере не но мы не можем это делать я это очень грустно что это ситуация кто опробовал эту эту реализацию ну мы так обсуждали вот еще пока был игорь то есть собственно чтобы вы обсуждали", "confidence": 0.92}
{"start": 4670, "end": 4678, "speaker": "Dan Khasis", "text": "синхронно идти на биквере который рана это 5 до 10 до 50 секунд query вытаскиваетесь биквере", "confidence": 0.99}
{"start": 4678, "end": 4696, "speaker": "Dmitry Lyubetsky", "text": "напрямую сюда да у нас есть кэш на день то есть условно говоря если пользователь сходил туда мы сохраняем кэш до следующего синка до следующего дня и первый кол кэш хит будет 30 секунд там зачем", "confidence": 0.85}
{"start": 4696, "end": 4710, "speaker": "Dan Khasis", "text": "вообще вы хотите там порядка же двигаться на следующую тему что у нас следующая семена", "confidence": 0.46}
{"start": 4710, "end": 4721, "speaker": "Semeyon S", "text": "думала по выбью а и на этот раз все вот мы хотим дать возможность мобильной команде показать", "confidence": 0.68}
{"start": 4726, "end": 4766, "speaker": "Kateryna Shevchenko", "text": "мобильным проектом мы хотим показать сегодня редизайн конкретно это будет на обеих платформах антон пошарь пожалуйста андроида есть видно но это собственно маршрут который", "confidence": 0.37}
{"start": 4766, "end": 4792, "speaker": "Dan Khasis", "text": "еще пендинг уай по-прежнему сломан о чем мы показываем опять же дефективный уай не пофиксили не поменяем здесь ничего не пофиксили ордер нету schedule все старинное окей следующий экран здесь нечего смотреть что следующее следующая по флоу дефолтному", "confidence": 0.62}
{"start": 4792, "end": 4806, "speaker": "Dan Khasis", "text": "у нас должен быть лодинг я не знаю что это значит лодинг загрузка в машину в некоторых случаях для некоторых бизнесов да при наличии лейбл кодов у ордеров из которых был спланирован", "confidence": 0.85}
{"start": 4806, "end": 4862, "speaker": "Dan Khasis", "text": "этот маршрут у нас он вынесен он динамически показывается только некоторым людям или всем всем у кого будет доступ к этому маршруту кейс у них есть скупили правильный ответ у нас сейчас динамически есть роли лодер и фут фичер там лоут сканер сорт сканер сердж сканер как решается в этом меню что-то мы как мы проверяем что функционал не пропал но этот лодинг он", "confidence": 0.41}
{"start": 4862, "end": 4927, "speaker": "Anton Zadyraka", "text": "был доступен всегда и неправда сортер отдельная роль вынесена со своими сканерами зависимости от ролей тут может еще добавиться к примеру сайн юзер но это драйвер плен you're out эдит раут будет доступен не редон для юзером рэфэш раут будет доступно всем дубликейт раут тоже будет доступен не рядом для юзером сердж раут доступен всем шейраут возможно тоже экспорт доступен всем делит доступен не рядом ли я почему никто не знает ответ на эти", "confidence": 0.49}
{"start": 4927, "end": 4957, "speaker": "Dan Khasis", "text": "вопросы я сто процентов знаю что лоут и сорт это динамические зависимости от типа юзера или от типа каких-то атрибут насчет каких-то начальных элементов внутри маршрута иногда", "confidence": 0.54}
{"start": 4957, "end": 4962, "speaker": "Vova", "text": "водитель грузит машину сам иногда это отдельный юзер который работник склада", "confidence": 0.99}
{"start": 4964, "end": 4988, "speaker": "Dan Khasis", "text": "мне кажется сейчас это не надо гадать не надо гадать я тебе пытаюсь сказать это кто-то должен настраивать того юзера просто так нету этих всех юзеров возможности ничего грузить там есть настройка где-то в или в админ панели или в юзер конфиге где-то есть настройка я знаю", "confidence": 0.89}
{"start": 4988, "end": 5047, "speaker": "Anton Zadyraka", "text": "сто процентов что макс пирогов знает этот ответ сортинг тул да он юзер тайпу сортер привязанный лодинг тул я не уверен не привязан к юзер тайпу сортинг это отдельная роль и юзер тайпа доступные сортингу они конфигурируются ключами но лодинг не входит в список тех сортник сканеров которые доступны отдельные роли сортера лодинг в принципе доступен всем юзер тайпа но но по фичике по конфигурации но если включен конфигурация что лодинг нужен и нужны атрибуты у дестинейшенов и ордеров то он будет но выходит не всем выходит", "confidence": 0.95}
{"start": 5047, "end": 5120, "speaker": "Dan Khasis", "text": "динамически у нас если у тебя есть лодинг у тебя должен быть сортинг если у тебя есть лодинг и сортинг тогда где статус сканнер потому что ты посмотришь на посылку ты должен знать ты должен что происходит ты не знаешь ничего из этого и у нас же был главный экран госпар нарисовал его месяца 2-3 назад они его вы они его выкатили мне кажется антон я так полагаю это smart сканер его еще не выкатили там и там было 2 там было 2 или 3 line item и", "confidence": 0.43}
{"start": 5127, "end": 5209, "speaker": "Vova", "text": "меню отдельно не в меню маршрута до лодки сканер должен быть привязан к маршруту потому что ты грузишь почему сортинг сканер маршруте потому что ты можешь сортировать разные маршруты в общем ты не должен выбрать сперва открываешь сканер там уже внутри выбираешь маршрут который ты сортируешь а здесь другой процесс 1 выбираешь маршрут по которому ты будешь ехать а потом его загружаешь я думаю у нас это все не очень хорошо продумано честно говоря согласен и сейчас у нас лодинг является все что уже сортировано для этого маршрута а могут подвести кучу которую тебе нужно выбирать что тебе нужно в этот маршрут сейчас у нас с лодинг это предварительный шаг перед началом маршрута да то есть ты должен сделать лодинг до старта маршрута я прав на самом деле логично было бы иметь лодингом как таск на депоте на пикап с депота 2 я сделал", "confidence": 0.95}
{"start": 5209, "end": 5299, "speaker": "Dan Khasis", "text": "паззу на секунду скажу что вовина более оптимальное видение отличается от как бы что мы прямо сейчас его идем делать что здесь просто меню мне нравится но здесь непонятно как закрыть это delete route в принципе в самом ужасном месте потому что ты нажимай вы выключи меню на секунду как ты открыл меню swipe up или как нет 3 точки это какая самая популярная будет следующая шаговая вещь ты водитель ты кликнутые точки и мы на первом месте где твой был палец большой палец это delete route вместо самого популярной вещи например старт раут старт навигацион старт лоу день то есть парень же здесь у чувака был правильно так теперь делить раут впервые на первом перитете теперь он же должен двигать палец вверх неужели нам не лучше и более удобно и неоптимально", "confidence": 0.65}
{"start": 5299, "end": 5325, "speaker": "Vova", "text": "поставить но это все секондере экшен потому что старт роут он там находится на первом уровне его не нужно открывать никакой меню чтобы стартовать маршрут а почему эти 3 эти 3 3 точки", "confidence": 0.39}
{"start": 5325, "end": 5344, "speaker": "Dan Khasis", "text": "себя почему старт лоу день зато в этом месте если действительно старт лоу день чуваки сейчас если у человека есть задача делать лоу день да у него это может кнопка не может стартовать маршрут пока не сделал это это самая важная вещь он даже не имеет права делить маршрут", "confidence": 0.99}
{"start": 5344, "end": 5401, "speaker": "Vova", "text": "конечно если он в рядомной моде в общем не такое ощущение что это старт лоу день в обществе в этом меню быть не должен вместо этого в этом состоянии кнопка вот этого должна была называться старт лоу день после маршрут загрузили после этого можно начать маршрут это в том случае если у вас лоу день это предварительный шаг перед стартом маршрут обязательный да но в идеальном мире я считаю что лоу день это экшен на первом дистанционе сказал что мы сейчас реализовать не будем но я все равно считаю что это более правильное место для лоу день внутри маршрута то есть сперва ты стартуешь маршрут а потом ты начинаешь предварительную фазу сервис на депоте загрузка", "confidence": 0.78}
{"start": 5401, "end": 5544, "speaker": "Dan Khasis", "text": "какие-то ходки кнопки обязаны быть доступны моментально юзером особенно по типу юзеру например я вам рассказывал что в америке есть home depot и lows тогда приходят люди самые не образованные еле закончили восьмой класс что они делают они грузит разгружают это туалеты инструменты кирпичи и так далее и у всех у них есть зибра андроидовский телефон и на том андроидовским телефоне у них у всех есть ком-типу приложения которые они пользуют и я пока давай покажу фотографию жалостно и фирма которая номер один в америке может в мире в этой home goods services вот это они весь их бизнес раны цена этой хуйня весь их бизнес и скью депот это лукап инвентарий inventory management system это ты сэсканировал баркод тебе пишется сколько есть и где потом есть какие-то другие вещи потом здесь есть лагаут идентификатор рабочего и как его баркод телефонный номер если есть во их логотип посередине мы можем тоже кстати логотип эмбеддать фирма которая наш подписка подписчик и отсюда они видят my routes они видят там my orders они видят я не говорю копировать один в один но тем не менее мы говорим о фирмах то есть 500 миллиардов долларов стоит и мы можем обсарать их юай сколько мы хотим но с этим юаем они стоят 500 миллиардов они на бирже у них стоимость 500 миллиардов", "confidence": 0.72}
{"start": 5544, "end": 5555, "speaker": "Dan Khasis", "text": "потому что все в одном клике находится на удалении одного клика а мы делаем все через 10 кликов", "confidence": 0.85}
{"start": 5555, "end": 5679, "speaker": "Dan Khasis", "text": "и неудобно вот например pick orders это у них есть приложение собирать эти и как у нас лодский это у них пик они называют лоу пик это когда ты в каузе ты берешь с полки что-то а лоу да это когда ты там сходу и ты грузишь что-то почти то же самое так вопрос мы должны динамически показывать разные вещи разным типом юзером все согласны с этим и 1 это первая вещь вторая вещь все вещи которые мы показываем мы мы будем показывать им удобно например smart scan tools а и так далее чтобы они могли одним кликом или повторяющими действиями делать сотни", "confidence": 0.35}
{"start": 5679, "end": 5757, "speaker": "Vova", "text": "транзакции на 7 миллисекунды да это все очень зависит от лоу компании по идее нужно чтобы не только типа юзера но и от того как что это за компания как как она предполагается что используется у нее да потому что в одной компании будет например сортер отдельно человек который да почему-то наращивать роль на юзера и наращиваться и этот сортер он готовит тележку с грузом которую отдает водителю целую тележку и водитель просто сканирует баркод на тележке и подтверждает что он забрал эту тележку а в другой компании будет не так в другой компании будет водитель который приехал на склад и сам ходит по складу собирает то что ему нужно и носит себе машину и в этой ситуации как бы водитель является игрущиком и сортером и мы заранее не знаем", "confidence": 0.67}
{"start": 5757, "end": 5841, "speaker": "Dan Khasis", "text": "должны как будто бы поддерживать оба варианта мы не будем это неверно это неверно мы их не поддержать у нас есть настройки на это все макс пирогов знает эту хуйню inside out они назначают на разных юзеров разные роли разные типы разные флаги разные чего-то и в зависимости от какие у них есть эти лишние обогащенные флаги и показатели они видят или сорт скейн или лоут скейн или статус хэм и мы можем включить все три мы можем включить 0 то что я пытаюсь сказать это то что мы в и обязаны показывать только то что включено на настройках того юзера вот сейчас пытаюсь это само собой нет но это не так так не я не знаю это само собой вот в чем проблема работы с программистами что если ты конкретно не скажешь что конкретно до молекулы предположение всегда не не то что нужно а что что может быть они чувствуют но в этом плане логика не меняется", "confidence": 0.7}
{"start": 5841, "end": 5872, "speaker": "Artur Moskalenko", "text": "сколько я понимаю и сортинг тул он так и остается под сортер юзером сортер юзер тайт этот юзер тайт можно включить только по вручную через кастом фичи на определенный аккаунт то есть большинство пользователей знают что такой юзер тайт есть в системе вообще правильно", "confidence": 0.87}
{"start": 5872, "end": 5911, "speaker": "Dan Khasis", "text": "вот артура сказал очень важный момент мы возвращаемся к семену что у нас нарушенный процесс выдавать и настраивать параметры и вот если мы посмотрим это один из этих сценарий у тебя есть редактор красиво юзер редактор там нету галочек на вот этот тип вещей и когда ты включаешь ту галочку мы не обязаны это members таблицу писать мы просто будем наращивать эти настройки в advance configuration на бакенди если они выключили мы удаляем если не включили", "confidence": 0.94}
{"start": 5911, "end": 5954, "speaker": "Vova", "text": "мы прибавляем мы рисуем почти все дизайны мобильные исходя из того что все это будет конфигурироваться администратором но мы не нарисовали до сих пор административный юай которые администратор будет видеть и иметь возможность настраивать мобильное приложение для драйверов", "confidence": 0.46}
{"start": 5955, "end": 6024, "speaker": "Dan Khasis", "text": "я думаю мы сейчас в той точке где пора его рисовать мы не они не могут даже мы не можем даже закончить вова это ты можешь его рисовать но они не могут приступать ни к чему было обязаны закончить и несчастные 5 и 10 оставшихся экранов думал да у нас был как раз вопрос по", "confidence": 0.18}
{"start": 6024, "end": 6041, "speaker": "Anton Khavanskii", "text": "лодингу которые хотели обсудить и можем сейчас к нему перейти начал давайте по кустаризации мы обсуждали слова не так давно что нужна ли нам кустаризация на этом экране когда зума", "confidence": 0.95}
{"start": 6041, "end": 6088, "speaker": "Dan Khasis", "text": "вот мы делаем экран имеет большие проблемы мы я мне очень не нравится что мы игнорируем все мы тратим час много часов на эти разговоры потом вся информация теряется я вернусь к", "confidence": 0.33}
{"start": 6088, "end": 6135, "speaker": "Vova", "text": "кластеризации дело в том что если маршрут например у тебя имеет форму круга и ты его склон стерезуешь у тебя все пины окажутся внутри этого круга кластер будет находиться внутри круга и вокруг него будет те линии поэтому очень странно идея кластеризовать маршрут потому что кластер могут маршрут у которого есть driving line потому что кластер может оказаться вне этой driving line будет лежать где-то вдоль маршрута и это очень странно будет поэтому если мы не хотим показывать destination лучше и скрыть чем кластеризовать или их можно показывать в виде маленьких", "confidence": 0.99}
{"start": 6135, "end": 6208, "speaker": "Dan Khasis", "text": "без номеров если надо показывать мы раньше говорили что когда все динамически от зум лавала если на этом этапе иметь иметь каждую цифру высадать каждую цифру это идиотство или показывать через 5 или через 10 или показывать точечки потом делать зумин или некоторые юзеры начали жаловаться на ю на на гугле что когда мы перешли на то это точечки больше чем 100 остановок что они ничего не понимали и мы включили еще одну настройку я уверен он с этой настройкой знаком что если ты можешь включать режим цифр режим цифр или режим точек по умолчанию я считаю что", "confidence": 0.61}
{"start": 6208, "end": 6256, "speaker": "Vova", "text": "правильным поведением было бы если бы мы показывали точки если на экране слишком много destination так что начинают друг другу мешать скажем не знаю какой порог 50 100 а то тогда мы показываем все в виде точек и в виде флажка мы можем показать только следующий destination если ты делаешь зумин таким образом что тебе помещается только разумное количество то есть меньше чем 50 они друг другу не мешают тогда мы показываем цифры все зависит от емкости все зависит от зум лавала мы не можем просто так сказать да но я бы я бы способ отображения выбирал в зависимости от того сколько destination попадает в это уже делаем полигон это другой вопрос мы сейчас", "confidence": 0.93}
{"start": 6256, "end": 6270, "speaker": "Dan Khasis", "text": "делали первую попытку первая попытка зевова была на на количестве пинов если больше чем 100 она идет на точки с настройкой override если она меньше чем 100 она идет в эту кашу да но это вот это", "confidence": 0.91}
{"start": 6270, "end": 6282, "speaker": "Vova", "text": "не может быть неудобно потому что люди будут хотеть приблизить информацию номера все-таки важная информация они мешают только если их слишком много а если их не слишком много то они очень", "confidence": 0.99}
{"start": 6282, "end": 6342, "speaker": "Dan Khasis", "text": "помогают их в этом случае что непонятно тогда уберите эти курсоры и пишите просто лейблы как делал этот красиво эти ребята в роднете 15 лет назад на предыдущем зонке мы видели что они пишут и белым и черным текстом одновременно без никаких маркеров и у них и тогда вам надо поиграться с этим мы не решим это на этом зоне кто-то должен нарисовать вам функционал который имеет глаз худо больше как художника юзер экспириенса чем технический человек да но я мой поинт был в", "confidence": 0.63}
{"start": 6342, "end": 6349, "speaker": "Vova", "text": "том что я против того чтобы кластеризовать destination и внутри маршрута если ты если", "confidence": 0.73}
{"start": 6349, "end": 6461, "speaker": "Dan Khasis", "text": "у тебя есть адрес бук и кастер locations мы можем кластеризовать тебе адрес бук мы кластеризовать многие вещи да но не те которые соединены между собой линии опять мы должны смотреть на редеш мы должны смотреть на аналитику аналитика нам покажет как люди пользуют систему аналитика нам покажет сколько сколько у людей какого типа маршрутов с каким количеством остановок если вы не знаете пользуясь систему звоните артему и артем вам все объяснит и покажет конкретно антон должен антон и госпар должны в любую секунду они получат ответ от артема если они будут задавать правильный вопрос сколько у нас юзера пользуют планирует маршрута сколько у нас юзеров средний момент остановок маршруте мы сейчас может быть спорим насчет чего-то количество юзеров которые имеют больше чем 20 остановок может быть только 10 процентов людей но эти 10 процентов людей могут генерировать 90 процентов денег сейчас секунду как мы знаем когда она запустится он спестирует а я думал что там все одинаково просто юаин немножко другой", "confidence": 0.68}
{"start": 6461, "end": 6492, "speaker": "Anton Khavanskii", "text": "были проблемы госпа решил что он хочет там разрабатывать нашли достаточно большое количество на на ровном месте так много проблем да я видел около сейчас висит вроде бы около", "confidence": 0.52}
{"start": 6492, "end": 6515, "speaker": "Dan Khasis", "text": "50 багов чтобы просто сделать чтобы на том же списке опутать динамичный как бы соль а почему как мы этих людей держим если они на ровном месте столько детектор за заносят", "confidence": 0.65}
{"start": 6517, "end": 6543, "speaker": "Anton Khavanskii", "text": "я нашел смарт-сканер и вообще не знаю то есть госпар меня поставил уже перед фактом что вот у меня готово я даю тестировали так он программировал он до страны и он у нас есть сейчас определенный процесс то есть опробу пиар потом доставки он как бы это все проигнорировал и", "confidence": 0.68}
{"start": 6543, "end": 6610, "speaker": "Dan Khasis", "text": "сразу запустил на кей а почему мы не здесь ветку нельзя не защитим на гитхабе он не сможет влить хорошо сейчас секунду артем ответил там был дефект но секунду здесь ничего не поменялось мы я знаю что я не у меня есть много не оптимальных и можно сказать качеств но я минимум 50 раз говорил какого хуя писать точка 2 мили когда 50 100 километров маршрут сколько раз мы можем повторять то есть здесь ничего 0 не поменялось просто 0 зачем вы даже смотрим на это зачем вы", "confidence": 0.56}
{"start": 6610, "end": 6645, "speaker": "Anton Khavanskii", "text": "показываете что не поменялось или стало хуже окей хорошо мы поправимся тогда к следующему вопросу мы снова смотрели на днях документ который ты прислал по лоутинг процессу на самом деле вову уже были макеты до этого мы можем их совместить те предложения которые ты дала и воины", "confidence": 0.52}
{"start": 6645, "end": 6676, "speaker": "Dan Khasis", "text": "макеты и как бы выйти с новой версии я не понимаю экспорт рауты говоришь о чем ты говоришь нет я говорю лоутинг лоутинг где лоутинг вот нет он не починят здесь ничего не починено да здесь ничего не починено потому что мы это опять так что мы предлагаем тогда есть новый экран вот", "confidence": 0.85}
{"start": 6679, "end": 6704, "speaker": "Vova", "text": "он нарисован но мы его еще дорабатываем потому что я позавчера узнал про твои требования новые и поэтому мы дорабатываем чтобы он соответствовал твои требования но там в принципе суть такая же помочь грузить машину в нужном порядке и дать возможность потом водителю понимать", "confidence": 0.89}
{"start": 6704, "end": 6734, "speaker": "Dan Khasis", "text": "куда что было загружен это не важно нам это не важно это супер низкий приоритет нам не важно чтобы он знал мы можем пропустить это этот смарт сол скин экрана много важнее чем это если если мы должны делать решение нам печатать на придут в принтере важнее чем знать где это находится уже 100 миллионов посылок через систему без этого фичи функционала значит что значит", "confidence": 0.85}
{"start": 6736, "end": 6775, "speaker": "Vova", "text": "я вчера не пришел на звонок этот и мы тут вместе даже всем все смотрели видеоролик о том как работает проходит рабочий день водителя фидекса и водителя амазон и водителя дпп дпд и я что увидел там это то что эти ребята тратят уйму времени на то чтобы найти нужную коробочку в кузове чуть не больше времени чем у них наложение тратит именно сервис тайма большую часть времени у них", "confidence": 0.99}
{"start": 6775, "end": 6802, "speaker": "Dan Khasis", "text": "занимает поиск нужной коробки да но в других местах у них есть 200 этих отверстий в машине и каждое отверстие имеет цифру и потом они фломастером на каждой посылке пишут эту цифру и покладут ее порядок остановки когда они делают этот лоуд скен может лейбл сгенерировано чужими людьми", "confidence": 0.73}
{"start": 6802, "end": 6824, "speaker": "Vova", "text": "уже не нами это понятно но все равно даже если у них достаточно хорошо по сортирована но если конечно не подпишут фломастером и у них есть 200 ячеек машине то это конечно спасение но у них нет обычно 200 ячейки машине у них либо машина так в любом случае делать это я говорю все валяется", "confidence": 0.76}
{"start": 6824, "end": 6861, "speaker": "Dan Khasis", "text": "на полу делать тот экран который мы обещали сделать полу для его клиент 3 месяца назад где я думал что это shortcut меню а в итоге это 10 багов как-то получилось как мы можем делать твое сложную вещь если мы даже не закончили эту элементарную вещь мы доделываем люди не могут люди даже не знают какой какие у них есть посылки вова ты говоришь сейчас насчет как бы давай найдем посылку я говорю они даже не знают какие у них посылки должны быть они полностью растерянной", "confidence": 0.8}
{"start": 6863, "end": 6885, "speaker": "Vova", "text": "на текущий момент в любом случае мы сейчас последние два дня думаем над тем как усовершенствовать чтобы упростить им процесс загрузки и мы принесем скоро новый дизайн шикарно но мы должны", "confidence": 0.85}
{"start": 6885, "end": 6979, "speaker": "Dan Khasis", "text": "сделать что мы обещали этим людям мы сделаем мы обещали им 3 месяца назад сделать этот shortcut меню и потом на прошлой неделе я я рассказал вам насчет другого нового требования чтобы видеть на одном едином списке в том shortcut списке статус по остановок по разным типам например сверху там пил пилюля этот свитчер столько-то сорта столько-то loaded столько-то столько-то миссинг и они кликают как вы видели у этого network фирмы и одни одним кликом одним махом берут и переключается между между этими вещами одним кликом это не более правильно сказать можно покажу ненадолго этот смарт-сканер показывает что хочешь то", "confidence": 0.55}
{"start": 6979, "end": 6985, "speaker": "Anton Zadyraka", "text": "есть этот сканер у нас должен быть в отдельном меню доступен не на уровне маршрута не на уровне", "confidence": 0.97}
{"start": 6985, "end": 6995, "speaker": "Dan Khasis", "text": "нет это дизайн не пробовала это просто так это сумасшествие это это даже были еще одна не", "confidence": 0.66}
{"start": 6995, "end": 7010, "speaker": "Dan Khasis", "text": "прошло вовинова аппрубова но мы бил получили до того как его увидел вову но мы общались словами тем что дизайн нужен это даже не вырезать что я пробовал госпару а он говорил это", "confidence": 0.92}
{"start": 7010, "end": 7059, "speaker": "Dan Khasis", "text": "но то процентов это не но знаешь почему потому что я помню мы убрали нахуй повторяющие слово потому что вся эта категория была было сортир так почему тогда было здесь написано это несколько раз и слово рейсим поменяли тоже тоже неправильное слово а что должно быть", "confidence": 0.36}
{"start": 7059, "end": 7090, "speaker": "Anton Zadyraka", "text": "место с контури сив потому что от госпара было что все вот эти лейблы запруглены и мы слова обсуждали возможно даже секвенс стоило бы этих лейблов иметь по лейв сайклу самого ордера но от госпара опять же было что этот секвенс эти лейблы видели и запрыгнули а первых здесь нет", "confidence": 0.71}
{"start": 7090, "end": 7115, "speaker": "Dan Khasis", "text": "улог где лоут и зато пошло где лоут с кем если мы запрыгнули так это так это я не понимаю все что мы хотели сделать это просто в кучу соединить все скинули из всех мест и динамически", "confidence": 0.49}
{"start": 7115, "end": 7150, "speaker": "Vova", "text": "включать их в одном месте я тебя услышал в следующий раз пожалуйста ставь меня в известность когда такие рекламы появляются до чтобы я был в курсе и чтобы я с первых уст услышал от тебя что нужно и после этого мы будем готовить макет мы по макету это было мне", "confidence": 0.48}
{"start": 7150, "end": 7164, "speaker": "Dan Khasis", "text": "кажется с ними говорили месяцами назад даже перед тем как мы начали эти еженедельные просто", "confidence": 0.55}
{"start": 7164, "end": 7187, "speaker": "Vova", "text": "когда происходит испорченный телефон я в итоге не уверен какие будет рекламу тогда если я услышал себя я понимаю чем речь а если я услышал от кого-то еще здесь есть записи здесь мы теперь знаем тут четко ясно что что нужно когда мне их объяснит кто-нибудь со слов гаспара то получается", "confidence": 0.99}
{"start": 7187, "end": 7375, "speaker": "Dan Khasis", "text": "вот так мы только это случилось один раз все другие разговоры одновременно с антоном и другими может даже антон был в курсе я не знаю надо проверить smart scanner марк это в марте мы дали задачу гаспара в марте и сейчас секунду да он все неправильно сделал полностью все неправильно сделал потому что или у него есть крышот который якобы опробовался и у меня было написано я сейчас в чате я зум напишу как у меня было а вот секция была не по функции а по бизнес бизнес объектив аутбайл потом была секция inbound потом была секция orders и потом насчет ордера была секция была что было аутбайл inbound и потом потом я написал гаспару если мы можем пригласить на дзюнок но окей что еще", "confidence": 0.33}
{"start": 7376, "end": 7394, "speaker": "Kateryna Shevchenko", "text": "да я гаспару написала как раз пока не ответил я написала что подключился если есть возможность пока можем дальше тогда пока и мы ждем у меня еще вопрос по поводу опруга", "confidence": 0.95}
{"start": 7397, "end": 7410, "speaker": "Anton Khavanskii", "text": "различных но контента я имею ввиду в плане нам нужно поменять какое-то слово или может быть предложение мы все время к тебе должны идти может быть мы еще какой-то процесс придумаем", "confidence": 0.99}
{"start": 7410, "end": 7420, "speaker": "Anton Khavanskii", "text": "или как-то лучшим чтобы каждый раз не дергать что-то поменять одно слово нет потому что мы у", "confidence": 0.92}
{"start": 7420, "end": 7497, "speaker": "Dan Khasis", "text": "нас есть один бизнес это делать software и мы не мы видим что происходит когда вы не выборка правильного слова и по цепочке все взрыва идет неправильно то есть если бы у нас были квалифицированы архитекторы дэйта архитекторы и дэйтабейс архитекторы и пипа люди которые бы не шли на синхронный сервис синхронном режиме который может нас разорить потому что колд кеш хит не кашируется мы платим за это может быть 3550 долларов за один query если бы у нас были все эти люди я бы сказал окей пусть они это все делают но end я бы сосредоточил только на end который мы сейчас делаем покупку trial то есть покупки sign up страница viral coefficients там и так далее но у нас этих людей нету так я больше на то это теряя время вместо делать то что кастомер надо до конца делать например strategic planning сколько мы например этот pruning и data policy это сколько десятая попытка попереду неправильно", "confidence": 0.8}
{"start": 7503, "end": 7507, "speaker": "Kateryna Shevchenko", "text": "госпар подключился к нам уже прошлым вопросом", "confidence": 0.99}
{"start": 7509, "end": 7556, "speaker": "Dan Khasis", "text": "hi guys are you take a look at the smart scan screen looks totally different than what we agreed to you know i know it's not this one is and maybe it's a mistake or miscommunication is because we're losing the load scanning and we're missing the labels inbound outbound but also there's duplicative words here that we agreed to remove because why would we write sort multiple times and here and here if it's already inside the sorting i'm pretty good with remember this kind of stuff", "confidence": 0.34}
{"start": 7560, "end": 7600, "speaker": "gaspar.eross", "text": "i remember that you approved but anyway i can change this and you show us what why what we proved what i proved this was it because i i made the modifications on the in the codes and after that i sent you screenshots so when you said it's okay i i didn't change after that so this was it you proposed new names for a get order status update order status and you you proposed this grouping and and the different order of the items that was the first version", "confidence": 0.31}
{"start": 7601, "end": 7889, "speaker": "Dan Khasis", "text": "okay one second give me a second i want to check something i mean it was in march so it's it's very difficult to but let me show you something else that we just got from paul who's our top guy from fedex we used to be the chief operating officer at lso before he joined us he's saying the typical process start loading then scan the pile of packages randomly the app returns the address and sequence place the package in the truck or stage repeat until pile on the floor is completed in the truck so they start scan they they hit start loading so that's the first problem okay look at this they put the start loading in a sub menu look at volvo and i just talked about that they took something that was thought through and they ruined it i'm not saying gasper it's your fault i'm just saying what i'm just giving you an update that start loading was in the correct place and now now i got ruined and it's in the sub menu so that's the first problem the second problem is but they're proposing that they wanted the ability to scan the or if you have orders in the route they want the program to force you to scan the orders only in the correct sequence so that if you have um again this is a configuration flag it's not requirement right so it's a configuration flag so if the flag says you have to scan orders in the same sequence in the route sequence then the top has to be order number nine nine nine nine nine sequence number and then the bottom has to be sequence is number one so you do that one first the you do it last i mean because you're loading in reverse order then the idea is that instead of showing a blank screen that we're talking about sort the sort the loading scan right now that instead of showing a blank screen we would actually show the full list of the route destination and then if we had 150 you could show show me destinations you show me orders and then there would be that the order id the address the packages or line item count whatever the sequence number over here and then the status and then what would happen is as you did the next one the next one the next one the list would just update update update because right now they're blind right it's a black box they don't actually know how many they have to scan they also don't know i mean technically they know over here if you look at the loading progress there's a progress bar over here but the progress bar over here it doesn't show them what's missing and then and because there's no switcher over here to show me what's been scanned or what's been loaded on the route or or what's been sorted loaded or status updated meaning like other or none they have no clue because okay now let's say you're done you did 99 of them okay which one did i not do tell how did the guy know so what this what this customer needs is um and what all the customers need is basically a tabular view of the exact same destinations the exact same metadata with the exact same everything but so that they could easily pinpoint what has not yet been scanned whether it's the destination or it's an order and then if it was scanned it wasn't loaded or whatever and again it's all the same database there's no api changes it's just the ui change where we have to kind of scroll down automatically like look you did the first order it moves down you do the next order it's next on the list it's like a queue it's like task list but right now the task list is not is not rendered", "confidence": 0.4}
{"start": 7889, "end": 7918, "speaker": "Dan Khasis", "text": "like a task list i see so so first first thing is that we we never had the loader uh on smart scanner screen or on the main menu this was always part of the stop screen so what i did on smart scanner is just a reorganization of existing functionalities like sort by territory inbound scan and all these features plus i added order scanning for this uh i have a question but i", "confidence": 0.06}
{"start": 7918, "end": 7948, "speaker": "Dan Khasis", "text": "have a questions of the whole group if my job is only to sort shit and put in a truck then i don't need to see the route and if my job is i'm driving the route i don't need to see how the route is going to look while i'm loading it because some a lot of drivers load their own car but a lot of but some companies they don't load their own car so i don't need to see what the route looks like when i'm scanning shit i want to see what i've what's pending or not pending", "confidence": 0.21}
{"start": 7948, "end": 7969, "speaker": "Dan Khasis", "text": "what's scanned not scanned so so what we want basically is to not be necessary for the user to enter stop screen he can enter from smart scanner the loader makes the whole loading and he doesn't care doesn't have to care about other details because he will see the whole list here no no it", "confidence": 0.03}
{"start": 7969, "end": 8048, "speaker": "Vova", "text": "is important uh well when you are loading a vehicle it is important to load it in correct sequence because no you're not going to be in the correct sequence it's not a random no no then uh listen uh imagine there is a pile of 100 boxes on the floor it says that right here you are a driver and you want to load this into vehicle in a meaningful order because if you load it in random order then you will lose lots of lots of time uh when you're going to find which item you want to unload on each destination because on first destination if it was here was 100 boxes then on first destination you will lose uh you will have to scan 50 boxes to have enough probability to find a correct one so and if you are loading a full car it means you now need to unload your car partially to find something in the end of your car so uh it is ideal to have a vehicle if here is the front of the vehicle so uh no you're going back", "confidence": 0.27}
{"start": 8048, "end": 8147, "speaker": "Dan Khasis", "text": "you're going back to the thing that i said we don't care about right now you're this is not this is not the place or time for it we're not we don't care about that right now what we care about is that we need to show these guys this is the list that read what this says read what this says there's a bunch of boxes on the i'm talking about this this is different they're saying this this is a what you're talking about is an enhancement we don't even have the basic the basic is a list of the stuff we do not have the list of the stuff we have a route list the route list nobody needs to see the eta nobody needs to see the customer name or or whatever in that batch mode the batch mode is i got two or three seconds to scan a package in the order my boss told me to scan it so this is i know the order i know the order yes true i know the order this is false i don't it's random i the system needs to tell me the order here the system is telling me the order too but the workflow is load randomly but put in sequence and here it's load in sequence and still put in sequence the only difference to what what was saying is like adding a piece of cheese to your hamburger to make it taste better which is add some additional attributes to let the driver know where he put it then he put it in the front in the back at the top or the bottom in the middle or or no no that's the only thing i was", "confidence": 0.4}
{"start": 8147, "end": 8223, "speaker": "Vova", "text": "i was talking about a little bit differencing when you are trying to force a loader to load it in order to find boxes so first you need to find box number 100 and you have a pile of 100 boxes and now you have to now loader has a headache because he has to find one box of 100 to load it first because he is forced to load it completely in exact sequence but maybe it is reasonable to not to force him to load in exact sequence but first he loads 25 boxes from the end of the route in any sequence but puts them to the back of the car randomly but only these 25 boxes it will be way faster than sort 25 boxes find 25 boxes and sort them you just scan random boxes if you see that this is in the correct quarter of the truck you load it so i suggest a separate", "confidence": 0.67}
{"start": 8223, "end": 8245, "speaker": "Dan Khasis", "text": "topic this is a separate topic it's a load in batches it's a load optimization problem it's different we don't have we don't have the algorithm for that it's called bin packing it's called bin packing there's an algorithm for it we don't have that algorithm i'm not saying it's", "confidence": 0.92}
{"start": 8245, "end": 8305, "speaker": "gaspar.eross", "text": "hard but we don't have it so in the end the idea would be that we we move this mover the load menu to smart scanner so he he can do without entering stop screen seeing map and with minimal details he can do it so maybe one step would be to select the route if no route is selected and then goes to the scanner without stop without additional details he will see the list on that empty space what you what you said and we can have two modes one is forcing the sequence depending on config param and one is not forcing the sequence and if he's forcing the sequence he's going one by one as auto scrolling if he's not forcing the auto scroll to the scanned item something like this i guess well we should draw an updated", "confidence": 0.06}
{"start": 8305, "end": 8344, "speaker": "Dan Khasis", "text": "design well i could talk to him about it separately but yes that's some closer to what you're saying what we need to do is an intermediate release the question is if those 10 bugs are fixed for the for the smart scanner how does the person open the smart scanner", "confidence": 0.39}
{"start": 8349, "end": 8371, "speaker": "gaspar.eross", "text": "he's opening from the main menu before we had this this what we have inside the smart scanner we had separate menus in the main menu so we gathered a lot of menus depending on what was enabled for the user so not just we centralized it on a screen and we show only the enabled menus for the user", "confidence": 0.13}
{"start": 8372, "end": 8395, "speaker": "Dan Khasis", "text": "but the functionality remained the same but then i'm confused why it took five months to add the three menu items is it because we were doing other high priority stuff", "confidence": 0.13}
{"start": 8396, "end": 8450, "speaker": "gaspar.eross", "text": "no no it didn't take five months we had other stuff in priority and this was the recently sent for testing it's under testing but it didn't take five months for sure because i thought we talked about in march yes yes we talked about that and i did it and meanwhile other priorities came we made other releases and now is in the queue to be released we can release as as first version this and once we have design we can add loader in the new way we don't have to postpone because of loader i guess i thought we had the inbound", "confidence": 0.2}
{"start": 8450, "end": 8489, "speaker": "Dan Khasis", "text": "boards inbound and outbound uh you mean inbound scan i feel like so few customers use this and it's pointless to even deploy at this point like we should just finish the new design because lso canceled i think you have like five or ten customers using it but we don't even know who's using it is it in firebase is it in three dash i don't know yes this has done first of all lso", "confidence": 0.29}
{"start": 8489, "end": 8495, "speaker": "gaspar.eross", "text": "few years ago and and then yeah but no one's using it i mean i'm not saying no one but i think", "confidence": 0.15}
{"start": 8495, "end": 8500, "speaker": "gaspar.eross", "text": "it's like five or ten or less yeah yeah so it's like we might as well just need the new design", "confidence": 0.1}
{"start": 8500, "end": 8512, "speaker": "Dan Khasis", "text": "then yeah that's why that's why it was not a super high priority to release this before other things before but the priority is high for the order sequence scan which is that there's one new", "confidence": 0.35}
{"start": 8512, "end": 8539, "speaker": "Dan Khasis", "text": "customer they want their guy to load the order exactly in the sequence that that um that they that the system is advising so probably we need a configuration tool that says you can only load and sort in the in the order of the sequence but then if you don't see the list then how do you know what the order is that's where it comes in helpful to see the list", "confidence": 0.08}
{"start": 8539, "end": 8554, "speaker": "gaspar.eross", "text": "yes the list in any case should be shown just a config prompt should be should control if we we should force the sequence or not yeah", "confidence": 0.59}
{"start": 8554, "end": 8574, "speaker": "Dan Khasis", "text": "that's right okay so what do we need to do to to do this if anything", "confidence": 0.16}
{"start": 8576, "end": 8594, "speaker": "gaspar.eross", "text": "um we need a design from vova yeah a design proposal from vova what what is the minimum necessary data to show and in which way to show it in the list items well we should meet to talk", "confidence": 0.43}
{"start": 8594, "end": 8622, "speaker": "Vova", "text": "about it uh i sold everything we can propose something during next week i have a tracking", "confidence": 0.33}
{"start": 8622, "end": 8735, "speaker": "Dan Khasis", "text": "page for your approval if you have time well what the mobile people still haven't presented anything i just want to point out because that client wants to see the track statistics", "confidence": 0.5}
{"start": 8737, "end": 8751, "speaker": "Anton Khavanskii", "text": "all on it was released a couple of days ago on android yesterday they sent a preview to google play probably today tomorrow it should pass okay thanks gaspar asked a good question", "confidence": 0.85}
{"start": 8752, "end": 8786.0, "speaker": "Dan Khasis", "text": "about sms we can now send sms as i remember and understand из из из мобильного приложения где мы шаблон как бы задаем правильно потом по классификации шаблона мы имеем этот возможность чтобы водитель мог своему клиенту посылать как бы статус когда он приезжает, что он приезжает и так далее, правильно?", "confidence": 0.95}
{"start": 8786.0, "end": 8820.0, "speaker": "Dan Khasis", "text": "Я не уверен, мне надо проверить.", "confidence": 0.95}
{"start": 8847, "end": 8856, "speaker": "Dan Khasis", "text": "это то, что я говорю, да, именно, но мы должны получить, мы должны сделать знание трансфер,", "confidence": 0.11}
{"start": 8856, "end": 8876, "speaker": "Dan Khasis", "text": "не трансфер это неправильное слово знание синхронизация, потому что похоже, что никто не знает, что мы имеем, если не 80 процентов, это большой проблемой, мне кажется, что я говорю с этими парнями, и мне кажется, что я не понимаю, как они не знают о функциях и приложении, на котором они работают, которые прожили 7 лет 7 8 лет 10 лет", "confidence": 0.65}
{"start": 8877, "end": 8884, "speaker": "Dan Khasis", "text": "мы способны, наши пользователи способны сформировать этот темплей, да, они сформируют его", "confidence": 0.32}
{"start": 8886, "end": 8894, "speaker": "Dan Khasis", "text": "каждое время, когда они посылают его, но они не сформируют его как мастер-темплер уровня, но мы могли бы сделать это легко, если бы нам понадобилось", "confidence": 0.6}
{"start": 8897, "end": 8921, "speaker": "Dan Khasis", "text": "мой правильный Гаспар о том, что я сказал, я чувствую, что это правильно, так что идея, что мы не можем контролировать посылку даже до смс, так что это так, что мы можем дать только вкладку, но пользователь нажимает кнопку посылки в конце, и я буду повторять это немного, хорошо, что гугл и аппл не хотят, чтобы каждый из этих устройств стал", "confidence": 0.21}
{"start": 8922, "end": 8978, "speaker": "Dan Khasis", "text": "инструментом для спама 300 миллионов американцев, так что, что происходит, вы не можете автоматически начать посылать смс, это должно быть как мануальная кнопка для посылки смс, но мы можем контролировать, что мы положили в мануальной кнопке текст в этом смс, мы можем контролировать, что пользователь вкладывает в это, так что мы вкладываем в это местоположение строковой паги, с чем, как привет, я подойду к вам, это строковая пагинга, если вы хотите меня увидеть, но вещь на строковой пагине, что Вы спрашиваете, может ли драйвер кастомизировать, чтобы звучал более как сам, и лучше сочетаться с его брендом или своей компанией или что-то подобное. Моя ответа на это, что я не знаю, но если у нас нет, то мы можем сделать это, это не проблема для премиум подписчиков.", "confidence": 0.13}
{"start": 8981, "end": 8999, "speaker": "gaspar.eross", "text": "Да, мы можем дать сеттинги для определения темплей. Для нас важно, что ссылка является частью смс. Другие тексты они должны быть способны кастомизировать, потому что ссылка приводит к скачкам.", "confidence": 0.14}
{"start": 9000, "end": 9003, "speaker": "Dan Khasis", "text": "Есть увеличение скачков с ссылки?", "confidence": 0.77}
{"start": 9015.57, "end": 9027.14, "speaker": "Dan Khasis", "text": "Да, это был план.", "confidence": 0.95}
{"start": 9027.14, "end": 9038.71, "speaker": "gaspar.eross", "text": "Да, но эта технология работает только на Android, потому что iOS не дает возможность скачать страницу кастомизации в зависимости от числа скачков.", "confidence": 0.95}
{"start": 9038.71, "end": 9050.29, "speaker": "gaspar.eross", "text": "Android дает возможность подключить параметр к скачкам, так что когда пользователь впервые скачет аппу, которая приходит из страницы кастомизации, он увидит сразу же заполненные данные на аппу.", "confidence": 0.95}
{"start": 9050.29, "end": 9061.86, "speaker": "gaspar.eross", "text": "Но iOS не имеет этого механизма.", "confidence": 0.95}
{"start": 9136, "end": 9144, "speaker": "Dan Khasis", "text": "Да, что-то странное произошло с интернетом. Вы слышите меня?", "confidence": 0.39}
{"start": 9145, "end": 9146, "speaker": "Semeyon S", "text": "Да.", "confidence": 0.4}
{"start": 9147, "end": 9165, "speaker": "Dan Khasis", "text": "Да, что-то странное. Итак, вернувшись к нашему разговору, вы сказали, что iOS не поддерживает возможность сделать подобные вещи. Можете рассказать о том, пожалуйста?", "confidence": 0.61}
{"start": 9203.6, "end": 9209.7, "speaker": "Dan Khasis", "text": "Но...", "confidence": 0.95}
{"start": 9215.8, "end": 9221.9, "speaker": "Dan Khasis", "text": "Не может быть никакой работы, никакой работы вообще?", "confidence": 0.95}
{"start": 9221.9, "end": 9228.0, "speaker": "gaspar.eross", "text": "Виктор сказал, что еще нет возможности.", "confidence": 0.95}
{"start": 9231, "end": 9241, "speaker": "gaspar.eross", "text": "Они просто скачивают аппу, но это не в режиме кастомизации, это просто скачивание, но потом они открывают, и он просит для триала, что же безумие.", "confidence": 0.09}
{"start": 9242, "end": 9245, "speaker": "Vova", "text": "Да, потому что в момент скачивания мы не можем дать эту вкладку, это наш проблема.", "confidence": 0.91}
{"start": 9246, "end": 9263, "speaker": "Vova", "text": "Что мы можем сделать на iOS, после первого ланча, чтобы спросить пользователя, если он трекает передачу, или если он делает передачи. И по этому мы можем изменить URL.", "confidence": 0.99}
{"start": 9275.57, "end": 9280.86, "speaker": "Dan Khasis", "text": "Это проблема.", "confidence": 0.95}
{"start": 9291.43, "end": 9296.71, "speaker": "Dan Khasis", "text": "Может, нам нужно изменить для iOS, сейчас.", "confidence": 0.95}
{"start": 9296.71, "end": 9302.0, "speaker": "Vova", "text": "Может быть, это должно быть только для Android, поскольку iOS будет дать нам большой баунс.", "confidence": 0.95}
{"start": 9302, "end": 9309, "speaker": "Vova", "text": "Но когда пилот делит по месту, он не знает, какой девайс...", "confidence": 0.99}
{"start": 9309, "end": 9317, "speaker": "Vova", "text": "Нет, ты не понимаешь, как это работает. Это статья, значит, ты не понимаешь, как это работает.", "confidence": 0.07}
{"start": 9317, "end": 9321.33, "speaker": "Vova", "text": "Это то, что это означает.", "confidence": 0.95}
{"start": 9321.33, "end": 9325.67, "speaker": "Vova", "text": "Пилот присылает SMS к клиенту, клиент открывает его, и мы не знаем, какой девайс он использует.", "confidence": 0.95}
{"start": 9325.67, "end": 9330.0, "speaker": "Vova", "text": "Я пытаюсь объяснить тебе.", "confidence": 0.95}
{"start": 9330, "end": 9363, "speaker": "Dan Khasis", "text": "Я пытаюсь объяснить тебе. Потому что ты все еще не понимаешь, как это работает. Они получают URL, URL, это страница.\n\nСтраница имеет комбинацию HTML, JavaScript для пилота, для девайса, который он использует. И потом они получают URL для этого девайса. Что мы можем сделать?\n\nОтключить URL для девайсов iOS.", "confidence": 0.2}
{"start": 9364, "end": 9365, "speaker": "Dan Khasis", "text": "Понятно.", "confidence": 0.72}
{"start": 9368, "end": 9370, "speaker": "Dan Khasis", "text": "Правильно, Гаспар?", "confidence": 0.93}
{"start": 9370, "end": 9402, "speaker": "Dan Khasis", "text": "Да. Ты не найдешь плохую первого пользователя опыта. Это идея для iOS.\n\nПотому что данный код не такой гладкий, как на Android. Нет прелодинга, это единственный проблема. Но экран мы имеем в том же случае.\n\nВторой раз открывается в том же случае. Другой вопрос. Мы должны поговорить о том, что мы предыдущим разговаривали, о увеличении рейтинга, потому что это хорошая возможность для пользователей.", "confidence": 0.0}
{"start": 9402, "end": 9404, "speaker": "Dan Khasis", "text": "Мы согласны с тобой. Я согласен, что мы должны это сделать, как ты это предложил.", "confidence": 0.72}
{"start": 9404, "end": 9447, "speaker": "Dan Khasis", "text": "И один важный элемент на экране это телефонный звонок. Если пользователь не только смотрит экран, но и выполняет звонок, после звонка мы можем спросить, как тебе понравилось, или что-то подобное. Или просто показывать рейтинг системы, чтобы рейтировать аппу.\n\nДело в том, что я хочу, чтобы он использовал апп достаточно, прежде чем спросил о рейтинге, потому что мы хотим хороший рейтинг. Поэтому мы должны положить некоторые условия, например, он открыл экран хотя бы 3 раза и выполнил звонок.", "confidence": 0.0}
{"start": 9478, "end": 9480, "speaker": "Kateryna Shevchenko", "text": "У меня со связью проблема.", "confidence": 0.71}
{"start": 9489, "end": 9496, "speaker": "Dan Khasis", "text": "Что такое?", "confidence": 0.24}
{"start": 9499, "end": 9502, "speaker": "Dan Khasis", "text": "White Labeling. Мы не позволяем это делать для клиентов White Labeling.", "confidence": 0.99}
{"start": 9508, "end": 9512, "speaker": "Dan Khasis", "text": "Да, White Labeling, я думаю, уже контролируется на сервере уже.", "confidence": 0.65}
{"start": 9516, "end": 9525, "speaker": "Dan Khasis", "text": "Да, мы не должны отредактировать их на нашу кастомную страницу, на нашу апп, иначе они будут ненавидеть клиента, который платит за белый маркер.", "confidence": 0.5}
{"start": 9526, "end": 9608, "speaker": "gaspar.eross", "text": "Да, я позвонил на сайте, ребята, об этом, когда они сделали поп-ап, что это важно, чтобы не разрушить белых маркеров. Так что после звонков, я думаю, это будет простая возможность показать систему, что он может рейтинговать аппликацию сразу, с одним кликом на пять или четыре старых, и это самое важное, этот рейтинг, как если бы он использовал целую апп. Другая идея будет связана с...\n\nТак что у нас есть телефонный звонок сейчас, и я думаю, что мы можем использовать WhatsApp интеграцию, возможно, а не просто смс. Иногда я получал в WhatsApp уведомление, что кто-то приедет.", "confidence": 0.04}
{"start": 9664, "end": 9666, "speaker": "Vova", "text": "Выглядит так, что он исчез.", "confidence": 0.95}
{"start": 9667, "end": 9669, "speaker": "gaspar.eross", "text": "Да, он отключен, как я вижу.", "confidence": 0.89}
{"start": 9709, "end": 9726, "speaker": "Vova", "text": "Так, это правильно, что после кликания ссылки в смс пользователь автоматически передвигается к Play Store, чтобы установить аппликацию без никаких кликов на страницу.", "confidence": 0.61}
{"start": 9728, "end": 9744, "speaker": "Vova", "text": "У него есть один клик на страницу, так что смс содержит... мы передавали тот же смс, страницу URL. Разница, что мы делаем, это что страница детектирует, если страница открыта с...", "confidence": 0.02}
{"start": 9744, "end": 9749.5, "speaker": "Vova", "text": "Да, страница открыта в браузере, правильно?", "confidence": 0.95}
{"start": 9749.5, "end": 9755.0, "speaker": "Vova", "text": "И она заряжается, детектирует, что это устройство, и передвигает вас сразу к Play Store.", "confidence": 0.95}
{"start": 9755, "end": 9758, "speaker": "gaspar.eross", "text": "Да, да, мы показали, что вы разработали.", "confidence": 0.93}
{"start": 9759, "end": 9764.75, "speaker": "Vova", "text": "И это передвигание происходит в браузере или в аппликации.", "confidence": 0.95}
{"start": 9764.75, "end": 9770.5, "speaker": "Vova", "text": "Вы передвигаются к аппликации или к странице.", "confidence": 0.95}
{"start": 9770.5, "end": 9776.25, "speaker": "gaspar.eross", "text": "Так что смс...", "confidence": 0.95}
{"start": 9776.25, "end": 9782.0, "speaker": "Vova", "text": "из смс вы кликаете ссылку, открываете страницу, и эта страница передвигает вас к Play Store аппликации.", "confidence": 0.95}
{"start": 9787.8, "end": 9792.6, "speaker": "gaspar.eross", "text": "Да, да, я понимаю.", "confidence": 0.95}
{"start": 9792.6, "end": 9797.4, "speaker": "gaspar.eross", "text": "И это проблема.", "confidence": 0.95}
{"start": 9802.2, "end": 9807.0, "speaker": "gaspar.eross", "text": "С точки зрения получателя он получает тот же смс, и он должен перейти на страницу в первую очередь, и оттуда он перейдет на донат.", "confidence": 0.95}
{"start": 9808, "end": 9815, "speaker": "gaspar.eross", "text": "Да, так что он не... Моя вопроса в том, что он даже не нужен, чтобы кликать на эту страницу. Она передвигает вас автоматически.", "confidence": 0.41}
{"start": 9820, "end": 9821, "speaker": "Vova", "text": "Он имеет зеленый кнопок.", "confidence": 0.99}
{"start": 9822, "end": 9824, "speaker": "Vova", "text": "А, зеленый кнопок. Инсталлапликация.", "confidence": 0.99}
{"start": 9825, "end": 9828.0, "speaker": "gaspar.eross", "text": "Да, что-то вроде этого, да.", "confidence": 0.95}
{"start": 9831.0, "end": 9834.0, "speaker": "Vova", "text": "Да, да, я понимаю.", "confidence": 0.95}
{"start": 9835, "end": 9838.0, "speaker": "Vova", "text": "Это была моя вопроса.", "confidence": 0.95}
{"start": 9838.0, "end": 9841.0, "speaker": "Vova", "text": "Так что здесь все еще есть кнопка, чтобы...", "confidence": 0.95}
{"start": 9841, "end": 9841, "speaker": "Vova", "text": "Да.", "confidence": 0.65}
{"start": 9842, "end": 9843, "speaker": "Vova", "text": "Чтобы перейти на страницу.", "confidence": 0.95}
{"start": 9851, "end": 9855, "speaker": "Vova", "text": "Потому что, если вы автоматически делаете это, он не понимает, что происходит.", "confidence": 0.65}
{"start": 9857, "end": 9867, "speaker": "Vova", "text": "Да. Здесь есть новый дизайн для этой страницы. Так что здесь есть код QR, чтобы получить приложение.\n\nКнопки, чтобы донатить.", "confidence": 0.56}
{"start": 9867, "end": 9870, "speaker": "Dan Khasis", "text": "Код QR абсолютно бесполезен на мобильном устройстве.", "confidence": 0.98}
{"start": 9871, "end": 9875, "speaker": "Dan Khasis", "text": "Нет, это страница для браузера. В случае, если вы...", "confidence": 0.6}
{"start": 9875, "end": 9876, "speaker": "Dan Khasis", "text": "Браузер, да. Браузер, да.", "confidence": 0.77}
{"start": 9881.67, "end": 9886.33, "speaker": "Vova", "text": "В этом случае код QR действительно вероятен.", "confidence": 0.95}
{"start": 9886.33, "end": 9891.0, "speaker": "Vova", "text": "Да, мы не показываем код QR на мобильном устройстве, только на дисктопе.", "confidence": 0.95}
{"start": 9892, "end": 9916, "speaker": "Dan Khasis", "text": "Я также хочу отметить, что, если мы не проверяем, кто вызывает, то код QR должен импортироваться в относительно UTM-соурс, канал или медиум. Потому что, если мы не знаем, откуда это приходит, это бесполезно. Потому что тогда мы не знаем, как люди доступят к нему.", "confidence": 0.53}
{"start": 9921, "end": 9930, "speaker": "Vova", "text": "На самом деле, это должно включить TrackerID, так что, если мы...", "confidence": 0.16}
{"start": 9930, "end": 9937, "speaker": "Vova", "text": "TrackerID не расскажет вам источник. Если он пришел из код код QR, нужно сказать UTM-соурс.", "confidence": 0.37}
{"start": 9938, "end": 9942, "speaker": "Vova", "text": "Так что, это должно включить оба UTM-соурса, номер трекера и ссылку на App Store.", "confidence": 0.99}
{"start": 9945, "end": 9954, "speaker": "Dan Khasis", "text": "И Google Store позволяет вам включить ваш Google Tracker, так что они держат атрибуцию для вас.", "confidence": 0.99}
{"start": 9957, "end": 9960, "speaker": "Vova", "text": "Так что, вам нравится эта страница?", "confidence": 0.95}
{"start": 9961, "end": 9980, "speaker": "Dan Khasis", "text": "Я еще не знаю, но на мобильном я думал, что у вас есть новый инстаграм-стиль дизайна, что вы решите проблемы там и запустите. Что случилось? Вы все еще не сделали?", "confidence": 0.55}
{"start": 9980, "end": 9986.0, "speaker": "Anton Khavanskii", "text": "Это очень большая функциональность, и в то же время мы должны поддержать оба версии дизайна, старую и новую.", "confidence": 0.95}
{"start": 9986.0, "end": 9992.0, "speaker": "Anton Khavanskii", "text": "Так что у нас очень много проблем, но мы на конец линии.", "confidence": 0.95}
{"start": 9993, "end": 9996.33, "speaker": "Dan Khasis", "text": "Но вы исправили с черным и белым текстом?", "confidence": 0.95}
{"start": 9996.33, "end": 9999.67, "speaker": "Dan Khasis", "text": "Могу повторить, пожалуйста?", "confidence": 0.95}
{"start": 9999.67, "end": 10003.0, "speaker": "Anton Khavanskii", "text": "Черный и белый текст.", "confidence": 0.95}
{"start": 10004, "end": 10004, "speaker": "Anton Khavanskii", "text": "Да.", "confidence": 0.65}
{"start": 10011, "end": 10075, "speaker": "Dan Khasis", "text": "Другая вещь, которая появится, которую вы должны знать, это очень важно, это два пути. Вы должны быть в состоянии планировать два пути для 20-летнего плана. Два пути и получение зарплаты через апп.\n\nМедианские бизнесы никогда не будут использовать апп, если мы не позволим им планировать два пути, если мы не позволим Делать другие вещи, которые предназначены для бизнеса. И еще один большой вопрос, Гаспор, что это? Множественные руты, и еще один, о котором мы разговаривали, помнишь?", "confidence": 0.32}
{"start": 10075, "end": 10079, "speaker": "Dan Khasis", "text": "Ты имеешь ввиду другие вещи, которые нужно улучшить, Брендан?", "confidence": 0.16}
{"start": 10079, "end": 10085, "speaker": "Dan Khasis", "text": "У нас есть еще один простой улучшитель, который мы будем добавлять. Я пытаюсь помнить.", "confidence": 0.96}
{"start": 10086, "end": 10093, "speaker": "gaspar.eross", "text": "Мы хотим, чтобы функциональность руты для траксов была улучшена.", "confidence": 0.99}
{"start": 10095, "end": 10096.33, "speaker": "Dan Khasis", "text": "Что?", "confidence": 0.95}
{"start": 10096.33, "end": 10097.67, "speaker": "Dan Khasis", "text": "Помнишь, что это было?", "confidence": 0.95}
{"start": 10097.67, "end": 10099.0, "speaker": "gaspar.eross", "text": "Руты для траксов.", "confidence": 0.95}
{"start": 10101, "end": 10107.5, "speaker": "Dan Khasis", "text": "Ты имеешь ввиду коммерческую руту?", "confidence": 0.95}
{"start": 10114.0, "end": 10120.5, "speaker": "gaspar.eross", "text": "У нас есть аппликация для обычных пользователей, но если кто-то хочет использовать обоих, мы не показываем возможность.", "confidence": 0.95}
{"start": 10120.5, "end": 10127.0, "speaker": "gaspar.eross", "text": "Так что это бы увеличило аттрактивность инханс-плана.", "confidence": 0.95}
{"start": 10129, "end": 10142, "speaker": "Dan Khasis", "text": "Сколько это стоит, чтобы начать продавать коммерческую руту для траксов в Раутформе, в 20-долларовый месячный план? Если мы хотели сказать, что если вы обгоняете 20 долларов в месяц, мы также дадим коммерческую руту.", "confidence": 0.1}
{"start": 10143, "end": 10150, "speaker": "Dan Khasis", "text": "Я не хочу придумать что-то новое, потому что у нас уже есть эти экраны на Раутформе для траксов. Антон, можешь предположить, что...", "confidence": 0.62}
{"start": 10151, "end": 10154, "speaker": "Dan Khasis", "text": "Да, ничего нового. Будет то же самое, но...", "confidence": 0.99}
{"start": 10154, "end": 10154, "speaker": "Dan Khasis", "text": "Да.", "confidence": 0.65}
{"start": 10155, "end": 10164, "speaker": "Dan Khasis", "text": "Потому что мы не хотим продавать руты и прочее в Раутформе для траксов. Раутформ для траксов, это адхок, это один-разовый продукт.", "confidence": 0.63}
{"start": 10167, "end": 10180, "speaker": "Dan Khasis", "text": "Да, но у нас есть экран на размеры траксов, и все установки, которые у нас уже есть. Поэтому мы должны как-то переместить это в Раутформе. Это моя вопроса Антону, сколько вы предполагаете?", "confidence": 0.07}
{"start": 10182, "end": 10187, "speaker": "Dan Khasis", "text": "Мы не должны делать предположения сейчас. Я думаю, вопрос будет задан больше того, сколько это займет.", "confidence": 0.99}
{"start": 10188, "end": 10194, "speaker": "Dan Khasis", "text": "Я не понял, почему мы должны переместить все функционалы от Раутформа для траксов к Раутформе. Я думаю, что это означает...", "confidence": 0.33}
{"start": 10194, "end": 10196, "speaker": "Dan Khasis", "text": "Я не сказал этого, мы не сказали этого.", "confidence": 0.65}
{"start": 10196, "end": 10203, "speaker": "Anton Khavanskii", "text": "Да, поэтому нам просто нужно включить Раутформе для траксов в Раутформе для траксов, правильно?", "confidence": 0.53}
{"start": 10204, "end": 10219, "speaker": "Dan Khasis", "text": "Нет. Окей. Нет, мы хотим будущего, что у нас на Раутформе для траксов, где пользователь может кастомизировать размеры тракса, и мы берем это в считание в навигации.\n\nУ нас нет этого на Раутформе.", "confidence": 0.07}
{"start": 10219, "end": 10256, "speaker": "Dan Khasis", "text": "Раутформе только делает обычные гражданские машины, и нам нужно, чтобы Раутформе делал траксов тоже. И, может быть, для... Почему это очень важно?\n\nПотому что Раутформ для траксов не имеет адрес-бук, Раутформ для траксов не имеет концепт о спасении траксов, оценивании траксов, исследовании траксов, ордер, ордерное управление, тракинг. У него нет никаких этих. Рута для машин — это копия Google Maps, а рута для меня — это полноценный продукт для последних километров.\n\nМожет, цена от 20 до 30 долларов, а может, мы сделаем еще один план за 30 долларов, и в этом плане они могут делать коммерческую машину.", "confidence": 0.18}
{"start": 10259, "end": 10275, "speaker": "Dan Khasis", "text": "Я думаю, мы можем сделать это, потому что у нас уже есть новая версия навигации, которая очень хорошая и красивая. И мы разработали новую архитектуру для этого, так что это не проблема, чтобы включить новые функции здесь.", "confidence": 0.09}
{"start": 10276, "end": 10299, "speaker": "Dan Khasis", "text": "Но главная разница в том, что вы уже делаете коммерческую машинную навигацию в Руте для меня для компаний, которые являются подписчиками корпоратива. Если планировали руту с профилем автомобиля для коммерческой машины, вы уже позволили людям навигировать с коммерческой машиной в Руте для меня в обычной аппликации?", "confidence": 0.63}
{"start": 10301, "end": 10307, "speaker": "Dan Khasis", "text": "Это правильно, потому что мы получаем параметры, и мы вводим эти параметры сразу в навигацию.", "confidence": 0.77}
{"start": 10307, "end": 10324, "speaker": "Dan Khasis", "text": "Так что единственная разница в том, что мы должны позволить им получить те же параметры из ввода пользователя, а не только из ввода издателя и большого босса в главной аппаратуре. Это единственная разница.", "confidence": 0.28}
{"start": 10325, "end": 10336, "speaker": "gaspar.eross", "text": "Да, и это может быть отдельный план за 30 долларов или просто часть существующего, это ваша решение.", "confidence": 0.05}
{"start": 10337, "end": 10342, "speaker": "Dan Khasis", "text": "Да, я не знаю ответа на это, но мне кажется, что это дороже, чем 20 долларов.", "confidence": 0.89}
{"start": 10344, "end": 10347, "speaker": "Dan Khasis", "text": "Да, потому что это доступно только для маркетинговых пользователей сейчас.", "confidence": 0.39}
{"start": 10356, "end": 10424, "speaker": "Dan Khasis", "text": "Тогда мы просто должны синхронизировать в мобильную аппликацию все вещи, которые у нас уже есть, или, например, APIs. Если API выполняет трактирование автомобиля, мы это делаем. Если API выполняет трактирование автомобиля, мы это делаем.\n\nТогда кто-то на iPad может открыть апплику и очень легко и очень комфортно с iPad. Он может работать весь бизнес, и это часть нашего клиента. Работать в бизнесе на iPad за 150 долларов, 100 долларов в месяц, без разговора с маркетинговым пользователем.\n\nОкей, последний вопрос. Apple CarPlay. Что это за история?", "confidence": 0.19}
{"start": 10425, "end": 10451, "speaker": "Vova", "text": "Мы подготовили дизайны, и я думаю, что они в порядке сейчас. Я могу поделиться. Это для CarPlay iOS-версии, и где-то там было Android тоже.", "confidence": 0.57}
{"start": 10456, "end": 10479, "speaker": "Dan Khasis", "text": "Мы должны подавить комплименты Apple, и Apple должен дать нам согласие, иначе это не будет работать.", "confidence": 0.31}
{"start": 10480, "end": 10489, "speaker": "Dan Khasis", "text": "Да, Вова, ты проверил какие-то документы о ограничениях? Я читал об этом раньше, но несколько лет назад это было очень строго.", "confidence": 0.29}
{"start": 10489, "end": 10528, "speaker": "Vova", "text": "Да, есть ограничения на то, как большие кнопки должны быть, и на интеракции. Некоторые старые машины не поддерживают движения, поэтому эти аппликации должны быть контролируемыми через физические кнопки. Некоторые машины не поддерживают движения или даже кнопки.\n\nСкрины иногда просто не интерактируют. Поэтому для обратной контролировки должны быть физические кнопки.", "confidence": 0.22}
{"start": 10532, "end": 10549, "speaker": "Dan Khasis", "text": "Я получил информацию в почту от людей, которые подтвердили ограничения на CarPlay. Я позвонил им 1-2 года назад, и они умерли после этого. Я попробую найти это, и я отправлю это обратно.", "confidence": 0.6}
{"start": 10549, "end": 10575, "speaker": "Vova", "text": "Также у нас есть приложение для смартфонов, которое поможет вам оставаться на счете. В основном, это ряд разных типов таймеров и уведомлений.", "confidence": 0.35}
{"start": 10576, "end": 10589, "speaker": "Dan Khasis", "text": "Хорошо. Следующая вопрос. Последний вопрос был о CarPlay, но такой же как и для Apple, для Android, я имею в виду.", "confidence": 0.4}
{"start": 10590, "end": 10611, "speaker": "Dan Khasis", "text": "Да, в основном, разница между CarPlay и Apple Car, это то, что Apple имеет навигацию на левой стороне, а Google имеет навигацию на нижней стороне. Но принципы совсем одинаковые.", "confidence": 0.09}
{"start": 10620, "end": 10629, "speaker": "Dan Khasis", "text": "Я просто говорю о том, с кем мы связываемся и т.д. Должны ли мы сделать специальные оправдания? Или это просто регулярный запуск, Гаспар?", "confidence": 0.41}
{"start": 10632, "end": 10640.38, "speaker": "Dan Khasis", "text": "Я думаю, что это регулярный запуск.", "confidence": 0.95}
{"start": 10682.25, "end": 10690.62, "speaker": "gaspar.eross", "text": "Я не знаю, как работает WhatsApp в этом случае, но может быть это возможность не только посылать смс, но и WhatsApp-мессажи с предполагаемым доходом времени.", "confidence": 0.95}
{"start": 10718, "end": 10720.5, "speaker": "Dan Khasis", "text": "Здравствуйте.", "confidence": 0.95}
{"start": 10720.5, "end": 10723.0, "speaker": "Dan Khasis", "text": "Здравствуйте.", "confidence": 0.95}
{"start": 10724, "end": 10726.67, "speaker": "Dan Khasis", "text": "Да.", "confidence": 0.95}
{"start": 10726.67, "end": 10729.33, "speaker": "Dan Khasis", "text": "Да, Wi-Fi вернулся и реставрировал.", "confidence": 0.95}
{"start": 10733, "end": 10752, "speaker": "gaspar.eross", "text": "Да, так что я думал о другой возможности, как мы могли увеличить запуск. Потому что, да, я понимаю, что блокировка, поэтому мы должны платить много, чтобы посылать смс, и мы не можем сделать это для каждого. Но что насчет посылки WhatsApp-мессажей автоматически?", "confidence": 0.17}
{"start": 10752, "end": 10755.33, "speaker": "Dan Khasis", "text": "Если они позволяют, если они позволяют, и это бесплатно, то делайте, конечно.", "confidence": 0.95}
{"start": 10755.33, "end": 10758.67, "speaker": "Dan Khasis", "text": "Но я не знаю, как.", "confidence": 0.95}
{"start": 10758.67, "end": 10762.0, "speaker": "Dan Khasis", "text": "Вы должны нам сказать, как.", "confidence": 0.95}
{"start": 10763, "end": 10769.25, "speaker": "gaspar.eross", "text": "Хорошо, я проверю.", "confidence": 0.95}
{"start": 10781.75, "end": 10788.0, "speaker": "Dan Khasis", "text": "Мы можем сделать почту бесплатно.", "confidence": 0.95}
{"start": 10789, "end": 10792, "speaker": "Dan Khasis", "text": "Ну, почему мы не делаем почту? Мы можем делать почту бесплатно.", "confidence": 0.97}
{"start": 10793, "end": 10795, "speaker": "Dan Khasis", "text": "Да, но шансов на почту гораздо ниже.", "confidence": 0.99}
{"start": 10796, "end": 10804, "speaker": "Dan Khasis", "text": "Но я говорю, мы можем все еще сделать. Это все еще лучше, чем 0. Вот что я имею в виду.\n\nНо мы не делаем, верно?", "confidence": 0.96}
{"start": 10806, "end": 10812, "speaker": "Dan Khasis", "text": "Да, но я вижу две проблемы. С одной стороны, это может выглядеть как спам, посылки по почте бесплатно.", "confidence": 0.26}
{"start": 10812, "end": 10827, "speaker": "Dan Khasis", "text": "Это нормально, но вы говорите разные вещи. Я говорю, что вы сказали, что бесплатно, и что мы можем сделать, чтобы сделать это быстрее, и я говорю, что почту бесплатно, и мы можем сделать WhatsApp тоже, но пусть клиент, пусть парень выберет.", "confidence": 0.08}
{"start": 10828, "end": 10829, "speaker": "Dan Khasis", "text": "Понятно.", "confidence": 0.21}
{"start": 10829, "end": 10833.5, "speaker": "Dan Khasis", "text": "Работа в том, чтобы клиент не звонил ему в руку и раздавал его, верно?", "confidence": 0.95}
{"start": 10833.5, "end": 10838.0, "speaker": "Dan Khasis", "text": "Как, эй, где ты, парень, где ты?", "confidence": 0.95}
{"start": 10838.0, "end": 10842.5, "speaker": "Dan Khasis", "text": "Моя жена ждет тебя, где ты, парень?", "confidence": 0.95}
{"start": 10842.5, "end": 10847.0, "speaker": "gaspar.eross", "text": "Моя мама идет в больницу, где ты?", "confidence": 0.95}
{"start": 10869.5, "end": 10874.0, "speaker": "Dan Khasis", "text": "Или мы закончили?", "confidence": 0.95}
{"start": 10875, "end": 10884, "speaker": "Semeyon S", "text": "Дэн, я хотел бы вашу помощь или совет на приоритеты для Web-продуктов, если у вас есть 5 или 10 минут.", "confidence": 0.99}
{"start": 10885, "end": 10912, "speaker": "Dan Khasis", "text": "Ну, главное, что мы должны запустить стратегический планировочный план с визором, потому что это единственный способ, как мы будем его продавать. Первая партия, я бы сказал, для BloomNet, мы должны исправить то, что мы не сможем сделать без Игоря, чтобы они могли видеть заказы на разных магазинах, которые располагаются на визорах. То же самое.\n\nВизор на визоре будет решать проблему с BloomNet.", "confidence": 0.22}
{"start": 10916, "end": 10921.56, "speaker": "Semeyon S", "text": "Хорошо.", "confidence": 0.95}
{"start": 10921.56, "end": 10927.11, "speaker": "Semeyon S", "text": "Симплаплодер уже на производстве.", "confidence": 0.95}
{"start": 10927.11, "end": 10932.67, "speaker": "Dan Khasis", "text": "Мы все еще полируем, но моя вопрос касается...", "confidence": 0.95}
{"start": 10949.33, "end": 10954.89, "speaker": "Semeyon S", "text": "Также команда должна закончить таймлайн для визоров и функциональность мап.", "confidence": 0.95}
{"start": 10954.89, "end": 10960.44, "speaker": "Semeyon S", "text": "У нас много вещей.", "confidence": 0.95}
{"start": 10966, "end": 10969.43, "speaker": "Dan Khasis", "text": "Ты говоришь о том, что будет нам больше денег, чем необходимое с точки зрения технологии?", "confidence": 0.95}
{"start": 10969.43, "end": 10972.86, "speaker": "Dan Khasis", "text": "Да.", "confidence": 0.95}
{"start": 10972.86, "end": 10976.29, "speaker": "Dan Khasis", "text": "Что будет нам больше денег?", "confidence": 0.95}
{"start": 10976.29, "end": 10979.71, "speaker": "Dan Khasis", "text": "Да.", "confidence": 0.95}
{"start": 10979.71, "end": 10983.14, "speaker": "Semeyon S", "text": "Стратегический планировочный план будет номер один.", "confidence": 0.95}
{"start": 10983.14, "end": 10986.57, "speaker": "Dan Khasis", "text": "Мы проверим цену и увидим, что случится.", "confidence": 0.95}
{"start": 10986.57, "end": 10990.0, "speaker": "Dan Khasis", "text": "Также...", "confidence": 0.95}
{"start": 10994, "end": 10998.5, "speaker": "Dan Khasis", "text": "Как это называется?", "confidence": 0.95}
{"start": 10998.5, "end": 11003.0, "speaker": "Semeyon S", "text": "Маппинг.", "confidence": 0.95}
{"start": 11004, "end": 11048, "speaker": "Dan Khasis", "text": "Маппинг. Маппинг, который решает проблему с большими клиентами, которые пытаются... Мы пытаемся решить это для InReach.\n\nУ нас есть компания, которая обеспечивает обеспечивающие разрешения. Я бы сказал, что это номер один. И я бы сказал, что стратегический планировочный план номер два, а цена номер три.\n\nЕсли мы говорим о веб-продакте. И то, что мы запустим все, чтобы закончить маленькие снапшоты. Это как интервью.\n\nЗакончите с снапшотами.", "confidence": 0.37}
{"start": 11049, "end": 11051.78, "speaker": "Dan Khasis", "text": "У вас уже есть...", "confidence": 0.95}
{"start": 11051.78, "end": 11054.56, "speaker": "Dan Khasis", "text": "У вас уже есть все.", "confidence": 0.95}
{"start": 11054.56, "end": 11057.33, "speaker": "Semeyon S", "text": "Хорошо.", "confidence": 0.95}
{"start": 11057.33, "end": 11060.11, "speaker": "Semeyon S", "text": "Понял.", "confidence": 0.95}
{"start": 11060.11, "end": 11062.89, "speaker": "Semeyon S", "text": "Я буду оформлять приоритеты в моем документе, основанном на ваших словах.", "confidence": 0.95}
{"start": 11062.89, "end": 11065.67, "speaker": "Semeyon S", "text": "И...", "confidence": 0.95}
{"start": 11065.67, "end": 11068.44, "speaker": "Semeyon S", "text": "Мы возьмем правильные действия.", "confidence": 0.95}
{"start": 11068.44, "end": 11071.22, "speaker": "Semeyon S", "text": "Хорошо, но что еще у вас?", "confidence": 0.95}
{"start": 11075, "end": 11081.0, "speaker": "Semeyon S", "text": "Я имею в виду, что у меня есть миллион вещей, которые еще не закончены.", "confidence": 0.95}
{"start": 11093.0, "end": 11099.0, "speaker": "Dan Khasis", "text": "И мы платим за это, а они не платят нам.", "confidence": 0.95}
{"start": 11111.0, "end": 11117.0, "speaker": "Dan Khasis", "text": "И они разрушают наш датабас используя функции номер три.", "confidence": 0.95}
{"start": 11117.0, "end": 11123.0, "speaker": "Dan Khasis", "text": "И у нас есть мобильная апп, которая может получить план номер два, функции номер три, но не использует их, все потому, что они не отправляют еще одного варианта в оптимизацию запроса, или сколько частей.", "confidence": 0.95}
{"start": 11123.0, "end": 11129.0, "speaker": "Dan Khasis", "text": "Мы хотим вставить их в путь, что страшно.", "confidence": 0.95}
{"start": 11129.0, "end": 11135.0, "speaker": "Dan Khasis", "text": "Это все асинхронно, это все пушерно, все точно так же, и мы все еще не получаем правильное решение, даже если все идентичны.", "confidence": 0.95}
{"start": 11148, "end": 11179, "speaker": "Semeyon S", "text": "Хорошо. Я все еще планирую добавить бэк-энда к этому документу, начать проверять его, и расширить его. Вообще, как вы видите, у меня много вещей здесь.\n\nПоэтому я спрашиваю за вашу помощь здесь, сейчас, потому что я немного облегчен много вещей. Но сейчас все намного яснее. Подождите секунду.", "confidence": 0.62}
{"start": 11191, "end": 11192, "speaker": "Dan Khasis", "text": "Проверяйте что-то.", "confidence": 0.45}
{"start": 11230, "end": 11247, "speaker": "Dan Khasis", "text": "Я имею в виду, что Мини-Мелт в реальном состоянии, но это будет в октябре. Они проводят недельные мероприятия, и они очень беспокоятся об САПе. О том, что мы уже провели часы на это.", "confidence": 0.23}
{"start": 11251, "end": 11261, "speaker": "Dan Khasis", "text": "Да, мы это сделали, и я думал, что это имеет довольно высокую приоритетность.", "confidence": 0.24}
{"start": 11264, "end": 11268, "speaker": "Dan Khasis", "text": "Да, но обслуживание — это несколько часов работы, возможно, день.", "confidence": 0.99}
{"start": 11269, "end": 11274, "speaker": "Semeyon S", "text": "Ну, это зависит от того, чтобы только несколько минут.", "confidence": 0.22}
{"start": 11274, "end": 11282.0, "speaker": "Dan Khasis", "text": "Для обслуживания.", "confidence": 0.95}
{"start": 11282.0, "end": 11290.0, "speaker": "Dan Khasis", "text": "Да, обслуживание — это простая вещь, которая имеет тысячу плюсов.", "confidence": 0.95}
{"start": 11290.0, "end": 11298.0, "speaker": "Dan Khasis", "text": "Стратегический планер, если мы могли сделать это с JSON-файлами, то это уже стаж 4, а последний стаж — визирд.", "confidence": 0.95}
{"start": 11302, "end": 11309, "speaker": "Semeyon S", "text": "JSON-файл уже на производстве. Мы все еще полируем... Вы должны научить...", "confidence": 0.99}
{"start": 11309, "end": 11314, "speaker": "Semeyon S", "text": "Вы должны научить Максу Пирогову первую очередь, как его использовать.", "confidence": 0.9}
{"start": 11315, "end": 11317, "speaker": "Semeyon S", "text": "Макс и...", "confidence": 0.99}
{"start": 11317, "end": 11318.75, "speaker": "Dan Khasis", "text": "И Паулу.", "confidence": 0.95}
{"start": 11318.75, "end": 11320.5, "speaker": "Dan Khasis", "text": "Да.", "confidence": 0.95}
{"start": 11320.5, "end": 11322.25, "speaker": "Dan Khasis", "text": "И ребят, которые...", "confidence": 0.95}
{"start": 11322.25, "end": 11324.0, "speaker": "Dan Khasis", "text": "которые...", "confidence": 0.95}
{"start": 11326, "end": 11404, "speaker": "Semeyon S", "text": "У нас будет звонок завтра, и мы обсудим все это. Обслуживание было вчера или сегодня, я не помню, так что все готово для научения людей, и так далее. Может, мы сделаем несколько небольших обновлений, небольшие обновления.\n\nИ я думаю, что, в основном, мы готовы идти дальше, на мапы или еще что-то, если Вова готов, конечно. Он еще не проверил его разработки, и так далее. Но, как я слышал, это...\n\nЭто высокая приоритетность, но не супер-высокая приоритетность. Так что мы можем продолжать на следующей неделе, основываясь на фидбэке и так далее. Но Bloom.Net, обслуживание, цены, снапшоты. Без снапшотов тоже высокая приоритетность, но снапшоты я проверю завтра, и сап тоже.", "confidence": 0.38}
{"start": 11405, "end": 11434, "speaker": "Dan Khasis", "text": "Так что все остальное... Ситуация с снапшотами, что это буквально один и тот же API с копией и копировкой один и тот же темплит. Это все.\n\nПоэтому я заинтересован в том, почему это не копия и копировка.", "confidence": 0.27}
{"start": 11438, "end": 11443.5, "speaker": "Semeyon S", "text": "В основном, это так.", "confidence": 0.95}
{"start": 11443.5, "end": 11449.0, "speaker": "Semeyon S", "text": "Так что снапшоты по местам в прогрессе сейчас, и это должно быть...", "confidence": 0.95}
{"start": 11449, "end": 11451, "speaker": "Dan Khasis", "text": "Если ты в факультете, ты не знаешь, какие заказы у тебя есть.", "confidence": 0.99}
{"start": 11477.33, "end": 11483.67, "speaker": "Semeyon S", "text": "Так что, например, я могу перейти на Upwork на ассеты на UI, и эта функциональность очень низкий риск.", "confidence": 0.95}
{"start": 11483.67, "end": 11490.0, "speaker": "Semeyon S", "text": "Это хорошая новость.", "confidence": 0.95}
{"start": 11490.0, "end": 11496.33, "speaker": "Semeyon S", "text": "Снапшоты готовы на месяц.", "confidence": 0.95}
{"start": 11496.33, "end": 11502.67, "speaker": "Semeyon S", "text": "Снапшоты компании готовы на долгое время.", "confidence": 0.95}
{"start": 11510, "end": 11513, "speaker": "Vova", "text": "Мы говорим о программах, а не о дизайнерах.", "confidence": 0.13}
{"start": 11513, "end": 11521.5, "speaker": "Semeyon S", "text": "Да.", "confidence": 0.95}
{"start": 11521.5, "end": 11530.0, "speaker": "Semeyon S", "text": "И вещи как ассеты и бизнес и так далее.", "confidence": 0.95}
{"start": 11538.5, "end": 11547.0, "speaker": "Semeyon S", "text": "По крайней мере, пока.", "confidence": 0.95}
{"start": 11547, "end": 11552.82, "speaker": "Semeyon S", "text": "Хорошо.", "confidence": 0.95}
{"start": 11576.09, "end": 11581.91, "speaker": "Dan Khasis", "text": "Мы даже не имеем концепта географии.", "confidence": 0.95}
{"start": 11581.91, "end": 11587.73, "speaker": "Dan Khasis", "text": "Да, вы можете запустить это.", "confidence": 0.95}
{"start": 11587.73, "end": 11593.55, "speaker": "Dan Khasis", "text": "Ассоциативный тип не имеет, вы можете запустить это тоже.", "confidence": 0.95}
{"start": 11593.55, "end": 11599.36, "speaker": "Dan Khasis", "text": "Но у нас нужно добавить бизнес-унит.", "confidence": 0.95}
{"start": 11599.36, "end": 11605.18, "speaker": "Dan Khasis", "text": "Я не знаю, почему у нас его нет, но пользовательский снапшот.", "confidence": 0.95}
{"start": 11605.18, "end": 11611.0, "speaker": "Dan Khasis", "text": "Я бы сказал, что пользовательский снапшот это, наверное, номер один, а затем следует факультет, потому что вы должны посмотреть, что этот парень делает.", "confidence": 0.95}
{"start": 11616.5, "end": 11620.0, "speaker": "Semeyon S", "text": "Мне нужно проверить.", "confidence": 0.95}
{"start": 11620, "end": 11624, "speaker": "Dan Khasis", "text": "Это на производстве. Что ты имеешь в виду? Посмотрим.\n\nЭто на производстве. Готово.", "confidence": 0.99}
{"start": 11625, "end": 11635, "speaker": "Dan Khasis", "text": "Это аккаунт Артура, поэтому у него много вещей, которые еще не выпущены. Поэтому мне нужно проверить.", "confidence": 0.21}
{"start": 11635, "end": 11642, "speaker": "Dan Khasis", "text": "Да, но UI немного испорчена. Посмотрите на картинку в верхнем левом, но для большинства это достаточно хорошее.", "confidence": 0.23}
{"start": 11643, "end": 11651, "speaker": "Dan Khasis", "text": "У него много проблем, особенно касательно левого колонны, но колонна дороги тоже пропадает.", "confidence": 0.9}
{"start": 11652, "end": 11655.56, "speaker": "Dan Khasis", "text": "Кроме того, мы должны запустить.", "confidence": 0.95}
{"start": 11655.56, "end": 11659.11, "speaker": "Semeyon S", "text": "Да.", "confidence": 0.95}
{"start": 11673.33, "end": 11676.89, "speaker": "Semeyon S", "text": "Я вижу.", "confidence": 0.95}
{"start": 11676.89, "end": 11680.44, "speaker": "Dan Khasis", "text": "API там уже 10 лет.", "confidence": 0.95}
{"start": 11680.44, "end": 11684.0, "speaker": "Dan Khasis", "text": "Мы просто должны обеспечить лейеры.", "confidence": 0.95}
{"start": 11684, "end": 11692.2, "speaker": "Dan Khasis", "text": "Да, но мой план немного другой.", "confidence": 0.95}
{"start": 11700.4, "end": 11708.6, "speaker": "Semeyon S", "text": "И после этого он должен перемещать этот компонент на все другие страницы, которые должны иметь мапу.", "confidence": 0.95}
{"start": 11708.6, "end": 11716.8, "speaker": "Semeyon S", "text": "Это не будет идеальным.", "confidence": 0.95}
{"start": 11716.8, "end": 11725.0, "speaker": "Semeyon S", "text": "Может, мы сменим что-то для обратной компетенции, но хотя бы сегодня я не могу выпустить мапу машин, потому что это ужасно.", "confidence": 0.95}
{"start": 11726, "end": 11731.75, "speaker": "Dan Khasis", "text": "Что о Гаспаре?", "confidence": 0.95}
{"start": 11731.75, "end": 11737.5, "speaker": "Semeyon S", "text": "Он уже не здесь.", "confidence": 0.95}
{"start": 11737.5, "end": 11743.25, "speaker": "Dan Khasis", "text": "Мы можем поговорить по-русски.", "confidence": 0.95}
{"start": 11743.25, "end": 11749.0, "speaker": "Dan Khasis", "text": "Семен, как насчет этого мапа машин?", "confidence": 0.95}
{"start": 11749.0, "end": 11754.75, "speaker": "Dan Khasis", "text": "Просто лейер, не отдельная страница, а как бы в настройках карты просто показать последнюю иконку последних точек этих машин.", "confidence": 0.95}
{"start": 11754.75, "end": 11760.5, "speaker": "Dan Khasis", "text": "И все.", "confidence": 0.95}
{"start": 11760.5, "end": 11766.25, "speaker": "Dan Khasis", "text": "И на этом дело закончилось.", "confidence": 0.95}
{"start": 11766.25, "end": 11772.0, "speaker": "Dan Khasis", "text": "У вас же есть для юзеров код для Vehicles или наизнанку?", "confidence": 0.95}
{"start": 11773, "end": 11808, "speaker": "Semeyon S", "text": "Да так и сделаем. Нам проще вот этот большой компонент карты, нам проще его просто будет двигать и включать, выключать. И я просто хочу, чтобы человек сел и от карт там несколько недель вообще не отходил по всей системе Евгений.\n\nВот. Тем более материалов кучу собрали и потом итеративно доделывать необходимую функцию.", "confidence": 0.72}
{"start": 11808, "end": 11817.0, "speaker": "Semeyon S", "text": "Семен, у меня есть быстрый вопрос насчет оптимизации снапшота.", "confidence": 0.95}
{"start": 11817.0, "end": 11826.0, "speaker": "Dan Khasis", "text": "В оптимизации снапшоте у нас есть нам нужно в принципе поставить мы так и не закончили там дизайн корявый был последний раз.", "confidence": 0.95}
{"start": 11826.0, "end": 11835.0, "speaker": "Dan Khasis", "text": "Левое меню было полное полностью неприемлемое.", "confidence": 0.95}
{"start": 11836, "end": 11844, "speaker": "Semeyon S", "text": "Да, остановились на том, что настройки надо переработать и перенести в табу. Но до этого руки не дошли.", "confidence": 0.99}
{"start": 11846, "end": 11854, "speaker": "Dan Khasis", "text": "Да, но и в оптимизации снапшот надо Read-only map всех маршрутов, которые были сгенерированы.", "confidence": 0.99}
{"start": 11855, "end": 11861, "speaker": "Semeyon S", "text": "Да, мы хотели это вот где-то во второй версию выкатывать после настроек.", "confidence": 0.99}
{"start": 11862, "end": 11890, "speaker": "Dan Khasis", "text": "И потом другая вещь, это Артуру особенно надо прислушаться это выключить это включить редактор оптимизации кнопку для Legacy редактор кнопку оптимизации только для некоторых юзеров. То есть мы хотим выключить Legacy оптимизация всем, кроме 5 или 10 человек которые Parker вам даст список.", "confidence": 0.95}
{"start": 11893, "end": 11894, "speaker": "Artur Moskalenko", "text": "Окей.", "confidence": 0.91}
{"start": 11898, "end": 11907, "speaker": "Dan Khasis", "text": "И потом уже сделаем полноценный в сентябре, октябре, августе, то есть ноябре оптимизация.", "confidence": 0.96}
{"start": 11921, "end": 11925.19, "speaker": "Semeyon S", "text": "Окей, спасибо.", "confidence": 0.95}
{"start": 11925.19, "end": 11929.38, "speaker": "Semeyon S", "text": "Собственно вот этот момент я хотел уточнить.", "confidence": 0.95}
{"start": 11929.38, "end": 11933.56, "speaker": "Semeyon S", "text": "Нам тут еще совсем чуть-чуть осталось чтобы допихать таймлайн и карту.", "confidence": 0.95}
{"start": 11933.56, "end": 11937.75, "speaker": "Semeyon S", "text": "А что еще от этого?", "confidence": 0.95}
{"start": 11937.75, "end": 11941.94, "speaker": "Dan Khasis", "text": "Диспетч борда и автоассаймент алгоритмов и так далее?", "confidence": 0.95}
{"start": 11941.94, "end": 11946.12, "speaker": "Semeyon S", "text": "Автоассаймент.", "confidence": 0.95}
{"start": 11946.12, "end": 11950.31, "speaker": "Semeyon S", "text": "На Апишечке первый, второй алгоритм готовы.", "confidence": 0.95}
{"start": 11950.31, "end": 11954.5, "speaker": "Semeyon S", "text": "У нас конкретно на фронт-энд сейчас рук не хватает это доделать.", "confidence": 0.95}
{"start": 11954.5, "end": 11958.69, "speaker": "Semeyon S", "text": "Но вот это как раз сейчас попробую наверное через Апфорк.", "confidence": 0.95}
{"start": 11958.69, "end": 11962.88, "speaker": "Semeyon S", "text": "Потому что старые есть, макапы есть.", "confidence": 0.95}
{"start": 11962.88, "end": 11967.06, "speaker": "Semeyon S", "text": "Все описано в общем-то нормально.", "confidence": 0.95}
{"start": 11967.06, "end": 11971.25, "speaker": "Semeyon S", "text": "Можно это в виде одной задачи отправлять.", "confidence": 0.95}
{"start": 11971.25, "end": 11975.44, "speaker": "Semeyon S", "text": "Плюс еще небольшие изменения на ассайменте.", "confidence": 0.95}
{"start": 11975.44, "end": 11979.62, "speaker": "Semeyon S", "text": "С диспатчем там посложнее.", "confidence": 0.95}
{"start": 11979.62, "end": 11983.81, "speaker": "Semeyon S", "text": "Там побольше работы.", "confidence": 0.95}
{"start": 11983.81, "end": 11988.0, "speaker": "Semeyon S", "text": "И еще не успели описать изменения, которые нужно внести.", "confidence": 0.95}
{"start": 11992, "end": 12000.0, "speaker": "Dan Khasis", "text": "Если тот эшборд, если все, что он делает, это дает людям просто извлекать наш Legacy IP, который меняет дату или юзера, или веикола.", "confidence": 0.95}
{"start": 12000.0, "end": 12008.0, "speaker": "Dan Khasis", "text": "Давай запускать, нам не нужны защиты, нам не нужны альерты, нам никуда не надо.", "confidence": 0.95}
{"start": 12008, "end": 12011, "speaker": "Dan Khasis", "text": "Это тоже самая кнопка как Assign User, Assign Vehicle.", "confidence": 0.99}
{"start": 12013, "end": 12016, "speaker": "Dan Khasis", "text": "Просто ты ее извлекаешь из другого места.", "confidence": 0.99}
{"start": 12017, "end": 12019.33, "speaker": "Semeyon S", "text": "Ты сейчас про ассаймент или про диспатч-борд?", "confidence": 0.95}
{"start": 12019.33, "end": 12021.67, "speaker": "Dan Khasis", "text": "И то, и то.", "confidence": 0.95}
{"start": 12021.67, "end": 12024.0, "speaker": "Semeyon S", "text": "Ассаймент первой версии уже зарелижена.", "confidence": 0.95}
{"start": 12025, "end": 12028.25, "speaker": "Dan Khasis", "text": "Да, но почему-то я не вижу...", "confidence": 0.95}
{"start": 12028.25, "end": 12031.5, "speaker": "Dan Khasis", "text": "Когда вы говорите зарелижено, и потом я узнаю через три месяца, что никто вообще нихуя не знает ни о чем.", "confidence": 0.95}
{"start": 12031.5, "end": 12034.75, "speaker": "Dan Khasis", "text": "Потому что оказывается, что это спрятано всем.", "confidence": 0.95}
{"start": 12034.75, "end": 12038.0, "speaker": "Dan Khasis", "text": "И никому она не доступна.", "confidence": 0.95}
{"start": 12039, "end": 12049.8, "speaker": "Artur Moskalenko", "text": "Нет, мы прошли на протяжении недели постепенно включали пакеты сначала небольшие, актуальные, вот эти v2, и буквально вчера-сегодня закончили включать это top priority категории, включать.", "confidence": 0.95}
{"start": 12049.8, "end": 12060.6, "speaker": "Artur Moskalenko", "text": "То есть вот этот ассаймент-модуль, он сейчас все релевантные подписки включен.", "confidence": 0.95}
{"start": 12060.6, "end": 12071.4, "speaker": "Artur Moskalenko", "text": "Если зайти там либо сделать новый аккаунт, либо зайти на чей-то кастомерский, то он будет ассаймент.", "confidence": 0.95}
{"start": 12071.4, "end": 12082.2, "speaker": "Semeyon S", "text": "Ну, у нас все равно есть проблема, что участие аккаунтов, в том числе крупных, кастомных и white labels, что вообще непредсказуемый набор продуктов включен.", "confidence": 0.95}
{"start": 12082.2, "end": 12093.0, "speaker": "Semeyon S", "text": "Это еще надо посидеть и разбираться.", "confidence": 0.95}
{"start": 12094, "end": 12114, "speaker": "Dan Khasis", "text": "Мы хотим это всем главным нашим стандартным покупателям. Если там, например, это azuga, и у них есть по контракту особый набор функционала или bloom.net, мы не хотим этим людям это включать просто так, потому что мы тогда больше денег не сможем у них собрать.", "confidence": 0.99}
{"start": 12116, "end": 12125.5, "speaker": "Artur Moskalenko", "text": "У нас сегодня как раз звонок будет с Патриком, вот, чтобы в этот момент indirect, по вот этим вот аккаунтам утешить.", "confidence": 0.95}
{"start": 12125.5, "end": 12135.0, "speaker": "Artur Moskalenko", "text": "Ты не должен слушать, что он тебе говорит.", "confidence": 0.95}
{"start": 12136, "end": 12275, "speaker": "Dan Khasis", "text": "Давай начнем с этого. Иногда мы хотим дать бесплатно, потому что мы хотим их просто удовлетворить, потому что они в риски уйти. Иногда мы хотим дать, не хотим дать, потому что они копейки платят.\n\nИногда у них есть контракт, и по контракту они не хотели больше, потому из-за разных причин. Может, они хотели больше платить, может, они хотели яйца морочить своим рабочим и давать им доступ на сложный функционал. Но я хочу сказать быструю вещь, что мы пытались нанять ведущего продавца, конкурента Wise Systems, и что этот продавец нам сказал интересную вещь.\n\nОн сказал, что Wise Systems имеет самую лучшую хуйню для Average Service Time в локации, и мы показали им вовин в макет насчет нашего Service Time по времени дня недели, и он немножко был в шоке, потому что они думали, что только у них это есть. Так мы возвращаемся к тому же вопросу. Артем это сделает в Query, как два пальца посадит, который скажет нам Service Time под день недели и время дня.\n\nНаверняка у него уже даже есть это в BigQuery. И теперь мы его где-то закэшируем. У него это, я имею в виду, в Analytics системе.\n\nА UI опять не готов, хотя мы говорили насчет copy and paste snapshot и вывести несчастную таблицу, которая имеет 7 рядов и 24 колонки. Или 24 колонки и 7 рядов. И это тоже полное идиотство, что они рекламируют, что ни у кого другого этого нет.\n\nУ нас это есть, API есть, база есть, все есть. И что получается? Мы его не запустили.\n\nПотому что мы не сделали copy and paste этого губленного хорглупа.", "confidence": 0.96}
{"start": 12281, "end": 12283.5, "speaker": "Semeyon S", "text": "Дэн, скажи еще раз, как эта штука называется?", "confidence": 0.95}
{"start": 12283.5, "end": 12286.0, "speaker": "Dan Khasis", "text": "Боба, пусть покажет макет.", "confidence": 0.95}
{"start": 12289.9, "end": 12292.8, "speaker": "Semeyon S", "text": "А, все, я вспомнил.", "confidence": 0.95}
{"start": 12292.8, "end": 12295.7, "speaker": "Dan Khasis", "text": "И почему это важно?", "confidence": 0.95}
{"start": 12295.7, "end": 12298.6, "speaker": "Vova", "text": "Потому что...", "confidence": 0.95}
{"start": 12298.6, "end": 12301.5, "speaker": "Dan Khasis", "text": "Семен, отпусти, рано я пошел.", "confidence": 0.95}
{"start": 12301.5, "end": 12304.4, "speaker": "Dan Khasis", "text": "Ты кликнешь на Customer, ты увидишь.", "confidence": 0.95}
{"start": 12304.4, "end": 12307.3, "speaker": "Dan Khasis", "text": "Ты кликнешь на Customer Location, ты увидишь.", "confidence": 0.95}
{"start": 12307.3, "end": 12310.2, "speaker": "Semeyon S", "text": "Ты кликнешь на на какой-то адрес, ты увидишь.", "confidence": 0.95}
{"start": 12310.2, "end": 12313.1, "speaker": "Dan Khasis", "text": "Вот почему эта линковка критическая?", "confidence": 0.95}
{"start": 12313.1, "end": 12316.0, "speaker": "Dan Khasis", "text": "Потому что без линковки ты ничего не становишь.", "confidence": 0.95}
{"start": 12317, "end": 12321.0, "speaker": "Dan Khasis", "text": "Relationable.", "confidence": 0.95}
{"start": 12321.0, "end": 12325.0, "speaker": "Semeyon S", "text": "Ну, в API этого еще нет, но будем разбираться.", "confidence": 0.95}
{"start": 12327, "end": 12337, "speaker": "Dan Khasis", "text": "Да, но Артем это может сделать за ночь, уже прямо сейчас. Если мы ему скажем сделать Group By, он это сделает, это будет готово завтра.", "confidence": 0.99}
{"start": 12337, "end": 12344, "speaker": "Semeyon S", "text": "Потом скопировать этого MySQL и API по-быстрому прикрутить. По-хорошему так должно работать.", "confidence": 0.94}
{"start": 12345, "end": 12347, "speaker": "Dan Khasis", "text": "Он должен сделать просто...", "confidence": 0.76}
{"start": 12347, "end": 12349, "speaker": "Dan Khasis", "text": "Ему даже MySQL не нужен.", "confidence": 0.99}
{"start": 12349, "end": 12360, "speaker": "Dan Khasis", "text": "Он может из BigQuery писать JSON, а JSON мы будем грузить в Redis, или в Dynamo, или в MySQL, или в этот...", "confidence": 0.99}
{"start": 12362, "end": 12364, "speaker": "Dan Khasis", "text": "Google Storage можно положить.", "confidence": 0.99}
{"start": 12365, "end": 12381, "speaker": "Dan Khasis", "text": "Google Storage положить, Google Storage, и у тебя кэш этого локейшена, кэш CustomerID, UUID, и она просто грузится по сессии. У нас уже есть Google Storage Credential Management.", "confidence": 0.99}
{"start": 12383, "end": 12389, "speaker": "Semeyon S", "text": "Да, главное потом здесь написать, за какой период хитмап сделан, и все.", "confidence": 0.99}
{"start": 12389, "end": 12396.0, "speaker": "Dan Khasis", "text": "Нет, там JSON Body будет, это записано.", "confidence": 0.95}
{"start": 12396.0, "end": 12403.0, "speaker": "Dan Khasis", "text": "Еще проще.", "confidence": 0.95}
{"start": 12403.0, "end": 12410.0, "speaker": "Dan Khasis", "text": "Потому что там будет метод дата описания этого объекта, потому что там не надо фильтрации делать, там не надо делать фильтрацию, нам не надо делать сортировку.", "confidence": 0.95}
{"start": 12410.0, "end": 12417.0, "speaker": "Dan Khasis", "text": "А даже если надо, мы этот JSON объект подгрузим в Elastic, или в NoSQL какой-то, в NoGoogle, очередной, как мы всегда делаем.", "confidence": 0.95}
{"start": 12420, "end": 12430, "speaker": "Semeyon S", "text": "Окей, я эту штуку тоже пометил. Так, ну, все, у меня вопросов больше нет.", "confidence": 0.55}
{"start": 12437, "end": 12439, "speaker": "Dan Khasis", "text": "По mobile у нас тоже вроде не было.", "confidence": 0.72}
{"start": 12450, "end": 12472, "speaker": "Dan Khasis", "text": "Окей, тогда звучит, что наш следующий разговор должен быть насчет следующего разговора насчет инвойсинга, насчет SAP mapping этих колонок, я SQL буду рассматривать сегодня, и такого типа вещи.", "confidence": 0.65}
{"start": 12473, "end": 12474.5, "speaker": "Semeyon S", "text": "Окей, будем готовиться.", "confidence": 0.95}
{"start": 12474.5, "end": 12476.0, "speaker": "Dan Khasis", "text": "Окей, до свидания, пока.", "confidence": 0.95}
{"start": 12476.0, "end": 12477.5, "speaker": "Semeyon S", "text": "Спасибо, пока.", "confidence": 0.95}
{"start": 12477.5, "end": 12479.0, "speaker": "Semeyon S", "text": "Пока.", "confidence": 0.95}
